pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
/**
  ******************************************************************************
  * @file    stm32f103_BitDescription.h
  * @brief   stm32f103_BitDescription.h
  ******************************************************************************
  *
  * This file contains definitions for all values that are going to be written
  * or read from register's bit fields.
  *
  * How definitions are designed?
  * #define [peripheral name]_[register name]_[bit name]__[description]     [value]
  * example:
  * #define RCC_APB2ENR_IOPAEN__GPIOA_Clock_Enable     0x1U
  * When this definition is written in bit IOPAEN of APB2ENR register of RCC
  * peripheral, its going to enable GPIOA peripheral clock.
  *
  * Guid to read macro names:
  * for decimal point in macro name,"p" character is used. example : 1p5 = 1.5
  * List of abbreviations:
  * IntrptEnbl      Interrupt Enable
  * IntrptDsbl      Interrupt Disable
  * IntrptFlgSt     Interrupt Flag is Set
  * IntrptFlgRst    Interrupt Flag is Reset
  * IntrptFlgClr    Interrupt Flag Clear
  * FlgClr          Flag Clear
  * Cmplt           Complete
  * Discont         discontinuous
  * Simul           simultaneous
  * Conv            Conversion
  * Synchronous     Sync
  * ASynchronous    Async
  *
  ******************************************************************************
  */

#pragma once

// CORTEX Preemption Priority Group
#define NVIC_PRIORITYGROUP_0__0_pre_4_sub               0x7U
#define NVIC_PRIORITYGROUP_1__1_pre_3_sub               0x6U
#define NVIC_PRIORITYGROUP_2__2_pre_2_sub               0x5U
#define NVIC_PRIORITYGROUP_3__3_pre_1_sub               0x4U
#define NVIC_PRIORITYGROUP_4__4_pre_0_sub               0x3U

#define FLAG_CLEAR										0x0

// Vector Table base offset field.This value must be a multiple of 0x200.
#define VECT_TAB_OFFSET                                 0x0U

// Time out for HSE start up
#define HSE_STARTUP_TIMEOUT                             0x500U

/******************************************************************************
 ******     FLASH
******************************************************************************/

// FLASH : ACR
#define FLASH_ACR_LATENCY__ZeroWait_0_SYSCLK_24MHz      0x0U
#define FLASH_ACR_LATENCY__OneWait_24MHz_SYSCLK_48MHz   0x1U
#define FLASH_ACR_LATENCY__TwoWait_48MHz_SYSCLK_72MHz   0x2U

#define FLASH_ACR_HLFCYA__HalfCycle_Disable              0x0U
#define FLASH_ACR_HLFCYA__HalfCycle_Enable               0x1U

#define FLASH_ACR_PRFTBE__Prefetch_Disable              0x0U
#define FLASH_ACR_PRFTBE__Prefetch_Enable               0x1U

#define FLASH_ACR_PRFTBS__PrefetchStatus_Disabled       0x0U
#define FLASH_ACR_PRFTBS__PrefetchStatus_Enabled        0x1U

// FLASH : KEYR
#define FLASH_KEYR_FKEYR__UnlockFlash_1                 0x45670123U
#define FLASH_KEYR_FKEYR__UnlockFlash_2                 0xCDEF89ABU

// FLASH : OPTKEYR
#define FLASH_OPTKEYR_OPTKEYR__UnlockOptionBytes_1      0x45670123U
#define FLASH_OPTKEYR_OPTKEYR__UnlockOptionBytes_2      0xCDEF89ABU

// FLASH : SR
#define FLASH_SR_BSY__OperationInProgress               0x1U
#define FLASH_SR_BSY__OperationFinished                 0x0U

#define FLASH_SR_PGERR__ProgrammingErrorOccurred        0x1U
#define FLASH_SR_PGERR__No_ProgrammingError             0x0U
#define FLASH_SR_PGERR__Clear_PGERR                     0x1U

#define FLASH_SR_WRPRTERR__WriteProtectionErrorOccurred 0x1U
#define FLASH_SR_WRPRTERR__No_WriteProtectionError      0x0U
#define FLASH_SR_WRPRTERR__Clear_WRPRTERR               0x1U

#define FLASH_SR_EOP__OperationCmplt                    0x1U
#define FLASH_SR_EOP__OperationNotCmplt                 0x0U
#define FLASH_SR_EOP__Clear_EOP                         0x1U

// FLASH : CR
#define FLASH_CR_PG__FlashProgrammingChosen             0x1U

#define FLASH_CR_PER__PageErase                         0x1U

#define FLASH_CR_MER__MassErase                         0x1U

#define FLASH_CR_OPTPG__OptionByteProgrammingChosen     0x1U

#define FLASH_CR_OPTER__OptionByteErase                 0x1U

#define FLASH_CR_START__StartErase                      0x1U

#define FLASH_CR_LOCK__LockFlash                        0x1U

#define FLASH_CR_LOCK__OptionbytesWrite_Enable          0x1U
#define FLASH_CR_LOCK__OptionbytesWrite_Disable         0x0U

#define FLASH_CR_ERRIE__Error_IntrptDsbl                0x0U
#define FLASH_CR_ERRIE__Error_IntrptEnbl                0x1U

#define FLASH_CR_EOPIE__EndOfOperatoin_IntrptDsbl       0x0U
#define FLASH_CR_EOPIE__EndOfOperatoin_IntrptEnbl       0x1U

// FLASH : OBR
#define FLASH_OBR_OPTERR__NoOptionByteError             0x0U
#define FLASH_OBR_OPTERR__OptionByteErrorOccurred       0x1U

#define FLASH_OBR_RDPRT__ReadProtection_Enabled         0x1U
#define FLASH_OBR_RDPRT__ReadProtection_Disabled        0x0U

#define FLASH_OBR_WDG_SW__HardwareWatchdog              0x0U
#define FLASH_OBR_WDG_SW__SoftwareWatchdog              0x1U

#define FLASH_OBR_nRST_STOP__ResetGeneratedEnteringStop 0x0U
#define FLASH_OBR_nRST_STOP__NoResetGenerated           0x1U

#define FLASH_OBR_nRST_STDBY__Reset_Generated_Entering_Standby   0x0U
#define FLASH_OBR_nRST_STDBY__NoResetGenerated                   0x1U

// FLASH : WRPR
#define FLASH_WRPR_WRP__WriteProtectionActive           0x0U
#define FLASH_WRPR_WRP__WriteProtectionNotActive        0x1U

/******************************************************************************
 ******     CRC
******************************************************************************/
#define CRC_CR_RESET__ResetCRC                          0x1U

/******************************************************************************
 ******     PWR
******************************************************************************/

// PWR : CR
#define PWR_CR_DBP__BackupDomainAccess_Disable          0x1U
#define PWR_CR_DBP__BackupDomainAccess_Enable           0x0U

#define PWR_CR_PLS__PVD_Level_2p2V                      0x0U
#define PWR_CR_PLS__PVD_Level_2p3V                      0x1U
#define PWR_CR_PLS__PVD_Level_2p4V                      0x2U
#define PWR_CR_PLS__PVD_Level_2p5V                      0x3U
#define PWR_CR_PLS__PVD_Level_2p6V                      0x4U
#define PWR_CR_PLS__PVD_Level_2p7V                      0x5U
#define PWR_CR_PLS__PVD_Level_2p8V                      0x6U
#define PWR_CR_PLS__PVD_Level_2p9V                      0x7U

#define PWR_CR_PVDE__PowerVoltageDetector_Disable       0x0U
#define PWR_CR_PVDE__PowerVoltageDetector_Enable        0x1U

