pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define PWR_CR_CSBF__Standby_FlgClr                     0x1U

#define PWR_CR_CWUF__Wakeup_FlgClr                      0x1U

#define PWR_CR_PDDS__StopMode_WhenDeepSleep             0x0U
#define PWR_CR_PDDS__StandbyMode_whenDeepSleep          0x1U

#define PWR_CR_LPDS__Regulator_On_InStopMode            0x0U
#define PWR_CR_LPDS__Regulator_LowPower_InStopMode      0x1U

// PWR : CSR
#define PWR_CSR_WUF__NO_WakeUpEvent                     0x0U
#define PWR_CSR_WUF__WakeUpEventReceived                0x1U

#define PWR_CSR_SBF__NotBeenInStandbyMode               0x0U
#define PWR_CSR_SBF__BeenInStandbyMode                  0x1U

#define PWR_CSR_PVDO__VddHigherThanThreshold            0x0U
#define PWR_CSR_PVDO__VddLowerThanThreshold             0x1U

#define PWR_CSR_EWUP__WakeupPin_IsUsedAsGPIO            0x0U
#define PWR_CSR_EWUP__WakeupPin_IsUsedAsWakeup          0x1U

/******************************************************************************
 ******     BKP
******************************************************************************/

// BKP : RTCCR
#define BKP_RTCCR_CCO__Outputs_RTC_ClockDiv64OnTAMPER   0x1U

#define BKP_RTCCR_ASOE__RTC_Output_Disable              0x0U
#define BKP_RTCCR_ASOE__RTC_Output_Enable               0x1U

#define BKP_RTCCR_ASOS__AlarmPulse                      0x0U
#define BKP_RTCCR_ASOS__SecondPulse                     0x1U

// BKP : CR
#define BKP_CR_TPE__TamperPin_FreeForGPIO               0x0U
#define BKP_CR_TPE__TamperPin_Enable                    0x1U

#define BKP_CR_TPAL__HighLeverOnTamperResetRegisters    0x0U
#define BKP_CR_TPAL__LowLeverOnTamperResetRegisters     0x1U

// BKP : CSR
#define BKP_CSR_CTE__TamperEventClear                   0x1U

#define BKP_CSR_CTI__TamperInterruptClear               0x1U

#define BKP_CSR_TPIE__Tamper_IntrptDsbl                 0x0U
#define BKP_CSR_TPIE__Tamper_IntrptEnbl                 0x1U

#define BKP_CSR_TEF__NoTamperEvent                      0x0U
#define BKP_CSR_TEF__TamperEventOccurred                0x1U

#define BKP_CSR_TIF__NoTamperInterrupt                  0x0U
#define BKP_CSR_TIF__TamperInterruptOccurred            0x1U

/******************************************************************************
 ******     RCC
******************************************************************************/

// RCC : CR
#define RCC_CR_PLLRDY__PLL_unLocked                     0x0U
#define RCC_CR_PLLRDY__PLL_Locked                       0x1U

#define RCC_CR_PLLON__PLL_OFF                           0x0U
#define RCC_CR_PLLON__PLL_ON                            0x1U

#define RCC_CR_CSSON__ClockDetector_OFF                 0x0U
#define RCC_CR_CSSON__ClockDetector_ON                  0x1U

#define RCC_CR_HSEBYP__OscillatorNotBypassed            0x0U
#define RCC_CR_HSEBYP__OscillatorBypassed               0x1U

#define RCC_CR_HSERDY__HSE_NotReady                     0x0U
#define RCC_CR_HSERDY__HSE_Ready                        0x1U

#define RCC_CR_HSEON__HSE_OFF                           0x0U
#define RCC_CR_HSEON__HSE_ON                            0x1U

#define RCC_CR_HSIRDY__HSI_NotReady                     0x0U
#define RCC_CR_HSIRDY__HSI_Ready                        0x1U

#define RCC_CR_HSION__HSI_OFF                           0x0U
#define RCC_CR_HSION__HSI_ON                            0x1U

// RCC : CFGR
#define RCC_CFGR_MCO__NoClock                           0x0U
#define RCC_CFGR_MCO__SYSCLK                            0x4U
#define RCC_CFGR_MCO__HSI                               0x5U
#define RCC_CFGR_MCO__HSE                               0x6U
#define RCC_CFGR_MCO__PLL_DividedBy2                    0x7U

#define RCC_CFGR_USBPRE__PLL_Is_Divided_1p5             0x0U
#define RCC_CFGR_USBPRE__PLL_Not_Divided                0x1U

#define RCC_CFGR_PLLMUL__InputClockx2                   0x0U
#define RCC_CFGR_PLLMUL__InputClockx3                   0x1U
#define RCC_CFGR_PLLMUL__InputClockx4                   0x2U
#define RCC_CFGR_PLLMUL__InputClockx5                   0x3U
#define RCC_CFGR_PLLMUL__InputClockx6                   0x4U
#define RCC_CFGR_PLLMUL__InputClockx7                   0x5U
#define RCC_CFGR_PLLMUL__InputClockx8                   0x6U
#define RCC_CFGR_PLLMUL__InputClockx9                   0x7U
#define RCC_CFGR_PLLMUL__InputClockx7                   0x5U
#define RCC_CFGR_PLLMUL__InputClockx8                   0x6U
#define RCC_CFGR_PLLMUL__InputClockx9                   0x7U
#define RCC_CFGR_PLLMUL__InputClockx10                  0x8U
#define RCC_CFGR_PLLMUL__InputClockx11                  0x9U
#define RCC_CFGR_PLLMUL__InputClockx12                  0xAU
#define RCC_CFGR_PLLMUL__InputClockx13                  0xBU
#define RCC_CFGR_PLLMUL__InputClockx14                  0xCU
#define RCC_CFGR_PLLMUL__InputClockx15                  0xDU
#define RCC_CFGR_PLLMUL__InputClockx16                  0xEU

#define RCC_CFGR_PLLXTPRE__HSE_NotDivided               0x0U
#define RCC_CFGR_PLLXTPRE__HSE_Dividedby_2              0x1U

#define RCC_CFGR_PLLSRC__HSI_DividedBy_2                0x0U
#define RCC_CFGR_PLLSRC__HSE                            0x1U

#define RCC_CFGR_ADCPRE__PCLK2_DividedBy_2              0x0U
#define RCC_CFGR_ADCPRE__PCLK2_DividedBy_4              0x1U
#define RCC_CFGR_ADCPRE__PCLK2_DividedBy_6              0x2U
#define RCC_CFGR_ADCPRE__PCLK2_DividedBy_8              0x3U

#define RCC_CFGR_PPRE2__HCLK_NotDivided                 0x0U
#define RCC_CFGR_PPRE2__HCLK_DividedBy_2                0x4U
#define RCC_CFGR_PPRE2__HCLK_DividedBy_4                0x5U
#define RCC_CFGR_PPRE2__HCLK_DividedBy_8                0x6U
#define RCC_CFGR_PPRE2__HCLK_DividedBy_16               0x7U

#define RCC_CFGR_PPRE1__HCLK_NotDivided                 0x0U
#define RCC_CFGR_PPRE1__HCLK_DividedBy_2                0x4U
#define RCC_CFGR_PPRE1__HCLK_DividedBy_4                0x5U
#define RCC_CFGR_PPRE1__HCLK_DividedBy_8                0x6U
#define RCC_CFGR_PPRE1__HCLK_DividedBy_16               0x7U

#define RCC_CFGR_HPRE__SYSCLK_NotDivided                0x0U
#define RCC_CFGR_HPRE__SYSCLK_DividedBy_2               0x8U
#define RCC_CFGR_HPRE__SYSCLK_DividedBy_4               0x9U
#define RCC_CFGR_HPRE__SYSCLK_DividedBy_8               0xAU
#define RCC_CFGR_HPRE__SYSCLK_DividedBy_16              0xBU
#define RCC_CFGR_HPRE__SYSCLK_DividedBy_64              0xCU
#define RCC_CFGR_HPRE__SYSCLK_DividedBy_128             0xDU
#define RCC_CFGR_HPRE__SYSCLK_DividedBy_256             0xEU
#define RCC_CFGR_HPRE__SYSCLK_DividedBy_512             0xFU

#define RCC_CFGR_SWS__SwitchStatus_HSI                  0x0U
#define RCC_CFGR_SWS__SwitchStatus_HSE                  0x1U
#define RCC_CFGR_SWS__SwitchStatus_PLL                  0x2U

#define RCC_CFGR_SW__HSI                                0x0U
#define RCC_CFGR_SW__HSE                                0x1U
#define RCC_CFGR_SW__PLL                                0x2U

// RCC : CIR
#define RCC_CIR_LSIRDYF__LSI_Ready_IntrptFlgRst         0x0U
#define RCC_CIR_LSIRDYF__LSI_Ready_IntrptFlgSt          0x1U

#define RCC_CIR_LSERDYF__LSE_Ready_IntrptFlgRst         0x0U
#define RCC_CIR_LSERDYF__LSE_Ready_IntrptFlgSt          0x1U

