pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define RCC_CIR_HSIRDYF__HSI_Ready_IntrptFlgRst         0x0U
#define RCC_CIR_HSIRDYF__HSI_Ready_IntrptFlgSt          0x1U

#define RCC_CIR_HSERDYF__HSE_Ready_IntrptFlgRst         0x0U
#define RCC_CIR_HSERDYF__HSE_Ready_IntrptFlgSt          0x1U

#define RCC_CIR_PLLRDYF__PLL_Ready_IntrptFlgRst         0x0U
#define RCC_CIR_PLLRDYF__PLL_Ready_IntrptFlgSt          0x1U

#define RCC_CIR_CSSF__CCS_Ready_IntrptFlgRst            0x0U
#define RCC_CIR_CSSF__CSS_Ready_IntrptFlgSt             0x1U

#define RCC_CIR_LSIRDYIE__LSIRDY_IntrptDsbl             0x0U
#define RCC_CIR_LSIRDYIE__LSIRDY_IntrptEnbl             0x1U

#define RCC_CIR_LSERDYIE__LSERDY_IntrptDsbl             0x0U
#define RCC_CIR_LSERDYIE__LSERDY_IntrptEnbl             0x1U

#define RCC_CIR_HSIRDYIE__HSIRDY_IntrptDsbl             0x0U
#define RCC_CIR_HSIRDYIE__HSIRDY_IntrptEnbl             0x1U

#define RCC_CIR_HSERDYIE__HSERDY_IntrptDsbl             0x0U
#define RCC_CIR_HSERDYIE__HSERDY_IntrptEnbl             0x1U

#define RCC_CIR_PLLRDYIE__PLLRDY_IntrptDsbl             0x0U
#define RCC_CIR_PLLRDYIE__PLLRDY_IntrptEnbl             0x1U

#define RCC_CIR_LSIRDYC__LSIRDYF_FlgClr                 0x1U

#define RCC_CIR_LSERDYC__LSERDYF_FlgClr                 0x1U

#define RCC_CIR_HSIRDYC__HSIRDYF_FlgClr                 0x1U

#define RCC_CIR_HSERDYC__HSERDYF_FlgClr                 0x1U

#define RCC_CIR_PLLRDYC__PLLRDYF_FlgClr                 0x1U

#define RCC_CIR_CSSC__CSSF_FlgClr                       0x1U

// RCC : APB2RSTR
#define RCC_APB2RSTR_AFIORST__Reset_AFIO                0x1U

#define RCC_APB2RSTR_IOPARST__Reset_GPIOA               0x1U

#define RCC_APB2RSTR_IOPBRST__Reset_GPIOB               0x1U

#define RCC_APB2RSTR_IOPCRST__Reset_GPIOC               0x1U

#define RCC_APB2RSTR_IOPDRST__Reset_GPIOD               0x1U

#define RCC_APB2RSTR_IOPERST__Reset_GPIOE               0x1U

#define RCC_APB2RSTR_IOPFRST__Reset_GPIOF               0x1U

#define RCC_APB2RSTR_IOPGRST__Reset_GPIOG               0x1U

#define RCC_APB2RSTR_ADC1RST__Reset_ADC1                0x1U

#define RCC_APB2RSTR_ADC2RST__Reset_ADC2                0x1U

#define RCC_APB2RSTR_TIM1RST__Reset_TIM1                0x1U

#define RCC_APB2RSTR_SPI1RST__Reset_SPI1                0x1U

#define RCC_APB2RSTR_TIM8RST__Reset_TIM8                0x1U

#define RCC_APB2RSTR_USART1RST__Reset_USART1            0x1U

#define RCC_APB2RSTR_ADC3RST__Reset_ADC3                0x1U

#define RCC_APB2RSTR_TIM9RST__Reset_TIM9                0x1U

#define RCC_APB2RSTR_TIM10RST__Reset_TIM10              0x1U

#define RCC_APB2RSTR_TIM11RST__Reset_TIM11              0x1U

// RCC : APB1RSTR
#define RCC_APB1RSTR_TIM2RST__Reset_TIM2                0x1U

#define RCC_APB1RSTR_TIM3RST__Reset_TIM3                0x1U

#define RCC_APB1RSTR_TIM4RST__Reset_TIM4                0x1U

#define RCC_APB1RSTR_TIM5RST__Reset_TIM5                0x1U

#define RCC_APB1RSTR_TIM6RST__Reset_TIM6                0x1U

#define RCC_APB1RSTR_TIM7RST__Reset_TIM7                0x1U

#define RCC_APB1RSTR_TIM12RST__Reset_TIM12              0x1U

#define RCC_APB1RSTR_TIM13RST__Reset_TIM13              0x1U

#define RCC_APB1RSTR_TIM14RST__Reset_TIM14              0x1U

#define RCC_APB1RSTR_WWDGRST__Reset_WWDG                0x1U

#define RCC_APB1RSTR_SPI2RST__Reset_SPI2                0x1U

#define RCC_APB1RSTR_SPI3RST__Reset_SPI3                0x1U

#define RCC_APB1RSTR_USART2RST__Reset_USART2            0x1U

#define RCC_APB1RSTR_USART3RST__Reset_USART3            0x1U

#define RCC_APB1RSTR_UART4RST__Reset_USART4             0x1U

#define RCC_APB1RSTR_UART5RST__Reset_USART5             0x1U

#define RCC_APB1RSTR_I2C1RST__Reset_I2C1                0x1U

#define RCC_APB1RSTR_I2C2RST__Reset_I2C2                0x1U

#define RCC_APB1RSTR_USBRST__Reset_USB                  0x1U

#define RCC_APB1RSTR_CANRST__Reset_CAN                  0x1U

#define RCC_APB1RSTR_BKPRST__Reset_BKP                  0x1U

#define RCC_APB1RSTR_PWRRST__Reset_PWR                  0x1U

#define RCC_APB1RSTR_DACRST__Reset_DAC                  0x1U

// RCC : AHBENR
#define RCC_AHBENR_DMA1EN__DMA1_Clock_Enable            0x1U
#define RCC_AHBENR_DMA1EN__DMA1_Clock_Disable           0x0U

#define RCC_AHBENR_DMA2EN__DMA2_Clock_Enable            0x1U
#define RCC_AHBENR_DMA2EN__DMA2_Clock_Disable           0x0U

#define RCC_AHBENR_SRAMEN__SRAM_Clock_Enable            0x1U
#define RCC_AHBENR_SRAMEN__SRAM_Clock_Disable           0x0U

#define RCC_AHBENR_FLITFENEN__FLITFEN_Clock_Enable      0x1U
#define RCC_AHBENR_FLITFENEN__FLITFEN_Clock_Disable     0x0U

#define RCC_AHBENR_CRCEN__CRC_Clock_Enable              0x1U
#define RCC_AHBENR_CRCEN__CRC_Clock_Disable             0x0U

#define RCC_AHBENR_FSMCEN__FSMC_Clock_Enable            0x1U
#define RCC_AHBENR_FSMCEN__FSMC_Clock_Disable           0x0U

#define RCC_AHBENR_SDIOEN__SDIO_Clock_Enable            0x1U
#define RCC_AHBENR_SDIOEN__SDIO_Clock_Disable           0x0U

// RCC : APB2ENR
#define RCC_APB2ENR_AFIOEN__AFIO_Clock_Enable           0x1U
#define RCC_APB2ENR_AFIOEN__AFIO_Clock_Disable          0x0U

#define RCC_APB2ENR_IOPAEN__GPIOA_Clock_Enable          0x1U
#define RCC_APB2ENR_IOPAEN__GPIOA_Clock_Disable         0x0U

#define RCC_APB2ENR_IOPBEN__GPIOB_Clock_Enable          0x1U
#define RCC_APB2ENR_IOPBEN__GPIOB_Clock_Disable         0x0U

#define RCC_APB2ENR_IOPCEN__GPIOC_Clock_Enable          0x1U
#define RCC_APB2ENR_IOPCEN__GPIOC_Clock_Disable         0x0U

#define RCC_APB2ENR_IOPDEN__GPIOD_Clock_Enable          0x1U
#define RCC_APB2ENR_IOPDEN__GPIOD_Clock_Disable         0x0U

#define RCC_APB2ENR_IOPEEN__GPIOE_Clock_Enable          0x1U
#define RCC_APB2ENR_IOPEEN__GPIOE_Clock_Disable         0x0U

#define RCC_APB2ENR_IOPFEN__GPIOF_Clock_Enable          0x1U
#define RCC_APB2ENR_IOPFEN__GPIOF_Clock_Disable         0x0U

#define RCC_APB2ENR_IOPGEN__GPIOG_Clock_Enable          0x1U
#define RCC_APB2ENR_IOPGEN__GPIOG_Clock_Disable         0x0U

#define RCC_APB2ENR_ADC1EN__ADC1_Clock_Enable           0x1U
#define RCC_APB2ENR_ADC1EN__ADC1_Clock_Disable          0x0U

#define RCC_APB2ENR_ADC2EN__ADC2_Clock_Enable           0x1U
#define RCC_APB2ENR_ADC2EN__ADC2_Clock_Disable          0x0U

#define RCC_APB2ENR_TIM1EN__TIM1_Clock_Enable           0x1U
#define RCC_APB2ENR_TIM1EN__TIM1_Clock_Disable          0x0U

#define RCC_APB2ENR_SPI1EN__SPI1_Clock_Enable           0x1U
#define RCC_APB2ENR_SPI1EN__SPI1_Clock_Disable          0x0U

#define RCC_APB2ENR_TIM8EN__TIM8_Clock_Enable           0x1U
#define RCC_APB2ENR_TIM8EN__TIM8_Clock_Disable          0x0U

