pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define RCC_APB2ENR_USART1EN__USART1_Clock_Enable       0x1U
#define RCC_APB2ENR_USART1EN__USART1_Clock_Disable      0x0U

#define RCC_APB2ENR_ADC3EN__ADC3_Clock_Enable           0x1U
#define RCC_APB2ENR_ADC3EN__ADC3_Clock_Disable          0x0U

#define RCC_APB2ENR_TIM9EN__TIM9_Clock_Enable           0x1U
#define RCC_APB2ENR_TIM9EN__TIM9_Clock_Disable          0x0U

#define RCC_APB2ENR_TIM10EN__TIM10_Clock_Enable         0x1U
#define RCC_APB2ENR_TIM10EN__TIM10_Clock_Disable        0x0U

#define RCC_APB2ENR_TIM11EN__TIM11_Clock_Enable         0x1U
#define RCC_APB2ENR_TIM11EN__TIM11_Clock_Disable        0x0U

// RCC : APB1ENR
#define RCC_APB1ENR_TIM2EN__TIM2_Clock_Enable           0x1U
#define RCC_APB1ENR_TIM2EN__TIM2_Clock_Disable          0x0U

#define RCC_APB1ENR_TIM3EN__TIM3_Clock_Enable           0x1U
#define RCC_APB1ENR_TIM3EN__TIM3_Clock_Disable          0x0U

#define RCC_APB1ENR_TIM4EN__TIM4_Clock_Enable           0x1U
#define RCC_APB1ENR_TIM4EN__TIM4_Clock_Disable          0x0U

#define RCC_APB1ENR_TIM5EN__TIM5_Clock_Enable           0x1U
#define RCC_APB1ENR_TIM5EN__TIM5_Clock_Disable          0x0U

#define RCC_APB1ENR_TIM6EN__TIM6_Clock_Enable           0x1U
#define RCC_APB1ENR_TIM6EN__TIM6_Clock_Disable          0x0U

#define RCC_APB1ENR_TIM7EN__TIM7_Clock_Enable           0x1U
#define RCC_APB1ENR_TIM7EN__TIM7_Clock_Disable          0x0U

#define RCC_APB1ENR_TIM12EN__TIM12_Clock_Enable         0x1U
#define RCC_APB1ENR_TIM12EN__TIM12_Clock_Disable        0x0U

#define RCC_APB1ENR_TIM13EN__TIM13_Clock_Enable         0x1U
#define RCC_APB1ENR_TIM13EN__TIM13_Clock_Disable        0x0U

#define RCC_APB1ENR_TIM14EN__TIM14_Clock_Enable         0x1U
#define RCC_APB1ENR_TIM14EN__TIM14_Clock_Disable        0x0U

#define RCC_APB1ENR_WWDGEN__WWDG_Clock_Enable           0x1U
#define RCC_APB1ENR_WWDGEN__WWDG_Clock_Disable          0x0U

#define RCC_APB1ENR_SPI2EN__SPI2_Clock_Enable           0x1U
#define RCC_APB1ENR_SPI2EN__SPI2_Clock_Disable          0x0U

#define RCC_APB1ENR_SPI3EN__SPI3_Clock_Enable           0x1U
#define RCC_APB1ENR_SPI3EN__SPI3_Clock_Disable          0x0U

#define RCC_APB1ENR_USART2EN__USART2_Clock_Enable       0x1U
#define RCC_APB1ENR_USART2EN__USART2_Clock_Disable      0x0U

#define RCC_APB1ENR_USART3EN__USART3_Clock_Enable       0x1U
#define RCC_APB1ENR_USART3EN__USART3_Clock_Disable      0x0U

#define RCC_APB1ENR_UART4EN__UART4_Clock_Enable         0x1U
#define RCC_APB1ENR_UART4EN__UART4_Clock_Disable        0x0U

#define RCC_APB1ENR_UART5EN__UART5_Clock_Enable         0x1U
#define RCC_APB1ENR_UART5EN__UART5_Clock_Disable        0x0U

#define RCC_APB1ENR_I2C1EN__I2C1_Clock_Enable           0x1U
#define RCC_APB1ENR_I2C1EN__I2C1_Clock_Disable          0x0U

#define RCC_APB1ENR_I2C2EN__I2C2_Clock_Enable           0x1U
#define RCC_APB1ENR_I2C2EN__I2C2_Clock_Disable          0x0U

#define RCC_APB1ENR_USBEN__USB_Clock_Enable             0x1U
#define RCC_APB1ENR_USBEN__USB_Clock_Disable            0x0U

#define RCC_APB1ENR_CANEN__CAN_Clock_Enable             0x1U
#define RCC_APB1ENR_CANEN__CAN_Clock_Disable            0x0U

#define RCC_APB1ENR_BKPEN__BKP_Clock_Enable             0x1U
#define RCC_APB1ENR_BKPEN__BKP_Clock_Disable            0x0U

#define RCC_APB1ENR_PWREN__PWR_Clock_Enable             0x1U
#define RCC_APB1ENR_PWREN__PWR_Clock_Disable            0x0U

#define RCC_APB1ENR_DACEN__DAC_Clock_Enable             0x1U
#define RCC_APB1ENR_DACEN__DAC_Clock_Disable            0x0U

// RCC : BDCR
#define RCC_BDCR_LSEON__External_32kHz_OFF              0x0U
#define RCC_BDCR_LSEON__External_32kHz_ON               0x1U

#define RCC_BDCR_LSERDY__External_32kHz_NotReady        0x0U
#define RCC_BDCR_LSERDY__External_32kHz_Ready           0x1U

#define RCC_BDCR_LSEBYP__External_32kHz_NotBypassed     0x0U
#define RCC_BDCR_LSEBYP__External_32kHz_Bypassed        0x1U

#define RCC_BDCR_RTCSEL__RTC_Source_NoClock             0x0U
#define RCC_BDCR_RTCSEL__RTC_Source_LSE                 0x1U
#define RCC_BDCR_RTCSEL__RTC_Source_LSI                 0x2U
#define RCC_BDCR_RTCSEL__RTC_Source_HSEdiv128           0x3U

#define RCC_BDCR_RTCEN__RTC_Clock_Disable               0x0U
#define RCC_BDCR_RTCEN__RTC_Clock_Enable                0x1U

#define RCC_BDCR_BDRST__Reset_NotActive                 0x0U
#define RCC_BDCR_BDRST__BackUp_Reset                    0x1U

// RCC : CSR
#define RCC_CSR_LSION__Internal_40kHz_OFF               0x0U
#define RCC_CSR_LSION__Internal_40kHz_ON                0x1U

#define RCC_CSR_LSIRDY__Internal_40kHz_NotReady         0x0U
#define RCC_CSR_LSIRDY__Internal_40kHz_Ready            0x1U

#define RCC_CSR_RMVF__Clear_ResetFlag                   0x1U

#define RCC_CSR_PINRSTF__No_NRST_Reset                  0x0U
#define RCC_CSR_PINRSTF__NRST_ResetOccurred             0x1U

#define RCC_CSR_PORRSTF__No_PORorPDR_Reset              0x0U
#define RCC_CSR_PORRSTF__PORorPDR_ResetOccurred         0x1U

#define RCC_CSR_SFTRSTF__No_Software_Reset              0x0U
#define RCC_CSR_SFTRSTF__Software_ResetOccurred         0x1U

#define RCC_CSR_IWDGRSTF__No_IWDG_Reset                 0x0U
#define RCC_CSR_IWDGRSTF__IWDG_ResetOccurred            0x1U

#define RCC_CSR_WWDGRSTF__No_WWDG_Reset                 0x0U
#define RCC_CSR_WWDGRSTF__WWDG_ResetOccurred            0x1U

#define RCC_CSR_LPWRRSTF__No_LowPower_Reset             0x0U
#define RCC_CSR_LPWRRSTF__LowPower_ResetOccurred        0x1U

/******************************************************************************
 ******     GPIO
******************************************************************************/

// GPIO Pins Mask definitions
#define GPIO_PIN_0_MSK                                  0x1U
#define GPIO_PIN_1_MSK                                  0x2U
#define GPIO_PIN_2_MSK                                  0x4U
#define GPIO_PIN_3_MSK                                  0x8U
#define GPIO_PIN_4_MSK                                  0x10U
#define GPIO_PIN_5_MSK                                  0x20U
#define GPIO_PIN_6_MSK                                  0x40U
#define GPIO_PIN_7_MSK                                  0x80U
#define GPIO_PIN_8_MSK                                  0x100U
#define GPIO_PIN_9_MSK                                  0x200U
#define GPIO_PIN_10_MSK                                 0x400U
#define GPIO_PIN_11_MSK                                 0x800U
#define GPIO_PIN_12_MSK                                 0x1000U
#define GPIO_PIN_13_MSK                                 0x2000U
#define GPIO_PIN_14_MSK                                 0x4000U
#define GPIO_PIN_15_MSK                                 0x8000U
#define GPIO_PIN_All_MSK                                0xFFFFU

// GPIO Pins Number definitions
#define GPIO_PIN_0_NUM                                  0x0U
#define GPIO_PIN_1_NUM                                  0x1U
#define GPIO_PIN_2_NUM                                  0x2U
#define GPIO_PIN_3_NUM                                  0x3U
#define GPIO_PIN_4_NUM                                  0x4U
#define GPIO_PIN_5_NUM                                  0x5U
#define GPIO_PIN_6_NUM                                  0x6U
#define GPIO_PIN_7_NUM                                  0x7U
#define GPIO_PIN_8_NUM                                  0x8U
#define GPIO_PIN_9_NUM                                  0x9U
#define GPIO_PIN_10_NUM                                 0xAU
#define GPIO_PIN_11_NUM                                 0xBU
#define GPIO_PIN_12_NUM                                 0xCU
#define GPIO_PIN_13_NUM                                 0xDU
#define GPIO_PIN_14_NUM                                 0xEU
#define GPIO_PIN_15_NUM                                 0xFU

// GPIO : CRL
#define GPIO_CRL_MODEx__Output_2M_GP_PP                 0x2U
#define GPIO_CRL_MODEx__Output_2M_GP_OD                 0x6U
#define GPIO_CRL_MODEx__Output_2M_AF_PP                 0xAU
#define GPIO_CRL_MODEx__Output_2M_AF_OD                 0xEU
#define GPIO_CRL_MODEx__Output_10M_GP_PP                0x1U
#define GPIO_CRL_MODEx__Output_10M_GP_OD                0x5U
#define GPIO_CRL_MODEx__Output_10M_AF_PP                0x9U
#define GPIO_CRL_MODEx__Output_10M_AF_OD                0xDU
#define GPIO_CRL_MODEx__Output_50M_GP_PP                0x3U
#define GPIO_CRL_MODEx__Output_50M_GP_OD                0x7U
#define GPIO_CRL_MODEx__Output_50M_AF_PP                0xBU
#define GPIO_CRL_MODEx__Output_50M_AF_OD                0xFU
#define GPIO_CRL_MODEx__Input_Float                     0x4U
#define GPIO_CRL_MODEx__Input_PuPd                      0x8U
#define GPIO_CRL_MODEx__Input_Analog                    0x0U

// GPIO : CRH
#define GPIO_CRH_MODEx__Output_2M_GP_PP                 0x2U
#define GPIO_CRH_MODEx__Output_2M_GP_OD                 0x6U
#define GPIO_CRH_MODEx__Output_2M_AF_PP                 0xAU
#define GPIO_CRH_MODEx__Output_2M_AF_OD                 0xEU
#define GPIO_CRH_MODEx__Output_10M_GP_PP                0x1U
#define GPIO_CRH_MODEx__Output_10M_GP_OD                0x5U
#define GPIO_CRH_MODEx__Output_10M_AF_PP                0x9U
#define GPIO_CRH_MODEx__Output_10M_AF_OD                0xDU
#define GPIO_CRH_MODEx__Output_50M_GP_PP                0x3U
#define GPIO_CRH_MODEx__Output_50M_GP_OD                0x7U
#define GPIO_CRH_MODEx__Output_50M_AF_PP                0xBU
#define GPIO_CRH_MODEx__Output_50M_AF_OD                0xFU
#define GPIO_CRH_MODEx__Input_Float                     0x4U
#define GPIO_CRH_MODEx__Input_PuPd                      0x8U
#define GPIO_CRH_MODEx__Input_Analog                    0x0U

