pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
// GPIO : IDR
#define GPIO_IDR_IDRx__PinIsReset                       0x0U
#define GPIO_IDR_IDRx__PinIsSet                         0x1U

// GPIO : ODR
#define GPIO_ODR_ODRx__PullUp                           0x1U
#define GPIO_ODR_ODRx__PullDown                         0x0U
#define GPIO_ODR_ODRx__PinSet                           0x1U
#define GPIO_ODR_ODRx__PinReset                         0x0U

// GPIO : BSRR
#define GPIO_BSRR_BSx__PinSet                           0x1U
#define GPIO_BSRR_BRx__PinReset                         0x1U

// GPIO : BRR
#define GPIO_BRR_BRx__PinReset                          0x1U

// GPIO : LCKR
#define GPIO_LCKR_LCKy__PortConfigNotLocked             0x0U
#define GPIO_LCKR_LCKy__PortConfigLocked                0x1U

#define GPIO_LCKR_LCKK__PortConfigLockKeyNotActive      0x0U
#define GPIO_LCKR_LCKK__PortConfigLockKeyActive         0x1U

/******************************************************************************
 ******     AFIO
******************************************************************************/

// AFIO : EVCR
#define AFIO_EVCR_EVOE__CortexEventOut_Disable          0x0U
#define AFIO_EVCR_EVOE__CortexEventOut_Enable           0x1U

#define AFIO_EVCR_PORT__CortexEventOut_PA               0x0U
#define AFIO_EVCR_PORT__CortexEventOut_PB               0x1U
#define AFIO_EVCR_PORT__CortexEventOut_PC               0x2U
#define AFIO_EVCR_PORT__CortexEventOut_PD               0x3U
#define AFIO_EVCR_PORT__CortexEventOut_PE               0x4U

#define AFIO_EVCR_PIN__CortexEventOut_Px0               0x0U
#define AFIO_EVCR_PIN__CortexEventOut_Px1               0x1U
#define AFIO_EVCR_PIN__CortexEventOut_Px2               0x2U
#define AFIO_EVCR_PIN__CortexEventOut_Px3               0x3U
#define AFIO_EVCR_PIN__CortexEventOut_Px4               0x4U
#define AFIO_EVCR_PIN__CortexEventOut_Px5               0x5U
#define AFIO_EVCR_PIN__CortexEventOut_Px6               0x6U
#define AFIO_EVCR_PIN__CortexEventOut_Px7               0x7U
#define AFIO_EVCR_PIN__CortexEventOut_Px8               0x8U
#define AFIO_EVCR_PIN__CortexEventOut_Px9               0x9U
#define AFIO_EVCR_PIN__CortexEventOut_Px10              0xAU
#define AFIO_EVCR_PIN__CortexEventOut_Px11              0xBU
#define AFIO_EVCR_PIN__CortexEventOut_Px12              0xCU
#define AFIO_EVCR_PIN__CortexEventOut_Px13              0xDU
#define AFIO_EVCR_PIN__CortexEventOut_Px14              0xEU
#define AFIO_EVCR_PIN__CortexEventOut_Px15              0xFU

// AFIO : MAPR
#define AFIO_MAPR_SPI1_REMAP__NoReMap_NSS_PA4_SCK_PA5_MISO_PA6_MOSI_PA7   0x0U
#define AFIO_MAPR_SPI1_REMAP__ReMap_NSS_PA15_SCK_PB3_MISO_PB4_MOSI_PB5    0x1U

#define AFIO_MAPR_I2C1_REMAP__NoReMap_SCL_PB6_SDA_PB7   0x0U
#define AFIO_MAPR_I2C1_REMAP__ReMap_SCL_PB8_SDA_PB9     0x1U

#define AFIO_MAPR_USART1_REMAP__NoReMap_TX_PA9_RX_PA10  0x0U
#define AFIO_MAPR_USART1_REMAP__ReMap_TX_PB6_RX_PB7     0x1U

#define AFIO_MAPR_USART2_REMAP__NoReMap_CTS_PA0_RTS_PA1_TX_PA2_RX_PA3_CK_PA4            0x0U
#define AFIO_MAPR_USART2_REMAP__ReMap_CTS_PD3_RTS_PD4_TX_PD5_RX_PD6_CK_PD7              0x1U

#define AFIO_MAPR_USART3_REMAP__NoReMap_TX_PB10_RX_PB11_CK_PB12_CTS_PB13_RTS_PB14       0x0U
#define AFIO_MAPR_USART3_REMAP__PartialReMap_TX_PC10_RX_PC11_CK_PC12_CTS_PB13_RTS_PB14  0x1U
#define AFIO_MAPR_USART3_REMAP__FullReMap_TX_PD8_RX_PD9_CK_PD10_CTS_PD11_RTS_PD12       0x3U

#define AFIO_MAPR_TIM1_REMAP__NoReMap_ETR_PA12_CH1_PA8_CH2_PA9_CH3_PA10_CH4_PA11_BKIN_PB12_CH1N_PB13_CH2N_PB14_CH3N_PB15    0x0U
#define AFIO_MAPR_TIM1_REMAP__PartialReMap_ETR_PA12_CH1_PA8_CH2_PA9_CH3_PA10_CH4_PA11_BKIN_PA6_CH1N_PA7_CH2N_PB0_CH3N_PB1   0x1U
#define AFIO_MAPR_TIM1_REMAP__FullReMap_ETR_PE7_CH1_PE9_CH2_PE11_CH3_PE13_CH4_PE14_BKIN_PE15_CH1N_PE8_CH2N_PE10_CH3N_PE12   0x3U

#define AFIO_MAPR_TIM2_REMAP__NoReMap_CH1_ETR_PA0_CH2_PA1_CH3_PA2_CH4_PA3               0x0U
#define AFIO_MAPR_TIM2_REMAP__PartialReMap_CH1_ETR_PA15_CH2_PB3_CH3_PA2_CH4_PA3         0x1U
#define AFIO_MAPR_TIM2_REMAP__PartialReMap_CH1_ETR_PA0_CH2_PA1_CH3_PB10_CH4_PB11        0x2U
#define AFIO_MAPR_TIM2_REMAP__FullReMap_CH1_ETR_PA15_CH2_PB3_CH3_PB10_CH4_PB11          0x3U

#define AFIO_MAPR_TIM3_REMAP__NoReMap_ETR_PE0_CH1_PA6_CH2_PA7_CH3_PB0_CH4_PB1           0x0U
#define AFIO_MAPR_TIM3_REMAP__PartialReMap_ETR_PE0_CH1_PB4_CH2_PB5_CH3_PB0_CH4_PB1      0x2U
#define AFIO_MAPR_TIM3_REMAP__FullReMap_ETR_PE0_CH1_PC6_CH2_PC7_CH3_PC8_CH4_PC9         0x3U

#define AFIO_MAPR_TIM4_REMAP__NoReMap_ETR_PE0_CH1_PB6_CH2_PB7_CH3_PB8_CH4_PB9           0x0U
#define AFIO_MAPR_TIM4_REMAP__FullReMap_ETR_PE0_CH1_PD12_CH2_PD13_CH3_PD14_CH4_PD15     0x1U

#define AFIO_MAPR_CAN_REMAP__RX_PA11_TX_PA12            0x0U
#define AFIO_MAPR_CAN_REMAP__RX_PB8_TX_PB9              0x2U
#define AFIO_MAPR_CAN_REMAP__RX_PD0_TX_PD1              0x3U

#define AFIO_MAPR_PD01_REMAP__NoReMap                   0x0U
#define AFIO_MAPR_PD01_REMAP__PD0_OSC_IN_PD1_OSC_OUT    0x1U

#define AFIO_MAPR_TIM5CH4_IREMAP__CH4_PA0               0x0U
#define AFIO_MAPR_TIM4CH4_IREMAP__CH4_LSI               0x1U

#define AFIO_MAPR_ADC1_ETRGINJ__ADC1_Injected_Trigger_EXTI15      0x0U
#define AFIO_MAPR_ADC1_ETRGINJ__ADC1_Injected_Trigger_TIM8_CH4    0x1U

#define AFIO_MAPR_ADC1_ETRGREG__ADC1_Regular_Trigger_EXTI11       0x0U
#define AFIO_MAPR_ADC1_ETRGREG__ADC1_Regular_Trigger_TIM8_TRGO    0x1U

#define AFIO_MAPR_ADC2_ETRGINJ__ADC2_Injected_Trigger_EXTI15      0x0U
#define AFIO_MAPR_ADC2_ETRGINJ__ADC2_Injected_Trigger_TIM8_CH4    0x1U

#define AFIO_MAPR_ADC2_ETRGREG__ADC2_Regular_Trigger_EXTI11       0x0U
#define AFIO_MAPR_ADC2_ETRGREG__ADC2_Regular_Trigger_TIM8_TRGO    0x1U

#define AFIO_MAPR_SWJ_CFG__FullSWJ_ResetState           0x0U
#define AFIO_MAPR_SWJ_CFG__FullSWJ_Without_NJTRST       0x1U
#define AFIO_MAPR_SWJ_CFG__JTAG_Disable_SW_Enable       0x2U
#define AFIO_MAPR_SWJ_CFG__JTAG_Disable_SW_Disable      0x4U

// AFIO : EXTICR1
#define AFIO_EXTICR1_EXTI0__PA0                         0x0U
#define AFIO_EXTICR1_EXTI0__PB0                         0x1U
#define AFIO_EXTICR1_EXTI0__PC0                         0x2U
#define AFIO_EXTICR1_EXTI0__PD0                         0x3U
#define AFIO_EXTICR1_EXTI0__PE0                         0x4U
#define AFIO_EXTICR1_EXTI0__PF0                         0x5U
#define AFIO_EXTICR1_EXTI0__PG0                         0x6U

#define AFIO_EXTICR1_EXTI1__PA1                         0x0U
#define AFIO_EXTICR1_EXTI1__PB1                         0x1U
#define AFIO_EXTICR1_EXTI1__PC1                         0x2U
#define AFIO_EXTICR1_EXTI1__PD1                         0x3U
#define AFIO_EXTICR1_EXTI1__PE1                         0x4U
#define AFIO_EXTICR1_EXTI1__PF1                         0x5U
#define AFIO_EXTICR1_EXTI1__PG1                         0x6U

#define AFIO_EXTICR1_EXTI2__PA2                         0x0U
#define AFIO_EXTICR1_EXTI2__PB2                         0x1U
#define AFIO_EXTICR1_EXTI2__PC2                         0x2U
#define AFIO_EXTICR1_EXTI2__PD2                         0x3U
#define AFIO_EXTICR1_EXTI2__PE2                         0x4U
#define AFIO_EXTICR1_EXTI2__PF2                         0x5U
#define AFIO_EXTICR1_EXTI2__PG2                         0x6U

#define AFIO_EXTICR1_EXTI3__PA3                         0x0U
#define AFIO_EXTICR1_EXTI3__PB3                         0x1U
#define AFIO_EXTICR1_EXTI3__PC3                         0x2U
#define AFIO_EXTICR1_EXTI3__PD3                         0x3U
#define AFIO_EXTICR1_EXTI3__PE3                         0x4U
#define AFIO_EXTICR1_EXTI3__PF3                         0x5U
#define AFIO_EXTICR1_EXTI3__PG3                         0x6U

// AFIO : EXTICR2
#define AFIO_EXTICR2_EXTI4__PA4                         0x0U
#define AFIO_EXTICR2_EXTI4__PB4                         0x1U
#define AFIO_EXTICR2_EXTI4__PC4                         0x2U
#define AFIO_EXTICR2_EXTI4__PD4                         0x3U
#define AFIO_EXTICR2_EXTI4__PE4                         0x4U
#define AFIO_EXTICR2_EXTI4__PF4                         0x5U
#define AFIO_EXTICR2_EXTI4__PG4                         0x6U

#define AFIO_EXTICR2_EXTI5__PA5                         0x0U
#define AFIO_EXTICR2_EXTI5__PB5                         0x1U
#define AFIO_EXTICR2_EXTI5__PC5                         0x2U
#define AFIO_EXTICR2_EXTI5__PD5                         0x3U
#define AFIO_EXTICR2_EXTI5__PE5                         0x4U
#define AFIO_EXTICR2_EXTI5__PF5                         0x5U
#define AFIO_EXTICR2_EXTI5__PG5                         0x6U

#define AFIO_EXTICR2_EXTI6__PA6                         0x0U
#define AFIO_EXTICR2_EXTI6__PB6                         0x1U
#define AFIO_EXTICR2_EXTI6__PC6                         0x2U
#define AFIO_EXTICR2_EXTI6__PD6                         0x3U
#define AFIO_EXTICR2_EXTI6__PE6                         0x4U
#define AFIO_EXTICR2_EXTI6__PF6                         0x5U
#define AFIO_EXTICR2_EXTI6__PG6                         0x6U

#define AFIO_EXTICR2_EXTI7__PA7                         0x0U
#define AFIO_EXTICR2_EXTI7__PB7                         0x1U
#define AFIO_EXTICR2_EXTI7__PC7                         0x2U
#define AFIO_EXTICR2_EXTI7__PD7                         0x3U
#define AFIO_EXTICR2_EXTI7__PE7                         0x4U
#define AFIO_EXTICR2_EXTI7__PF7                         0x5U
#define AFIO_EXTICR2_EXTI7__PG7                         0x6U

// AFIO : EXTICR3
#define AFIO_EXTICR3_EXTI8__PA8                         0x0U
#define AFIO_EXTICR3_EXTI8__PB8                         0x1U
#define AFIO_EXTICR3_EXTI8__PC8                         0x2U
#define AFIO_EXTICR3_EXTI8__PD8                         0x3U
#define AFIO_EXTICR3_EXTI8__PE8                         0x4U
#define AFIO_EXTICR3_EXTI8__PF8                         0x5U
#define AFIO_EXTICR3_EXTI8__PG8                         0x6U

