pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define AFIO_EXTICR3_EXTI9__PA9                         0x0U
#define AFIO_EXTICR3_EXTI9__PB9                         0x1U
#define AFIO_EXTICR3_EXTI9__PC9                         0x2U
#define AFIO_EXTICR3_EXTI9__PD9                         0x3U
#define AFIO_EXTICR3_EXTI9__PE9                         0x4U
#define AFIO_EXTICR3_EXTI9__PF9                         0x5U
#define AFIO_EXTICR3_EXTI9__PG9                         0x6U

#define AFIO_EXTICR3_EXTI10__PA10                       0x0U
#define AFIO_EXTICR3_EXTI10__PB10                       0x1U
#define AFIO_EXTICR3_EXTI10__PC10                       0x2U
#define AFIO_EXTICR3_EXTI10__PD10                       0x3U
#define AFIO_EXTICR3_EXTI10__PE10                       0x4U
#define AFIO_EXTICR3_EXTI10__PF10                       0x5U
#define AFIO_EXTICR3_EXTI10__PG10                       0x6U

#define AFIO_EXTICR3_EXTI11__PA11                       0x0U
#define AFIO_EXTICR3_EXTI11__PB11                       0x1U
#define AFIO_EXTICR3_EXTI11__PC11                       0x2U
#define AFIO_EXTICR3_EXTI11__PD11                       0x3U
#define AFIO_EXTICR3_EXTI11__PE11                       0x4U
#define AFIO_EXTICR3_EXTI11__PF11                       0x5U
#define AFIO_EXTICR3_EXTI11__PG11                       0x6U

// AFIO : EXTICR4
#define AFIO_EXTICR4_EXTI12__PA12                       0x0U
#define AFIO_EXTICR4_EXTI12__PB12                       0x1U
#define AFIO_EXTICR4_EXTI12__PC12                       0x2U
#define AFIO_EXTICR4_EXTI12__PD12                       0x3U
#define AFIO_EXTICR4_EXTI12__PE12                       0x4U
#define AFIO_EXTICR4_EXTI12__PF12                       0x5U
#define AFIO_EXTICR4_EXTI12__PG12                       0x6U

#define AFIO_EXTICR4_EXTI13__PA13                       0x0U
#define AFIO_EXTICR4_EXTI13__PB13                       0x1U
#define AFIO_EXTICR4_EXTI13__PC13                       0x2U
#define AFIO_EXTICR4_EXTI13__PD13                       0x3U
#define AFIO_EXTICR4_EXTI13__PE13                       0x4U
#define AFIO_EXTICR4_EXTI13__PF13                       0x5U
#define AFIO_EXTICR4_EXTI13__PG13                       0x6U

#define AFIO_EXTICR4_EXTI14__PA14                       0x0U
#define AFIO_EXTICR4_EXTI14__PB14                       0x1U
#define AFIO_EXTICR4_EXTI14__PC14                       0x2U
#define AFIO_EXTICR4_EXTI14__PD14                       0x3U
#define AFIO_EXTICR4_EXTI14__PE14                       0x4U
#define AFIO_EXTICR4_EXTI14__PF14                       0x5U
#define AFIO_EXTICR4_EXTI14__PG14                       0x6U

#define AFIO_EXTICR4_EXTI15__PA15                       0x0U
#define AFIO_EXTICR4_EXTI15__PB15                       0x1U
#define AFIO_EXTICR4_EXTI15__PC15                       0x2U
#define AFIO_EXTICR4_EXTI15__PD15                       0x3U
#define AFIO_EXTICR4_EXTI15__PE15                       0x4U
#define AFIO_EXTICR4_EXTI15__PF15                       0x5U
#define AFIO_EXTICR4_EXTI15__PG15                       0x6U

// AFIO : MAPR2
#define AFIO_MAPR2_TIM9_REMAP__NoReMap_CH1_PA2_CH2_PA3  0x0U
#define AFIO_MAPR2_TIM9_REMAP__ReMap_CH1_PE5_CH2_PE6    0x1U

#define AFIO_MAPR2_TIM10_REMAP__NoReMap_CH1_PB8         0x0U
#define AFIO_MAPR2_TIM10_REMAP__ReMap_CH1_PF6           0x1U

#define AFIO_MAPR2_TIM11_REMAP__NoReMap_CH1_PB9         0x0U
#define AFIO_MAPR2_TIM11_REMAP__ReMap_CH1_PF7           0x1U

#define AFIO_MAPR2_TIM13_REMAP__NoReMap_CH1_PA6         0x0U
#define AFIO_MAPR2_TIM13_REMAP__ReMap_CH1_PF8           0x1U

#define AFIO_MAPR2_TIM14_REMAP__NoReMap_CH1_PA7         0x0U
#define AFIO_MAPR2_TIM14_REMAP__ReMap_CH1_PF9           0x1U

#define AFIO_MAPR2_FSMC_NADV__NADV_ConnectedToOutput    0x0U
#define AFIO_MAPR2_FSMC_NADV__NADV_NotConnected         0x1U

/******************************************************************************
 ******     EXTI
******************************************************************************/

// EXTI : IMR
#define EXTI_IMR_MRx__IntrptEnbl                        0x1U
#define EXTI_IMR_MRx__IntrptDsbl                        0x0U

// EXTI : EMR
#define EXTI_EMR_MRx__Event_Enable                      0x1U
#define EXTI_EMR_MRx__Event_Disable                     0x0U

// EXTI : PTSR
#define EXTI_RTSR_TRx__RisingTrigger_Enalbe             0x1U
#define EXTI_RTSR_TRx__RisingTrigger_Disable            0x0U

// EXTI : FTSR
#define EXTI_FTSR_TRx__FallingTrigger_Enable            0x1U
#define EXTI_FTSR_TRx__FallingTrigger_Disable           0x0U

// EXTI : SWIER
#define EXTI_SWIER_SWIERx__Generate_Interrupt           0x1U
#define EXTI_SWIER_SWIERx__ReadyToGenerate_Interrupt    0x0U

// EXTI : PR
#define EXTI_PR_PRx__No_TriggerRequest                  0x0U
#define EXTI_PR_PRx__InterruptPending                   0x1U
#define EXTI_PR_PRx__ClearPending                       0x1U

/******************************************************************************
 ******     ADC
******************************************************************************/

// ADC : SR
#define ADC_SR_AWD__AWD_FlgClr                          0x0U
#define ADC_SR_AWD__WatchdogEvent_NotOccurred           0x0U
#define ADC_SR_AWD__WatchdogEvent_Occurred              0x1U

#define ADC_SR_EOC__EOC_FlgClr                          0x0U
#define ADC_SR_EOC__RegularConv_NotCmplt                0x0U
#define ADC_SR_EOC__RegularConv_Cmplt                   0x1U

#define ADC_SR_JEOC__JEOC_FlgClr                        0x0U
#define ADC_SR_JEOC__InjectedConv_NotCmplt              0x0U
#define ADC_SR_JEOC__InjectedConv_Cmplt                 0x1U

#define ADC_SR_JSTRT__JSTART_FlgClr                     0x0U
#define ADC_SR_JSTRT__InjectedChannel_NotStarted        0x0U
#define ADC_SR_JSTRT__InjectedChannel_Started           0x1U

#define ADC_SR_START__START_FlgClr                      0x0U
#define ADC_SR_START__RegularChannel_NotStarted         0x0U
#define ADC_SR_START__RegularChannel_Started            0x1U

// ADC : CR1
#define ADC_CR1_AWDCH__WatchdogOn_CH0                   0x0U
#define ADC_CR1_AWDCH__WatchdogOn_CH1                   0x1U
#define ADC_CR1_AWDCH__WatchdogOn_CH2                   0x2U
#define ADC_CR1_AWDCH__WatchdogOn_CH3                   0x3U
#define ADC_CR1_AWDCH__WatchdogOn_CH4                   0x4U
#define ADC_CR1_AWDCH__WatchdogOn_CH5                   0x5U
#define ADC_CR1_AWDCH__WatchdogOn_CH6                   0x6U
#define ADC_CR1_AWDCH__WatchdogOn_CH7                   0x7U
#define ADC_CR1_AWDCH__WatchdogOn_CH8                   0x8U
#define ADC_CR1_AWDCH__WatchdogOn_CH9                   0x9U
#define ADC_CR1_AWDCH__WatchdogOn_CH10                  0xAU
#define ADC_CR1_AWDCH__WatchdogOn_CH11                  0xBU
#define ADC_CR1_AWDCH__WatchdogOn_CH12                  0xCU
#define ADC_CR1_AWDCH__WatchdogOn_CH13                  0xDU
#define ADC_CR1_AWDCH__WatchdogOn_CH14                  0xEU
#define ADC_CR1_AWDCH__WatchdogOn_CH15                  0xFU
#define ADC_CR1_AWDCH__WatchdogOn_CH16                  0x10U
#define ADC_CR1_AWDCH__WatchdogOn_CH17                  0x11U

#define ADC_CR1_EOCIE__Regular_EndOfConv_IntrptEnbl     0x0U
#define ADC_CR1_EOCIE__Regular_EndOfConv_IntrptDsbl     0x1U

#define ADC_CR1_AWDIE__AnalogWatchDog_IntrptDsbl        0x0U
#define ADC_CR1_AWDIE__AnalogWatchDog_IntrptEnbl        0x1U

