pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define ADC_CR1_JEOCIE__Injected_EndOfConv_IntrptDsbl   0x0U
#define ADC_CR1_JEOCIE__Injected_EndOfConv_IntrptEnbl   0x1U

#define ADC_CR1_SCAN__ScanMode_Disable                  0x0U
#define ADC_CR1_SCAN__ScanMode_Enable                   0x1U

#define ADC_CR1_AWDSGL__AnalogWatchDog_AllChannels      0x0U
#define ADC_CR1_AWDSGL__AnalogWatchDog_SingleChannel    0x1U

#define ADC_CR1_JAUTO__AutomaticInjectedConv_Disable    0x0U
#define ADC_CR1_JAUTO__AutomaticInjectedConv_Enable     0x1U

#define ADC_CR1_DISCEN__Regular_DiscontMode_Disable     0x0U
#define ADC_CR1_DISCEN__Regular_DiscontMode_Enable      0x1U

#define ADC_CR1_JDISCEN__Injected_DiscontMode_Disable   0x0U
#define ADC_CR1_JDISCEN__Injected_DiscontMode_Enable    0x1U

#define ADC_CR1_DISCNUM__DiscontMode_ChannelCount_1     0x0U
#define ADC_CR1_DISCNUM__DiscontMode_ChannelCount_2     0x1U
#define ADC_CR1_DISCNUM__DiscontMode_ChannelCount_3     0x2U
#define ADC_CR1_DISCNUM__DiscontMode_ChannelCount_4     0x3U
#define ADC_CR1_DISCNUM__DiscontMode_ChannelCount_5     0x4U
#define ADC_CR1_DISCNUM__DiscontMode_ChannelCount_6     0x5U
#define ADC_CR1_DISCNUM__DiscontMode_ChannelCount_7     0x6U
#define ADC_CR1_DISCNUM__DiscontMode_ChannelCount_8     0x7U

#define ADC_CR1_DUALMOD__IndependentMode                0x0U
#define ADC_CR1_DUALMOD__RegularSimul_InjectedSimul     0x1U
#define ADC_CR1_DUALMOD__RegularSimul_AlternateTrigger  0x2U
#define ADC_CR1_DUALMOD__InjectedSimul_FastInterleaved  0x3U
#define ADC_CR1_DUALMOD__InjectedSimul_SlowInterleaved  0x4U
#define ADC_CR1_DUALMOD__InjectedSimulModeOnly          0x5U
#define ADC_CR1_DUALMOD__RegularSimulModeOnly           0x6U
#define ADC_CR1_DUALMOD__FastInterleavedModeOnly        0x7U
#define ADC_CR1_DUALMOD__SlowInterleavedModeOnly        0x8U
#define ADC_CR1_DUALMOD__AlternateTriggerModeOnly       0x9U

#define ADC_CR1_JAWDEN__Injected_AnalogWatchDog_Disable 0x0U
#define ADC_CR1_JAWDEN__Injected_AnalogWatchDog_Enable  0x1U

#define ADC_CR1_AWDEN__Regular_AnalogWatchDog_Disable   0x0U
#define ADC_CR1_AWDEN__Regular_AnalogWatchDog_Enable    0x1U

// ADC : CR2
#define ADC_CR2_ADON__ADC_Disable_PowerDownMode         0x0U
#define ADC_CR2_ADON__ADC_Enable_StartConv              0x1U

#define ADC_CR2_CONT__SingleConvMode                    0x0U
#define ADC_CR2_CONT__ContinuousConvMode                0x1U

#define ADC_CR2_CAL__CalibrationCmpltd                  0x0U
#define ADC_CR2_CAL__EnableCalibration                  0x1U

#define ADC_CR2_RSTCAL__CalibrationRegisterInitialized  0x0U
#define ADC_CR2_RSTCAL__InitializeCalibrationRegister   0x1U

#define ADC_CR2_DMA__DMA_Disable                        0x0U
#define ADC_CR2_DMA__DMA_Enable                         0x1U

#define ADC_CR2_ALIGN__Alignment_Right                  0x0U
#define ADC_CR2_ALIGN__Alignment_Left                   0x1U

#define ADC1_CR2_JEXTSEL__InjectedEvent_TIM1_TRGO       0x0U
#define ADC1_CR2_JEXTSEL__InjectedEvent_TIM1_CC4        0x1U
#define ADC1_CR2_JEXTSEL__InjectedEvent_TIM2_TRGO       0x2U
#define ADC1_CR2_JEXTSEL__InjectedEvent_TIM2_CC1        0x3U
#define ADC1_CR2_JEXTSEL__InjectedEvent_TIM3_CC4        0x4U
#define ADC1_CR2_JEXTSEL__InjectedEvent_TIM4_TRGO       0x5U
#define ADC1_CR2_JEXTSEL__InjectedEvent_EXTI15_TIM8_CC4 0x6U
#define ADC1_CR2_JEXTSEL__InjectedEvent_JSWSTART        0x7U

#define ADC2_CR2_JEXTSEL__InjectedEvent_TIM1_TRGO       0x0U
#define ADC2_CR2_JEXTSEL__InjectedEvent_TIM1_CC4        0x1U
#define ADC2_CR2_JEXTSEL__InjectedEvent_TIM2_TRGO       0x2U
#define ADC2_CR2_JEXTSEL__InjectedEvent_TIM2_CC1        0x3U
#define ADC2_CR2_JEXTSEL__InjectedEvent_TIM3_CC4        0x4U
#define ADC2_CR2_JEXTSEL__InjectedEvent_TIM4_TRGO       0x5U
#define ADC2_CR2_JEXTSEL__InjectedEvent_EXTI15_TIM8_CC4 0x6U
#define ADC2_CR2_JEXTSEL__InjectedEvent_JSWSTART        0x7U

#define ADC3_CR2_JEXTSEL__InjectedEvent_TIM1_TRGO       0x0U
#define ADC3_CR2_JEXTSEL__InjectedEvent_TIM1_CC4        0x1U
#define ADC3_CR2_JEXTSEL__InjectedEvent_TIM4_CC3        0x2U
#define ADC3_CR2_JEXTSEL__InjectedEvent_TIM8_CC2        0x3U
#define ADC3_CR2_JEXTSEL__InjectedEvent_TIM8_CC4        0x4U
#define ADC3_CR2_JEXTSEL__InjectedEvent_TIM5_TRGO       0x5U
#define ADC3_CR2_JEXTSEL__InjectedEvent_TIM5_CC4        0x6U
#define ADC3_CR2_JEXTSEL__InjectedEvent_JSWSTART        0x7U

#define ADC_CR2_JEXTTRIG__InjectedConvOnEvent_Disable   0x0U
#define ADC_CR2_JEXTTRIG__InjectedConvOnEvent_Enable    0x1U

#define ADC1_CR2_EXTSEL__RegularEvent_TIM1_CC1          0x0U
#define ADC1_CR2_EXTSEL__RegularEvent_TIM1_CC2          0x1U
#define ADC1_CR2_EXTSEL__RegularEvent_TIM1_CC3          0x2U
#define ADC1_CR2_EXTSEL__RegularEvent_TIM2_CC2          0x3U
#define ADC1_CR2_EXTSEL__RegularEvent_TIM3_TRGO         0x4U
#define ADC1_CR2_EXTSEL__RegularEvent_TIM4_CC4          0x5U
#define ADC1_CR2_EXTSEL__RegularEvent_EXTI11_TIM8_TRGO  0x6U
#define ADC1_CR2_EXTSEL__RegularEvent_SWSTART           0x7U

#define ADC2_CR2_EXTSEL__RegularEvent_TIM1_CC1          0x0U
#define ADC2_CR2_EXTSEL__RegularEvent_TIM1_CC2          0x1U
#define ADC2_CR2_EXTSEL__RegularEvent_TIM1_CC3          0x2U
#define ADC2_CR2_EXTSEL__RegularEvent_TIM2_CC2          0x3U
#define ADC2_CR2_EXTSEL__RegularEvent_TIM3_TRGO         0x4U
#define ADC2_CR2_EXTSEL__RegularEvent_TIM4_CC4          0x5U
#define ADC2_CR2_EXTSEL__RegularEvent_EXTI11_TIM8_TRGO  0x6U
#define ADC2_CR2_EXTSEL__RegularEvent_SWSTART           0x7U

#define ADC3_CR2_EXTSEL__RegularEvent_TIM3_CC1          0x0U
#define ADC3_CR2_EXTSEL__RegularEvent_TIM2_CC3          0x1U
#define ADC3_CR2_EXTSEL__RegularEvent_TIM1_CC3          0x2U
#define ADC3_CR2_EXTSEL__RegularEvent_TIM8_CC1          0x3U
#define ADC3_CR2_EXTSEL__RegularEvent_TIM8_TRGO         0x4U
#define ADC3_CR2_EXTSEL__RegularEvent_TIM5_CC1          0x5U
#define ADC3_CR2_EXTSEL__RegularEvent_TIM5_CC3          0x6U
#define ADC3_CR2_EXTSEL__RegularEvent_SWSTART           0x7U

#define ADC_CR2_EXTTRIG__RegularConvOnEvent_Disable     0x0U
#define ADC_CR2_EXTTRIG__RegularConvOnEvent_Enable      0x1U

