pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define ADC_CR2_JSWSTART__Injected_ResetState           0x0U
#define ADC_CR2_JSWSTART__Injected_StartConversion      0x1U

#define ADC_CR2_SWSTART__Regular_ResetState             0x0U
#define ADC_CR2_SWSTART__Regular_StartConversion        0x1U

#define ADC_CR2_TSVREFE__TMPsensor_Vref_Disable         0x0U
#define ADC_CR2_TSVREFE__TMPsensor_Vref_Enable          0x1U

// ADC : SMPR1
#define ADC_SMPR1_SMP10__CH10_SampleTime_1p5_cycle      0x0U
#define ADC_SMPR1_SMP10__CH10_SampleTime_7p5_cycle      0x1U
#define ADC_SMPR1_SMP10__CH10_SampleTime_13p5_cycle     0x2U
#define ADC_SMPR1_SMP10__CH10_SampleTime_28p5_cycle     0x3U
#define ADC_SMPR1_SMP10__CH10_SampleTime_41p5_cycle     0x4U
#define ADC_SMPR1_SMP10__CH10_SampleTime_55p5_cycle     0x5U
#define ADC_SMPR1_SMP10__CH10_SampleTime_71p5_cycle     0x6U
#define ADC_SMPR1_SMP10__CH10_SampleTime_239p5_cycle    0x7U

#define ADC_SMPR1_SMP11__CH11_SampleTime_1p5_cycle      0x0U
#define ADC_SMPR1_SMP11__CH11_SampleTime_7p5_cycle      0x1U
#define ADC_SMPR1_SMP11__CH11_SampleTime_13p5_cycle     0x2U
#define ADC_SMPR1_SMP11__CH11_SampleTime_28p5_cycle     0x3U
#define ADC_SMPR1_SMP11__CH11_SampleTime_41p5_cycle     0x4U
#define ADC_SMPR1_SMP11__CH11_SampleTime_55p5_cycle     0x5U
#define ADC_SMPR1_SMP11__CH11_SampleTime_71p5_cycle     0x6U
#define ADC_SMPR1_SMP11__CH11_SampleTime_239p5_cycle    0x7U

#define ADC_SMPR1_SMP12__CH12_SampleTime_1p5_cycle      0x0U
#define ADC_SMPR1_SMP12__CH12_SampleTime_7p5_cycle      0x1U
#define ADC_SMPR1_SMP12__CH12_SampleTime_13p5_cycle     0x2U
#define ADC_SMPR1_SMP12__CH12_SampleTime_28p5_cycle     0x3U
#define ADC_SMPR1_SMP12__CH12_SampleTime_41p5_cycle     0x4U
#define ADC_SMPR1_SMP12__CH12_SampleTime_55p5_cycle     0x5U
#define ADC_SMPR1_SMP12__CH12_SampleTime_71p5_cycle     0x6U
#define ADC_SMPR1_SMP12__CH12_SampleTime_239p5_cycle    0x7U

#define ADC_SMPR1_SMP13__CH13_SampleTime_1p5_cycle      0x0U
#define ADC_SMPR1_SMP13__CH13_SampleTime_7p5_cycle      0x1U
#define ADC_SMPR1_SMP13__CH13_SampleTime_13p5_cycle     0x2U
#define ADC_SMPR1_SMP13__CH13_SampleTime_28p5_cycle     0x3U
#define ADC_SMPR1_SMP13__CH13_SampleTime_41p5_cycle     0x4U
#define ADC_SMPR1_SMP13__CH13_SampleTime_55p5_cycle     0x5U
#define ADC_SMPR1_SMP13__CH13_SampleTime_71p5_cycle     0x6U
#define ADC_SMPR1_SMP13__CH13_SampleTime_239p5_cycle    0x7U

#define ADC_SMPR1_SMP14__CH14_SampleTime_1p5_cycle      0x0U
#define ADC_SMPR1_SMP14__CH14_SampleTime_7p5_cycle      0x1U
#define ADC_SMPR1_SMP14__CH14_SampleTime_13p5_cycle     0x2U
#define ADC_SMPR1_SMP14__CH14_SampleTime_28p5_cycle     0x3U
#define ADC_SMPR1_SMP14__CH14_SampleTime_41p5_cycle     0x4U
#define ADC_SMPR1_SMP14__CH14_SampleTime_55p5_cycle     0x5U
#define ADC_SMPR1_SMP14__CH14_SampleTime_71p5_cycle     0x6U
#define ADC_SMPR1_SMP14__CH14_SampleTime_239p5_cycle    0x7U

#define ADC_SMPR1_SMP15__CH15_SampleTime_1p5_cycle      0x0U
#define ADC_SMPR1_SMP15__CH15_SampleTime_7p5_cycle      0x1U
#define ADC_SMPR1_SMP15__CH15_SampleTime_13p5_cycle     0x2U
#define ADC_SMPR1_SMP15__CH15_SampleTime_28p5_cycle     0x3U
#define ADC_SMPR1_SMP15__CH15_SampleTime_41p5_cycle     0x4U
#define ADC_SMPR1_SMP15__CH15_SampleTime_55p5_cycle     0x5U
#define ADC_SMPR1_SMP15__CH15_SampleTime_71p5_cycle     0x6U
#define ADC_SMPR1_SMP15__CH15_SampleTime_239p5_cycle    0x7U

#define ADC_SMPR1_SMP16__CH16_SampleTime_1p5_cycle      0x0U
#define ADC_SMPR1_SMP16__CH16_SampleTime_7p5_cycle      0x1U
#define ADC_SMPR1_SMP16__CH16_SampleTime_13p5_cycle     0x2U
#define ADC_SMPR1_SMP16__CH16_SampleTime_28p5_cycle     0x3U
#define ADC_SMPR1_SMP16__CH16_SampleTime_41p5_cycle     0x4U
#define ADC_SMPR1_SMP16__CH16_SampleTime_55p5_cycle     0x5U
#define ADC_SMPR1_SMP16__CH16_SampleTime_71p5_cycle     0x6U
#define ADC_SMPR1_SMP16__CH16_SampleTime_239p5_cycle    0x7U

#define ADC_SMPR1_SMP17__CH17_SampleTime_1p5_cycle      0x0U
#define ADC_SMPR1_SMP17__CH17_SampleTime_7p5_cycle      0x1U
#define ADC_SMPR1_SMP17__CH17_SampleTime_13p5_cycle     0x2U
#define ADC_SMPR1_SMP17__CH17_SampleTime_28p5_cycle     0x3U
#define ADC_SMPR1_SMP17__CH17_SampleTime_41p5_cycle     0x4U
#define ADC_SMPR1_SMP17__CH17_SampleTime_55p5_cycle     0x5U
#define ADC_SMPR1_SMP17__CH17_SampleTime_71p5_cycle     0x6U
#define ADC_SMPR1_SMP17__CH17_SampleTime_239p5_cycle    0x7U

// ADC : SMPR2
#define ADC_SMPR2_SMP0__CH0_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP0__CH0_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP0__CH0_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP0__CH0_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP0__CH0_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP0__CH0_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP0__CH0_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP0__CH0_SampleTime_239p5_cycle      0x7U

#define ADC_SMPR2_SMP1__CH1_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP1__CH1_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP1__CH1_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP1__CH1_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP1__CH1_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP1__CH1_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP1__CH1_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP1__CH1_SampleTime_239p5_cycle      0x7U

#define ADC_SMPR2_SMP2__CH2_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP2__CH2_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP2__CH2_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP2__CH2_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP2__CH2_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP2__CH2_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP2__CH2_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP2__CH2_SampleTime_239p5_cycle      0x7U

#define ADC_SMPR2_SMP3__CH3_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP3__CH3_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP3__CH3_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP3__CH3_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP3__CH3_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP3__CH3_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP3__CH3_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP3__CH3_SampleTime_239p5_cycle      0x7U

#define ADC_SMPR2_SMP4__CH4_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP4__CH4_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP4__CH4_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP4__CH4_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP4__CH4_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP4__CH4_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP4__CH4_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP4__CH4_SampleTime_239p5_cycle      0x7U

#define ADC_SMPR2_SMP5__CH5_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP5__CH5_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP5__CH5_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP5__CH5_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP5__CH5_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP5__CH5_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP5__CH5_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP5__CH5_SampleTime_239p5_cycle      0x7U

