pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define ADC_SMPR2_SMP6__CH6_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP6__CH6_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP6__CH6_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP6__CH6_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP6__CH6_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP6__CH6_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP6__CH6_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP6__CH6_SampleTime_239p5_cycle      0x7U

#define ADC_SMPR2_SMP7__CH7_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP7__CH7_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP7__CH7_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP7__CH7_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP7__CH7_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP7__CH7_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP7__CH7_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP7__CH7_SampleTime_239p5_cycle      0x7U

#define ADC_SMPR2_SMP8__CH8_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP8__CH8_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP8__CH8_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP8__CH8_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP8__CH8_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP8__CH8_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP8__CH8_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP8__CH8_SampleTime_239p5_cycle      0x7U

#define ADC_SMPR2_SMP9__CH9_SampleTime_1p5_cycle        0x0U
#define ADC_SMPR2_SMP9__CH9_SampleTime_7p5_cycle        0x1U
#define ADC_SMPR2_SMP9__CH9_SampleTime_13p5_cycle       0x2U
#define ADC_SMPR2_SMP9__CH9_SampleTime_28p5_cycle       0x3U
#define ADC_SMPR2_SMP9__CH9_SampleTime_41p5_cycle       0x4U
#define ADC_SMPR2_SMP9__CH9_SampleTime_55p5_cycle       0x5U
#define ADC_SMPR2_SMP9__CH9_SampleTime_71p5_cycle       0x6U
#define ADC_SMPR2_SMP9__CH9_SampleTime_239p5_cycle      0x7U

// ADC : SQR1
#define ADC_SQR1_L__Regular_Sequence_Length_1_conv      0x0U
#define ADC_SQR1_L__Regular_Sequence_Length_2_conv      0x1U
#define ADC_SQR1_L__Regular_Sequence_Length_3_conv      0x2U
#define ADC_SQR1_L__Regular_Sequence_Length_4_conv      0x3U
#define ADC_SQR1_L__Regular_Sequence_Length_5_conv      0x4U
#define ADC_SQR1_L__Regular_Sequence_Length_6_conv      0x5U
#define ADC_SQR1_L__Regular_Sequence_Length_7_conv      0x6U
#define ADC_SQR1_L__Regular_Sequence_Length_8_conv      0x7U
#define ADC_SQR1_L__Regular_Sequence_Length_9_conv      0x8U
#define ADC_SQR1_L__Regular_Sequence_Length_10_conv     0x9U
#define ADC_SQR1_L__Regular_Sequence_Length_11_conv     0xAU
#define ADC_SQR1_L__Regular_Sequence_Length_12_conv     0xBU
#define ADC_SQR1_L__Regular_Sequence_Length_13_conv     0xCU
#define ADC_SQR1_L__Regular_Sequence_Length_14_conv     0xDU
#define ADC_SQR1_L__Regular_Sequence_Length_15_conv     0xEU
#define ADC_SQR1_L__Regular_Sequence_Length_16_conv     0xFU

#define ADC_SQR1_SQ16__16th_CH0                         0x0U
#define ADC_SQR1_SQ16__16th_CH1                         0x1U
#define ADC_SQR1_SQ16__16th_CH2                         0x2U
#define ADC_SQR1_SQ16__16th_CH3                         0x3U
#define ADC_SQR1_SQ16__16th_CH4                         0x4U
#define ADC_SQR1_SQ16__16th_CH5                         0x5U
#define ADC_SQR1_SQ16__16th_CH6                         0x6U
#define ADC_SQR1_SQ16__16th_CH7                         0x7U
#define ADC_SQR1_SQ16__16th_CH8                         0x8U
#define ADC_SQR1_SQ16__16th_CH9                         0x9U
#define ADC_SQR1_SQ16__16th_CH10                        0xAU
#define ADC_SQR1_SQ16__16th_CH11                        0xBU
#define ADC_SQR1_SQ16__16th_CH12                        0xCU
#define ADC_SQR1_SQ16__16th_CH13                        0xDU
#define ADC_SQR1_SQ16__16th_CH14                        0xEU
#define ADC_SQR1_SQ16__16th_CH15                        0xFU
#define ADC_SQR1_SQ16__16th_CH16                        0x10U
#define ADC_SQR1_SQ16__16th_CH17                        0x11U

#define ADC_SQR1_SQ15__15th_CH0                         0x0U
#define ADC_SQR1_SQ15__15th_CH1                         0x1U
#define ADC_SQR1_SQ15__15th_CH2                         0x2U
#define ADC_SQR1_SQ15__15th_CH3                         0x3U
#define ADC_SQR1_SQ15__15th_CH4                         0x4U
#define ADC_SQR1_SQ15__15th_CH5                         0x5U
#define ADC_SQR1_SQ15__15th_CH6                         0x6U
#define ADC_SQR1_SQ15__15th_CH7                         0x7U
#define ADC_SQR1_SQ15__15th_CH8                         0x8U
#define ADC_SQR1_SQ15__15th_CH9                         0x9U
#define ADC_SQR1_SQ15__15th_CH10                        0xAU
#define ADC_SQR1_SQ15__15th_CH11                        0xBU
#define ADC_SQR1_SQ15__15th_CH12                        0xCU
#define ADC_SQR1_SQ15__15th_CH13                        0xDU
#define ADC_SQR1_SQ15__15th_CH14                        0xEU
#define ADC_SQR1_SQ15__15th_CH15                        0xFU
#define ADC_SQR1_SQ15__15th_CH16                        0x10U
#define ADC_SQR1_SQ15__15th_CH17                        0x11U

#define ADC_SQR1_SQ14__14th_CH0                         0x0U
#define ADC_SQR1_SQ14__14th_CH1                         0x1U
#define ADC_SQR1_SQ14__14th_CH2                         0x2U
#define ADC_SQR1_SQ14__14th_CH3                         0x3U
#define ADC_SQR1_SQ14__14th_CH4                         0x4U
#define ADC_SQR1_SQ14__14th_CH5                         0x5U
#define ADC_SQR1_SQ14__14th_CH6                         0x6U
#define ADC_SQR1_SQ14__14th_CH7                         0x7U
#define ADC_SQR1_SQ14__14th_CH8                         0x8U
#define ADC_SQR1_SQ14__14th_CH9                         0x9U
#define ADC_SQR1_SQ14__14th_CH10                        0xAU
#define ADC_SQR1_SQ14__14th_CH11                        0xBU
#define ADC_SQR1_SQ14__14th_CH12                        0xCU
#define ADC_SQR1_SQ14__14th_CH13                        0xDU
#define ADC_SQR1_SQ14__14th_CH14                        0xEU
#define ADC_SQR1_SQ14__14th_CH15                        0xFU
#define ADC_SQR1_SQ14__14th_CH16                        0x10U
#define ADC_SQR1_SQ14__14th_CH17                        0x11U

#define ADC_SQR1_SQ13__13th_CH0                         0x0U
#define ADC_SQR1_SQ13__13th_CH1                         0x1U
#define ADC_SQR1_SQ13__13th_CH2                         0x2U
#define ADC_SQR1_SQ13__13th_CH3                         0x3U
#define ADC_SQR1_SQ13__13th_CH4                         0x4U
#define ADC_SQR1_SQ13__13th_CH5                         0x5U
#define ADC_SQR1_SQ13__13th_CH6                         0x6U
#define ADC_SQR1_SQ13__13th_CH7                         0x7U
#define ADC_SQR1_SQ13__13th_CH8                         0x8U
#define ADC_SQR1_SQ13__13th_CH9                         0x9U
#define ADC_SQR1_SQ13__13th_CH10                        0xAU
#define ADC_SQR1_SQ13__13th_CH11                        0xBU
#define ADC_SQR1_SQ13__13th_CH12                        0xCU
#define ADC_SQR1_SQ13__13th_CH13                        0xDU
#define ADC_SQR1_SQ13__13th_CH14                        0xEU
#define ADC_SQR1_SQ13__13th_CH15                        0xFU
#define ADC_SQR1_SQ13__13th_CH16                        0x10U
#define ADC_SQR1_SQ13__13th_CH17                        0x11U

// ADC : SQR2
#define ADC_SQR2_SQ12__12th_CH0                         0x0U
#define ADC_SQR2_SQ12__12th_CH1                         0x1U
#define ADC_SQR2_SQ12__12th_CH2                         0x2U
#define ADC_SQR2_SQ12__12th_CH3                         0x3U
#define ADC_SQR2_SQ12__12th_CH4                         0x4U
#define ADC_SQR2_SQ12__12th_CH5                         0x5U
#define ADC_SQR2_SQ12__12th_CH6                         0x6U
#define ADC_SQR2_SQ12__12th_CH7                         0x7U
#define ADC_SQR2_SQ12__12th_CH8                         0x8U
#define ADC_SQR2_SQ12__12th_CH9                         0x9U
#define ADC_SQR2_SQ12__12th_CH10                        0xAU
#define ADC_SQR2_SQ12__12th_CH11                        0xBU
#define ADC_SQR2_SQ12__12th_CH12                        0xCU
#define ADC_SQR2_SQ12__12th_CH13                        0xDU
#define ADC_SQR2_SQ12__12th_CH14                        0xEU
#define ADC_SQR2_SQ12__12th_CH15                        0xFU
#define ADC_SQR2_SQ12__12th_CH16                        0x10U
#define ADC_SQR2_SQ12__12th_CH17                        0x11U

#define ADC_SQR2_SQ11__11th_CH0                         0x0U
#define ADC_SQR2_SQ11__11th_CH1                         0x1U
#define ADC_SQR2_SQ11__11th_CH2                         0x2U
#define ADC_SQR2_SQ11__11th_CH3                         0x3U
#define ADC_SQR2_SQ11__11th_CH4                         0x4U
#define ADC_SQR2_SQ11__11th_CH5                         0x5U
#define ADC_SQR2_SQ11__11th_CH6                         0x6U
#define ADC_SQR2_SQ11__11th_CH7                         0x7U
#define ADC_SQR2_SQ11__11th_CH8                         0x8U
#define ADC_SQR2_SQ11__11th_CH9                         0x9U
#define ADC_SQR2_SQ11__11th_CH10                        0xAU
#define ADC_SQR2_SQ11__11th_CH11                        0xBU
#define ADC_SQR2_SQ11__11th_CH12                        0xCU
#define ADC_SQR2_SQ11__11th_CH13                        0xDU
#define ADC_SQR2_SQ11__11th_CH14                        0xEU
#define ADC_SQR2_SQ11__11th_CH15                        0xFU
#define ADC_SQR2_SQ11__11th_CH16                        0x10U
#define ADC_SQR2_SQ11__11th_CH17                        0x11U

#define ADC_SQR2_SQ10__10th_CH0                         0x0U
#define ADC_SQR2_SQ10__10th_CH1                         0x1U
#define ADC_SQR2_SQ10__10th_CH2                         0x2U
#define ADC_SQR2_SQ10__10th_CH3                         0x3U
#define ADC_SQR2_SQ10__10th_CH4                         0x4U
#define ADC_SQR2_SQ10__10th_CH5                         0x5U
#define ADC_SQR2_SQ10__10th_CH6                         0x6U
#define ADC_SQR2_SQ10__10th_CH7                         0x7U
#define ADC_SQR2_SQ10__10th_CH8                         0x8U
#define ADC_SQR2_SQ10__10th_CH9                         0x9U
#define ADC_SQR2_SQ10__10th_CH10                        0xAU
#define ADC_SQR2_SQ10__10th_CH11                        0xBU
#define ADC_SQR2_SQ10__10th_CH12                        0xCU
#define ADC_SQR2_SQ10__10th_CH13                        0xDU
#define ADC_SQR2_SQ10__10th_CH14                        0xEU
#define ADC_SQR2_SQ10__10th_CH15                        0xFU
#define ADC_SQR2_SQ10__10th_CH16                        0x10U
#define ADC_SQR2_SQ10__10th_CH17                        0x11U

