pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define ADC_SQR2_SQ9__9th_CH0                           0x0U
#define ADC_SQR2_SQ9__9th_CH1                           0x1U
#define ADC_SQR2_SQ9__9th_CH2                           0x2U
#define ADC_SQR2_SQ9__9th_CH3                           0x3U
#define ADC_SQR2_SQ9__9th_CH4                           0x4U
#define ADC_SQR2_SQ9__9th_CH5                           0x5U
#define ADC_SQR2_SQ9__9th_CH6                           0x6U
#define ADC_SQR2_SQ9__9th_CH7                           0x7U
#define ADC_SQR2_SQ9__9th_CH8                           0x8U
#define ADC_SQR2_SQ9__9th_CH9                           0x9U
#define ADC_SQR2_SQ9__9th_CH10                          0xAU
#define ADC_SQR2_SQ9__9th_CH11                          0xBU
#define ADC_SQR2_SQ9__9th_CH12                          0xCU
#define ADC_SQR2_SQ9__9th_CH13                          0xDU
#define ADC_SQR2_SQ9__9th_CH14                          0xEU
#define ADC_SQR2_SQ9__9th_CH15                          0xFU
#define ADC_SQR2_SQ9__9th_CH16                          0x10U
#define ADC_SQR2_SQ9__9th_CH17                          0x11U

#define ADC_SQR2_SQ8__8th_CH0                           0x0U
#define ADC_SQR2_SQ8__8th_CH1                           0x1U
#define ADC_SQR2_SQ8__8th_CH2                           0x2U
#define ADC_SQR2_SQ8__8th_CH3                           0x3U
#define ADC_SQR2_SQ8__8th_CH4                           0x4U
#define ADC_SQR2_SQ8__8th_CH5                           0x5U
#define ADC_SQR2_SQ8__8th_CH6                           0x6U
#define ADC_SQR2_SQ8__8th_CH7                           0x7U
#define ADC_SQR2_SQ8__8th_CH8                           0x8U
#define ADC_SQR2_SQ8__8th_CH9                           0x9U
#define ADC_SQR2_SQ8__8th_CH10                          0xAU
#define ADC_SQR2_SQ8__8th_CH11                          0xBU
#define ADC_SQR2_SQ8__8th_CH12                          0xCU
#define ADC_SQR2_SQ8__8th_CH13                          0xDU
#define ADC_SQR2_SQ8__8th_CH14                          0xEU
#define ADC_SQR2_SQ8__8th_CH15                          0xFU
#define ADC_SQR2_SQ8__8th_CH16                          0x10U
#define ADC_SQR2_SQ8__8th_CH17                          0x11U

#define ADC_SQR2_SQ7__7th_CH0                           0x0U
#define ADC_SQR2_SQ7__7th_CH1                           0x1U
#define ADC_SQR2_SQ7__7th_CH2                           0x2U
#define ADC_SQR2_SQ7__7th_CH3                           0x3U
#define ADC_SQR2_SQ7__7th_CH4                           0x4U
#define ADC_SQR2_SQ7__7th_CH5                           0x5U
#define ADC_SQR2_SQ7__7th_CH6                           0x6U
#define ADC_SQR2_SQ7__7th_CH7                           0x7U
#define ADC_SQR2_SQ7__7th_CH8                           0x8U
#define ADC_SQR2_SQ7__7th_CH9                           0x9U
#define ADC_SQR2_SQ7__7th_CH10                          0xAU
#define ADC_SQR2_SQ7__7th_CH11                          0xBU
#define ADC_SQR2_SQ7__7th_CH12                          0xCU
#define ADC_SQR2_SQ7__7th_CH13                          0xDU
#define ADC_SQR2_SQ7__7th_CH14                          0xEU
#define ADC_SQR2_SQ7__7th_CH15                          0xFU
#define ADC_SQR2_SQ7__7th_CH16                          0x10U
#define ADC_SQR2_SQ7__7th_CH17                          0x11U

// ADC : SQR3
#define ADC_SQR3_SQ6__6th_CH0                           0x0U
#define ADC_SQR3_SQ6__6th_CH1                           0x1U
#define ADC_SQR3_SQ6__6th_CH2                           0x2U
#define ADC_SQR3_SQ6__6th_CH3                           0x3U
#define ADC_SQR3_SQ6__6th_CH4                           0x4U
#define ADC_SQR3_SQ6__6th_CH5                           0x5U
#define ADC_SQR3_SQ6__6th_CH6                           0x6U
#define ADC_SQR3_SQ6__6th_CH7                           0x7U
#define ADC_SQR3_SQ6__6th_CH8                           0x8U
#define ADC_SQR3_SQ6__6th_CH9                           0x9U
#define ADC_SQR3_SQ6__6th_CH10                          0xAU
#define ADC_SQR3_SQ6__6th_CH11                          0xBU
#define ADC_SQR3_SQ6__6th_CH12                          0xCU
#define ADC_SQR3_SQ6__6th_CH13                          0xDU
#define ADC_SQR3_SQ6__6th_CH14                          0xEU
#define ADC_SQR3_SQ6__6th_CH15                          0xFU
#define ADC_SQR3_SQ6__6th_CH16                          0x10U
#define ADC_SQR3_SQ6__6th_CH17                          0x11U

#define ADC_SQR3_SQ5__5th_CH0                           0x0U
#define ADC_SQR3_SQ5__5th_CH1                           0x1U
#define ADC_SQR3_SQ5__5th_CH2                           0x2U
#define ADC_SQR3_SQ5__5th_CH3                           0x3U
#define ADC_SQR3_SQ5__5th_CH4                           0x4U
#define ADC_SQR3_SQ5__5th_CH5                           0x5U
#define ADC_SQR3_SQ5__5th_CH6                           0x6U
#define ADC_SQR3_SQ5__5th_CH7                           0x7U
#define ADC_SQR3_SQ5__5th_CH8                           0x8U
#define ADC_SQR3_SQ5__5th_CH9                           0x9U
#define ADC_SQR3_SQ5__5th_CH10                          0xAU
#define ADC_SQR3_SQ5__5th_CH11                          0xBU
#define ADC_SQR3_SQ5__5th_CH12                          0xCU
#define ADC_SQR3_SQ5__5th_CH13                          0xDU
#define ADC_SQR3_SQ5__5th_CH14                          0xEU
#define ADC_SQR3_SQ5__5th_CH15                          0xFU
#define ADC_SQR3_SQ5__5th_CH16                          0x10U
#define ADC_SQR3_SQ5__5th_CH17                          0x11U

#define ADC_SQR3_SQ4__4th_CH0                           0x0U
#define ADC_SQR3_SQ4__4th_CH1                           0x1U
#define ADC_SQR3_SQ4__4th_CH2                           0x2U
#define ADC_SQR3_SQ4__4th_CH3                           0x3U
#define ADC_SQR3_SQ4__4th_CH4                           0x4U
#define ADC_SQR3_SQ4__4th_CH5                           0x5U
#define ADC_SQR3_SQ4__4th_CH6                           0x6U
#define ADC_SQR3_SQ4__4th_CH7                           0x7U
#define ADC_SQR3_SQ4__4th_CH8                           0x8U
#define ADC_SQR3_SQ4__4th_CH9                           0x9U
#define ADC_SQR3_SQ4__4th_CH10                          0xAU
#define ADC_SQR3_SQ4__4th_CH11                          0xBU
#define ADC_SQR3_SQ4__4th_CH12                          0xCU
#define ADC_SQR3_SQ4__4th_CH13                          0xDU
#define ADC_SQR3_SQ4__4th_CH14                          0xEU
#define ADC_SQR3_SQ4__4th_CH15                          0xFU
#define ADC_SQR3_SQ4__4th_CH16                          0x10U
#define ADC_SQR3_SQ4__4th_CH17                          0x11U

#define ADC_SQR3_SQ3__3rd_CH0                           0x0U
#define ADC_SQR3_SQ3__3rd_CH1                           0x1U
#define ADC_SQR3_SQ3__3rd_CH2                           0x2U
#define ADC_SQR3_SQ3__3rd_CH3                           0x3U
#define ADC_SQR3_SQ3__3rd_CH4                           0x4U
#define ADC_SQR3_SQ3__3rd_CH5                           0x5U
#define ADC_SQR3_SQ3__3rd_CH6                           0x6U
#define ADC_SQR3_SQ3__3rd_CH7                           0x7U
#define ADC_SQR3_SQ3__3rd_CH8                           0x8U
#define ADC_SQR3_SQ3__3rd_CH9                           0x9U
#define ADC_SQR3_SQ3__3rd_CH10                          0xAU
#define ADC_SQR3_SQ3__3rd_CH11                          0xBU
#define ADC_SQR3_SQ3__3rd_CH12                          0xCU
#define ADC_SQR3_SQ3__3rd_CH13                          0xDU
#define ADC_SQR3_SQ3__3rd_CH14                          0xEU
#define ADC_SQR3_SQ3__3rd_CH15                          0xFU
#define ADC_SQR3_SQ3__3rd_CH16                          0x10U
#define ADC_SQR3_SQ3__3rd_CH17                          0x11U

#define ADC_SQR3_SQ2__2nd_CH0                           0x0U
#define ADC_SQR3_SQ2__2nd_CH1                           0x1U
#define ADC_SQR3_SQ2__2nd_CH2                           0x2U
#define ADC_SQR3_SQ2__2nd_CH3                           0x3U
#define ADC_SQR3_SQ2__2nd_CH4                           0x4U
#define ADC_SQR3_SQ2__2nd_CH5                           0x5U
#define ADC_SQR3_SQ2__2nd_CH6                           0x6U
#define ADC_SQR3_SQ2__2nd_CH7                           0x7U
#define ADC_SQR3_SQ2__2nd_CH8                           0x8U
#define ADC_SQR3_SQ2__2nd_CH9                           0x9U
#define ADC_SQR3_SQ2__2nd_CH10                          0xAU
#define ADC_SQR3_SQ2__2nd_CH11                          0xBU
#define ADC_SQR3_SQ2__2nd_CH12                          0xCU
#define ADC_SQR3_SQ2__2nd_CH13                          0xDU
#define ADC_SQR3_SQ2__2nd_CH14                          0xEU
#define ADC_SQR3_SQ2__2nd_CH15                          0xFU
#define ADC_SQR3_SQ2__2nd_CH16                          0x10U
#define ADC_SQR3_SQ2__2nd_CH17                          0x11U

