pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define ADC_SQR3_SQ1__1st_CH0                           0x0U
#define ADC_SQR3_SQ1__1st_CH1                           0x1U
#define ADC_SQR3_SQ1__1st_CH2                           0x2U
#define ADC_SQR3_SQ1__1st_CH3                           0x3U
#define ADC_SQR3_SQ1__1st_CH4                           0x4U
#define ADC_SQR3_SQ1__1st_CH5                           0x5U
#define ADC_SQR3_SQ1__1st_CH6                           0x6U
#define ADC_SQR3_SQ1__1st_CH7                           0x7U
#define ADC_SQR3_SQ1__1st_CH8                           0x8U
#define ADC_SQR3_SQ1__1st_CH9                           0x9U
#define ADC_SQR3_SQ1__1st_CH10                          0xAU
#define ADC_SQR3_SQ1__1st_CH11                          0xBU
#define ADC_SQR3_SQ1__1st_CH12                          0xCU
#define ADC_SQR3_SQ1__1st_CH13                          0xDU
#define ADC_SQR3_SQ1__1st_CH14                          0xEU
#define ADC_SQR3_SQ1__1st_CH15                          0xFU
#define ADC_SQR3_SQ1__1st_CH16                          0x10U
#define ADC_SQR3_SQ1__1st_CH17                          0x11U

// ADC : JSQR
#define ADC_JSQR_JL__Injected_Sequence_Length_1_Conv    0x0U
#define ADC_JSQR_JL__Injected_Sequence_Length_2_Conv    0x1U
#define ADC_JSQR_JL__Injected_Sequence_Length_3_Conv    0x2U
#define ADC_JSQR_JL__Injected_Sequence_Length_4_Conv    0x3U

#define ADC_JSQR_JSQ4__4th_CH0                          0x0U
#define ADC_JSQR_JSQ4__4th_CH1                          0x1U
#define ADC_JSQR_JSQ4__4th_CH2                          0x2U
#define ADC_JSQR_JSQ4__4th_CH3                          0x3U
#define ADC_JSQR_JSQ4__4th_CH4                          0x4U
#define ADC_JSQR_JSQ4__4th_CH5                          0x5U
#define ADC_JSQR_JSQ4__4th_CH6                          0x6U
#define ADC_JSQR_JSQ4__4th_CH7                          0x7U
#define ADC_JSQR_JSQ4__4th_CH8                          0x8U
#define ADC_JSQR_JSQ4__4th_CH9                          0x9U
#define ADC_JSQR_JSQ4__4th_CH10                         0xAU
#define ADC_JSQR_JSQ4__4th_CH11                         0xBU
#define ADC_JSQR_JSQ4__4th_CH12                         0xCU
#define ADC_JSQR_JSQ4__4th_CH13                         0xDU
#define ADC_JSQR_JSQ4__4th_CH14                         0xEU
#define ADC_JSQR_JSQ4__4th_CH15                         0xFU
#define ADC_JSQR_JSQ4__4th_CH16                         0x10U
#define ADC_JSQR_JSQ4__4th_CH17                         0x11U

#define ADC_JSQR_JSQ3__3rd_CH0                          0x0U
#define ADC_JSQR_JSQ3__3rd_CH1                          0x1U
#define ADC_JSQR_JSQ3__3rd_CH2                          0x2U
#define ADC_JSQR_JSQ3__3rd_CH3                          0x3U
#define ADC_JSQR_JSQ3__3rd_CH4                          0x4U
#define ADC_JSQR_JSQ3__3rd_CH5                          0x5U
#define ADC_JSQR_JSQ3__3rd_CH6                          0x6U
#define ADC_JSQR_JSQ3__3rd_CH7                          0x7U
#define ADC_JSQR_JSQ3__3rd_CH8                          0x8U
#define ADC_JSQR_JSQ3__3rd_CH9                          0x9U
#define ADC_JSQR_JSQ3__3rd_CH10                         0xAU
#define ADC_JSQR_JSQ3__3rd_CH11                         0xBU
#define ADC_JSQR_JSQ3__3rd_CH12                         0xCU
#define ADC_JSQR_JSQ3__3rd_CH13                         0xDU
#define ADC_JSQR_JSQ3__3rd_CH14                         0xEU
#define ADC_JSQR_JSQ3__3rd_CH15                         0xFU
#define ADC_JSQR_JSQ3__3rd_CH16                         0x10U
#define ADC_JSQR_JSQ3__3rd_CH17                         0x11U

#define ADC_JSQR_JSQ2__2nd_CH0                          0x0U
#define ADC_JSQR_JSQ2__2nd_CH1                          0x1U
#define ADC_JSQR_JSQ2__2nd_CH2                          0x2U
#define ADC_JSQR_JSQ2__2nd_CH3                          0x3U
#define ADC_JSQR_JSQ2__2nd_CH4                          0x4U
#define ADC_JSQR_JSQ2__2nd_CH5                          0x5U
#define ADC_JSQR_JSQ2__2nd_CH6                          0x6U
#define ADC_JSQR_JSQ2__2nd_CH7                          0x7U
#define ADC_JSQR_JSQ2__2nd_CH8                          0x8U
#define ADC_JSQR_JSQ2__2nd_CH9                          0x9U
#define ADC_JSQR_JSQ2__2nd_CH10                         0xAU
#define ADC_JSQR_JSQ2__2nd_CH11                         0xBU
#define ADC_JSQR_JSQ2__2nd_CH12                         0xCU
#define ADC_JSQR_JSQ2__2nd_CH13                         0xDU
#define ADC_JSQR_JSQ2__2nd_CH14                         0xEU
#define ADC_JSQR_JSQ2__2nd_CH15                         0xFU
#define ADC_JSQR_JSQ2__2nd_CH16                         0x10U
#define ADC_JSQR_JSQ2__2nd_CH17                         0x11U

#define ADC_JSQR_JSQ1__1st_CH0                          0x0U
#define ADC_JSQR_JSQ1__1st_CH1                          0x1U
#define ADC_JSQR_JSQ1__1st_CH2                          0x2U
#define ADC_JSQR_JSQ1__1st_CH3                          0x3U
#define ADC_JSQR_JSQ1__1st_CH4                          0x4U
#define ADC_JSQR_JSQ1__1st_CH5                          0x5U
#define ADC_JSQR_JSQ1__1st_CH6                          0x6U
#define ADC_JSQR_JSQ1__1st_CH7                          0x7U
#define ADC_JSQR_JSQ1__1st_CH8                          0x8U
#define ADC_JSQR_JSQ1__1st_CH9                          0x9U
#define ADC_JSQR_JSQ1__1st_CH10                         0xAU
#define ADC_JSQR_JSQ1__1st_CH11                         0xBU
#define ADC_JSQR_JSQ1__1st_CH12                         0xCU
#define ADC_JSQR_JSQ1__1st_CH13                         0xDU
#define ADC_JSQR_JSQ1__1st_CH14                         0xEU
#define ADC_JSQR_JSQ1__1st_CH15                         0xFU
#define ADC_JSQR_JSQ1__1st_CH16                         0x10U
#define ADC_JSQR_JSQ1__1st_CH17                         0x11U

/*****************************************************************************
 ******     DMA
******************************************************************************/

// DMA : ISR
#define DMA_ISR_GIF1__CH1_No_TC_HT_TE_Events            0x0U
#define DMA_ISR_GIF1__CH1_TC_HT_TE_EventOccurred        0x1U

