pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define DMA_ISR_TCIF1__CH1_TransferCmpltEvent           0x0U
#define DMA_ISR_TCIF1__CH1_TransferCmpltEventOccurred   0x1U

#define DMA_ISR_HTIF1__CH1_NoHalfTransferEvent          0x0U
#define DMA_ISR_HTIF1__CH1_HalfTransferEventOccurred    0x1U

#define DMA_ISR_TEIF1__CH1_NoTransferError              0x0U
#define DMA_ISR_TEIF1__CH1_TransferErrorOccurred        0x1U

#define DMA_ISR_GIF2__CH2_No_TC_HT_TE_Events            0x0U
#define DMA_ISR_GIF2__CH2_TC_HT_TE_EventOccurred        0x1U

#define DMA_ISR_TCIF2__CH2_TransferCmpltEvent           0x0U
#define DMA_ISR_TCIF2__CH2_TransferCmpltEventOccurred   0x1U

#define DMA_ISR_HTIF2__CH2_NoHalfTransferEvent          0x0U
#define DMA_ISR_HTIF2__CH2_HalfTransferEventOccurred    0x1U

#define DMA_ISR_TEIF2__CH2_NoTransferError              0x0U
#define DMA_ISR_TEIF2__CH2_TransferErrorOccurred        0x1U

#define DMA_ISR_GIF3__CH3_No_TC_HT_TE_Events            0x0U
#define DMA_ISR_GIF3__CH3_TC_HT_TE_EventOccurred        0x1U

#define DMA_ISR_TCIF3__CH3_TransferCmpltEvent           0x0U
#define DMA_ISR_TCIF3__CH3_TransferCmpltEventOccurred   0x1U

#define DMA_ISR_HTIF3__CH3_NoHalfTransferEvent          0x0U
#define DMA_ISR_HTIF3__CH3_HalfTransferEventOccurred    0x1U

#define DMA_ISR_TEIF3__CH3_NoTransferError              0x0U
#define DMA_ISR_TEIF3__CH3_TransferErrorOccurred        0x1U

#define DMA_ISR_GIF4__CH4_No_TC_HT_TE_Events            0x0U
#define DMA_ISR_GIF4__CH4_TC_HT_TE_EventOccurred        0x1U

#define DMA_ISR_TCIF4__CH4_TransferCmpltEvent           0x0U
#define DMA_ISR_TCIF4__CH4_TransferCmpltEventOccurred   0x1U

#define DMA_ISR_HTIF4__CH4_NoHalfTransferEvent          0x0U
#define DMA_ISR_HTIF4__CH4_HalfTransferEventOccurred    0x1U

#define DMA_ISR_TEIF4__CH4_NoTransferError              0x0U
#define DMA_ISR_TEIF4__CH4_TransferErrorOccurred        0x1U

#define DMA_ISR_GIF5__CH5_No_TC_HT_TE_Events            0x0U
#define DMA_ISR_GIF5__CH5_TC_HT_TE_EventOccurred        0x1U

#define DMA_ISR_TCIF5__CH5_TransferCmpltEvent           0x0U
#define DMA_ISR_TCIF5__CH5_TransferCmpltEventOccurred   0x1U

#define DMA_ISR_HTIF1__CH1_NoHalfTransferEvent          0x0U
#define DMA_ISR_HTIF1__CH1_HalfTransferEventOccurred    0x1U

#define DMA_ISR_TEIF5__CH5_NoTransferError              0x0U
#define DMA_ISR_TEIF5__CH5_TransferErrorOccurred        0x1U

#define DMA_ISR_GIF6__CH6_No_TC_HT_TE_Events            0x0U
#define DMA_ISR_GIF6__CH6_TC_HT_TE_EventOccurred        0x1U

#define DMA_ISR_TCIF6__CH6_TransferCmpltEvent           0x0U
#define DMA_ISR_TCIF6__CH6_TransferCmpltEventOccurred   0x1U

#define DMA_ISR_HTIF6__CH6_NoHalfTransferEvent          0x0U
#define DMA_ISR_HTIF6__CH6_HalfTransferEventOccurred    0x1U

#define DMA_ISR_TEIF6__CH6_NoTransferError              0x0U
#define DMA_ISR_TEIF6__CH6_TransferErrorOccurred        0x1U

#define DMA_ISR_GIF7__CH7_No_TC_HT_TE_Events            0x0U
#define DMA_ISR_GIF7__CH7_TC_HT_TE_EventOccurred        0x1U

#define DMA_ISR_TCIF7__CH7_TransferCmpltEvent           0x0U
#define DMA_ISR_TCIF7__CH7_TransferCmpltEventOccurred   0x1U

#define DMA_ISR_HTIF7__CH7_NoHalfTransferEvent          0x0U
#define DMA_ISR_HTIF7__CH7_HalfTransferEventOccurred    0x1U

#define DMA_ISR_TEIF7__CH7_NoTransferError              0x0U
#define DMA_ISR_TEIF7__CH7_TransferErrorOccurred        0x1U


// DMA : IFCR
#define DMA_IFCR_CGIF1__GIF_TEIF_HTIF_TCIF_FlgClr       0x1U
#define DMA_IFCR_CTCIF1__TCIF_FlgClr                    0x1U
#define DMA_IFCR_CHTIF1__HTIF_FlgClr                    0x1U
#define DMA_IFCR_CTEIF1__HTIF_FlgClr                    0x1U

#define DMA_IFCR_CGIF2__GIF_TEIF_HTIF_TCIF_FlgClr       0x1U
#define DMA_IFCR_CTCIF2__TCIF_FlgClr                    0x1U
#define DMA_IFCR_CHTIF2__HTIF_FlgClr                    0x1U
#define DMA_IFCR_CTEIF2__HTIF_FlgClr                    0x1U

#define DMA_IFCR_CGIF3__GIF_TEIF_HTIF_TCIF_FlgClr       0x1U
#define DMA_IFCR_CTCIF3__TCIF_FlgClr                    0x1U
#define DMA_IFCR_CHTIF3__HTIF_FlgClr                    0x1U
#define DMA_IFCR_CTEIF3__HTIF_FlgClr                    0x1U

#define DMA_IFCR_CGIF4__GIF_TEIF_HTIF_TCIF_FlgClr       0x1U
#define DMA_IFCR_CTCIF4__TCIF_FlgClr                    0x1U
#define DMA_IFCR_CHTIF4__HTIF_FlgClr                    0x1U
#define DMA_IFCR_CTEIF4__HTIF_FlgClr                    0x1U

#define DMA_IFCR_CGIF5__GIF_TEIF_HTIF_TCIF_FlgClr       0x1U
#define DMA_IFCR_CTCIF5__TCIF_FlgClr                    0x1U
#define DMA_IFCR_CHTIF5__HTIF_FlgClr                    0x1U
#define DMA_IFCR_CTEIF5__HTIF_FlgClr                    0x1U

#define DMA_IFCR_CGIF6__GIF_TEIF_HTIF_TCIF_FlgClr       0x1U
#define DMA_IFCR_CTCIF6__TCIF_FlgClr                    0x1U
#define DMA_IFCR_CHTIF6__HTIF_FlgClr                    0x1U
#define DMA_IFCR_CTEIF6__HTIF_FlgClr                    0x1U

#define DMA_IFCR_CGIF7__GIF_TEIF_HTIF_TCIF_FlgClr       0x1U
#define DMA_IFCR_CTCIF7__TCIF_FlgClr                    0x1U
#define DMA_IFCR_CHTIF7__HTIF_FlgClr                    0x1U
#define DMA_IFCR_CTEIF7__HTIF_FlgClr                    0x1U


// DMA : CCR1
#define DMA_CCR1_EN__CH1_ChannelEnable                  0x1U
#define DMA_CCR1_EN__CH1_ChannelDisable                 0x0U

#define DMA_CCR1_TCIE__CH1_TransferCmplt_IntrptEnbl     0x1U
#define DMA_CCR1_TCIE__CH1_TransferCmplt_IntrptDsbl     0x0U

#define DMA_CCR1_HTIE__CH1_HalfTransfer_IntrptEnbl      0x1U
#define DMA_CCR1_HTIE__CH1_HalfTransfer_IntrptDsbl      0x0U

#define DMA_CCR1_TEIE__CH1_TransferError_IntrptEnbl     0x1U
#define DMA_CCR1_TEIE__CH1_TransferError_IntrptDsbl     0x0U

#define DMA_CCR1_DIR__CH1_ReadPeripheral                0x0U
#define DMA_CCR1_DIR__CH1_ReadMemory                    0x1U

#define DMA_CCR1_CIRC__CH1_Circular_Enable              0x1U
#define DMA_CCR1_CIRC__CH1_Circular_Disable             0x0U

#define DMA_CCR1_PINC__CH1_PeripheralIncrement_Enable   0x1U
#define DMA_CCR1_PINC__CH1_PeripheralIncrement_Disable  0x0U

#define DMA_CCR1_MINC__CH1_MemoryIncrement_Enable       0x1U
#define DMA_CCR1_MINC__CH1_MemoryIncrement_Disable      0x0U

