pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define DMA_CCR1_PSIZE__CH1_PeripheralSize_8bit         0x0U
#define DMA_CCR1_PSIZE__CH1_PeripheralSize_16bit        0x1U
#define DMA_CCR1_PSIZE__CH1_PeripheralSize_32bit        0x2U

#define DMA_CCR1_MSIZE__CH1_MemorySize_8bit             0x0U
#define DMA_CCR1_MSIZE__CH1_MemorySize_16bit            0x1U
#define DMA_CCR1_MSIZE__CH1_MemorySize_32bit            0x2U

#define DMA_CCR1_PL__CH1_Priority_Low                   0x0U
#define DMA_CCR1_PL__CH1_Priority_Medium                0x1U
#define DMA_CCR1_PL__CH1_Priority_High                  0x2U
#define DMA_CCR1_PL__CH1_Priority_VeryHigh              0x3U

#define DMA_CCR1_MEM2MEM__CH1_Memory2Memory_Enable      0x1U
#define DMA_CCR1_MEM2MEM__CH1_Memory2Memory_Disable     0x0U

// DMA : CCR2
#define DMA_CCR2_EN__CH2_ChannelEnable                  0x1U
#define DMA_CCR2_EN__CH2_ChannelDisable                 0x0U

#define DMA_CCR2_TCIE__CH2_TransferCmplt_IntrptEnbl     0x1U
#define DMA_CCR2_TCIE__CH2_TransferCmplt_IntrptDsbl     0x0U

#define DMA_CCR2_HTIE__CH2_HalfTransfer_IntrptEnbl      0x1U
#define DMA_CCR2_HTIE__CH2_HalfTransfer_IntrptDsbl      0x0U

#define DMA_CCR2_TEIE__CH2_TransferError_IntrptEnbl     0x1U
#define DMA_CCR2_TEIE__CH2_TransferError_IntrptDsbl     0x0U

#define DMA_CCR2_DIR__CH2_ReadPeripheral                0x0U
#define DMA_CCR2_DIR__CH2_ReadMemory                    0x1U

#define DMA_CCR2_CIRC__CH2_Circular_Enable              0x1U
#define DMA_CCR2_CIRC__CH2_Circular_Disable             0x0U

#define DMA_CCR2_PINC__CH2_PeripheralIncrement_Enable   0x1U
#define DMA_CCR2_PINC__CH2_PeripheralIncrement_Disable  0x0U

#define DMA_CCR2_MINC__CH2_MemoryIncrement_Enable       0x1U
#define DMA_CCR2_MINC__CH2_MemoryIncrement_Disable      0x0U

#define DMA_CCR2_PSIZE__CH2_PeripheralSize_8bit         0x0U
#define DMA_CCR2_PSIZE__CH2_PeripheralSize_16bit        0x1U
#define DMA_CCR2_PSIZE__CH2_PeripheralSize_32bit        0x2U

#define DMA_CCR2_MSIZE__CH2_MemorySize_8bit             0x0U
#define DMA_CCR2_MSIZE__CH2_MemorySize_16bit            0x1U
#define DMA_CCR2_MSIZE__CH2_MemorySize_32bit            0x2U

#define DMA_CCR2_PL__CH2_Priority_Low                   0x0U
#define DMA_CCR2_PL__CH2_Priority_Medium                0x1U
#define DMA_CCR2_PL__CH2_Priority_High                  0x2U
#define DMA_CCR2_PL__CH2_Priority_VeryHigh              0x3U

#define DMA_CCR2_MEM2MEM__CH2_Memory2Memory_Enable      0x1U
#define DMA_CCR2_MEM2MEM__CH2_Memory2Memory_Disable     0x0U

// DMA : CCR3
#define DMA_CCR3_EN__CH3_ChannelEnable                  0x1U
#define DMA_CCR3_EN__CH3_ChannelDisable                 0x0U

#define DMA_CCR3_TCIE__CH3_TransferCmplt_IntrptEnbl     0x1U
#define DMA_CCR3_TCIE__CH3_TransferCmplt_IntrptDsbl     0x0U

#define DMA_CCR3_HTIE__CH3_HalfTransfer_IntrptEnbl      0x1U
#define DMA_CCR3_HTIE__CH3_HalfTransfer_IntrptDsbl      0x0U

#define DMA_CCR3_TEIE__CH3_TransferError_IntrptEnbl     0x1U
#define DMA_CCR3_TEIE__CH3_TransferError_IntrptDsbl     0x0U

#define DMA_CCR3_DIR__CH3_ReadPeripheral                0x0U
#define DMA_CCR3_DIR__CH3_ReadMemory                    0x1U

#define DMA_CCR3_CIRC__CH3_Circular_Enable              0x1U
#define DMA_CCR3_CIRC__CH3_Circular_Disable             0x0U

#define DMA_CCR3_PINC__CH3_PeripheralIncrement_Enable   0x1U
#define DMA_CCR3_PINC__CH3_PeripheralIncrement_Disable  0x0U

#define DMA_CCR3_MINC__CH3_MemoryIncrement_Enable       0x1U
#define DMA_CCR3_MINC__CH3_MemoryIncrement_Disable      0x0U

#define DMA_CCR3_PSIZE__CH3_PeripheralSize_8bit         0x0U
#define DMA_CCR3_PSIZE__CH3_PeripheralSize_16bit        0x1U
#define DMA_CCR3_PSIZE__CH3_PeripheralSize_32bit        0x2U

#define DMA_CCR3_MSIZE__CH3_MemorySize_8bit             0x0U
#define DMA_CCR3_MSIZE__CH3_MemorySize_16bit            0x1U
#define DMA_CCR3_MSIZE__CH3_MemorySize_32bit            0x2U

#define DMA_CCR3_PL__CH3_Priority_Low                   0x0U
#define DMA_CCR3_PL__CH3_Priority_Medium                0x1U
#define DMA_CCR3_PL__CH3_Priority_High                  0x2U
#define DMA_CCR3_PL__CH3_Priority_VeryHigh              0x3U

#define DMA_CCR3_MEM2MEM__CH3_Memory2Memory_Enable      0x1U
#define DMA_CCR3_MEM2MEM__CH3_Memory2Memory_Disable     0x0U

// DMA : CCR4
#define DMA_CCR4_EN__CH4_ChannelEnable                  0x1U
#define DMA_CCR4_EN__CH4_ChannelDisable                 0x0U

#define DMA_CCR4_TCIE__CH4_TransferCmplt_IntrptEnbl     0x1U
#define DMA_CCR4_TCIE__CH4_TransferCmplt_IntrptDsbl     0x0U

#define DMA_CCR4_HTIE__CH4_HalfTransfer_IntrptEnbl      0x1U
#define DMA_CCR4_HTIE__CH4_HalfTransfer_IntrptDsbl      0x0U

#define DMA_CCR4_TEIE__CH4_TransferError_IntrptEnbl     0x1U
#define DMA_CCR4_TEIE__CH4_TransferError_IntrptDsbl     0x0U

#define DMA_CCR4_DIR__CH4_ReadPeripheral                0x0U
#define DMA_CCR4_DIR__CH4_ReadMemory                    0x1U

#define DMA_CCR4_CIRC__CH4_Circular_Enable              0x1U
#define DMA_CCR4_CIRC__CH4_Circular_Disable             0x0U

#define DMA_CCR4_PINC__CH4_PeripheralIncrement_Enable   0x1U
#define DMA_CCR4_PINC__CH4_PeripheralIncrement_Disable  0x0U

#define DMA_CCR4_MINC__CH4_MemoryIncrement_Enable       0x1U
#define DMA_CCR4_MINC__CH4_MemoryIncrement_Disable      0x0U

#define DMA_CCR4_PSIZE__CH4_PeripheralSize_8bit         0x0U
#define DMA_CCR4_PSIZE__CH4_PeripheralSize_16bit        0x1U
#define DMA_CCR4_PSIZE__CH4_PeripheralSize_32bit        0x2U

#define DMA_CCR4_MSIZE__CH4_MemorySize_8bit             0x0U
#define DMA_CCR4_MSIZE__CH4_MemorySize_16bit            0x1U
#define DMA_CCR4_MSIZE__CH4_MemorySize_32bit            0x2U

#define DMA_CCR4_PL__CH4_Priority_Low                   0x0U
#define DMA_CCR4_PL__CH4_Priority_Medium                0x1U
#define DMA_CCR4_PL__CH4_Priority_High                  0x2U
#define DMA_CCR4_PL__CH4_Priority_VeryHigh              0x3U

#define DMA_CCR4_MEM2MEM__CH4_Memory2Memory_Enable      0x1U
#define DMA_CCR4_MEM2MEM__CH4_Memory2Memory_Disable     0x0U

// DMA : CCR5
#define DMA_CCR5_EN__CH5_ChannelEnable                  0x1U
#define DMA_CCR5_EN__CH5_ChannelDisable                 0x0U

#define DMA_CCR5_TCIE__CH5_TransferCmplt_IntrptEnbl     0x1U
#define DMA_CCR5_TCIE__CH5_TransferCmplt_IntrptDsbl     0x0U

#define DMA_CCR5_HTIE__CH5_HalfTransfer_IntrptEnbl      0x1U
#define DMA_CCR5_HTIE__CH5_HalfTransfer_IntrptDsbl      0x0U

#define DMA_CCR5_TEIE__CH5_TransferError_IntrptEnbl     0x1U
#define DMA_CCR5_TEIE__CH5_TransferError_IntrptDsbl     0x0U

