pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define DMA_CCR5_DIR__CH5_ReadPeripheral                0x0U
#define DMA_CCR5_DIR__CH5_ReadMemory                    0x1U

#define DMA_CCR5_CIRC__CH5_Circular_Enable              0x1U
#define DMA_CCR5_CIRC__CH5_Circular_Disable             0x0U

#define DMA_CCR5_PINC__CH5_PeripheralIncrement_Enable   0x1U
#define DMA_CCR5_PINC__CH5_PeripheralIncrement_Disable  0x0U

#define DMA_CCR5_MINC__CH5_MemoryIncrement_Enable       0x1U
#define DMA_CCR5_MINC__CH5_MemoryIncrement_Disable      0x0U

#define DMA_CCR5_PSIZE__CH5_PeripheralSize_8bit         0x0U
#define DMA_CCR5_PSIZE__CH5_PeripheralSize_16bit        0x1U
#define DMA_CCR5_PSIZE__CH5_PeripheralSize_32bit        0x2U

#define DMA_CCR5_MSIZE__CH5_MemorySize_8bit             0x0U
#define DMA_CCR5_MSIZE__CH5_MemorySize_16bit            0x1U
#define DMA_CCR5_MSIZE__CH5_MemorySize_32bit            0x2U

#define DMA_CCR5_PL__CH5_Priority_Low                   0x0U
#define DMA_CCR5_PL__CH5_Priority_Medium                0x1U
#define DMA_CCR5_PL__CH5_Priority_High                  0x2U
#define DMA_CCR5_PL__CH5_Priority_VeryHigh              0x3U

#define DMA_CCR5_MEM2MEM__CH5_Memory2Memory_Enable      0x1U
#define DMA_CCR5_MEM2MEM__CH5_Memory2Memory_Disable     0x0U

// DMA : CCR6
#define DMA_CCR6_EN__CH6_ChannelEnable                  0x1U
#define DMA_CCR6_EN__CH6_ChannelDisable                 0x0U

#define DMA_CCR6_TCIE__CH6_TransferCmplt_IntrptEnbl     0x1U
#define DMA_CCR6_TCIE__CH6_TransferCmplt_IntrptDsbl     0x0U

#define DMA_CCR6_HTIE__CH6_HalfTransfer_IntrptEnbl      0x1U
#define DMA_CCR6_HTIE__CH6_HalfTransfer_IntrptDsbl      0x0U

#define DMA_CCR6_TEIE__CH6_TransferError_IntrptEnbl     0x1U
#define DMA_CCR6_TEIE__CH6_TransferError_IntrptDsbl     0x0U

#define DMA_CCR6_DIR__CH6_ReadPeripheral                0x0U
#define DMA_CCR6_DIR__CH6_ReadMemory                    0x1U

#define DMA_CCR6_CIRC__CH6_Circular_Enable              0x1U
#define DMA_CCR6_CIRC__CH6_Circular_Disable             0x0U

#define DMA_CCR6_PINC__CH6_PeripheralIncrement_Enable   0x1U
#define DMA_CCR6_PINC__CH6_PeripheralIncrement_Disable  0x0U

#define DMA_CCR6_MINC__CH6_MemoryIncrement_Enable       0x1U
#define DMA_CCR6_MINC__CH6_MemoryIncrement_Disable      0x0U

#define DMA_CCR6_PSIZE__CH6_PeripheralSize_8bit         0x0U
#define DMA_CCR6_PSIZE__CH6_PeripheralSize_16bit        0x1U
#define DMA_CCR6_PSIZE__CH6_PeripheralSize_32bit        0x2U

#define DMA_CCR6_MSIZE__CH6_MemorySize_8bit             0x0U
#define DMA_CCR6_MSIZE__CH6_MemorySize_16bit            0x1U
#define DMA_CCR6_MSIZE__CH6_MemorySize_32bit            0x2U

#define DMA_CCR6_PL__CH6_Priority_Low                   0x0U
#define DMA_CCR6_PL__CH6_Priority_Medium                0x1U
#define DMA_CCR6_PL__CH6_Priority_High                  0x2U
#define DMA_CCR6_PL__CH6_Priority_VeryHigh              0x3U

#define DMA_CCR6_MEM2MEM__CH6_Memory2Memory_Enable      0x1U
#define DMA_CCR6_MEM2MEM__CH6_Memory2Memory_Disable     0x0U

// DMA : CCR7
#define DMA_CCR7_EN__CH7_ChannelEnable                  0x1U
#define DMA_CCR7_EN__CH7_ChannelDisable                 0x0U

#define DMA_CCR7_TCIE__CH7_TransferCmplt_IntrptEnbl     0x1U
#define DMA_CCR7_TCIE__CH7_TransferCmplt_IntrptDsbl     0x0U

#define DMA_CCR7_HTIE__CH7_HalfTransfer_IntrptEnbl      0x1U
#define DMA_CCR7_HTIE__CH7_HalfTransfer_IntrptDsbl      0x0U

#define DMA_CCR7_TEIE__CH7_TransferError_IntrptEnbl     0x1U
#define DMA_CCR7_TEIE__CH7_TransferError_IntrptDsbl     0x0U

#define DMA_CCR7_DIR__CH7_ReadPeripheral                0x0U
#define DMA_CCR7_DIR__CH7_ReadMemory                    0x1U

#define DMA_CCR7_CIRC__CH7_Circular_Enable              0x1U
#define DMA_CCR7_CIRC__CH7_Circular_Disable             0x0U

#define DMA_CCR7_PINC__CH7_PeripheralIncrement_Enable   0x1U
#define DMA_CCR7_PINC__CH7_PeripheralIncrement_Disable  0x0U

#define DMA_CCR7_MINC__CH7_MemoryIncrement_Enable       0x1U
#define DMA_CCR7_MINC__CH7_MemoryIncrement_Disable      0x0U

#define DMA_CCR7_PSIZE__CH7_PeripheralSize_8bit         0x0U
#define DMA_CCR7_PSIZE__CH7_PeripheralSize_16bit        0x1U
#define DMA_CCR7_PSIZE__CH7_PeripheralSize_32bit        0x2U

#define DMA_CCR7_MSIZE__CH7_MemorySize_8bit             0x0U
#define DMA_CCR7_MSIZE__CH7_MemorySize_16bit            0x1U
#define DMA_CCR7_MSIZE__CH7_MemorySize_32bit            0x2U

#define DMA_CCR7_PL__CH7_Priority_Low                   0x0U
#define DMA_CCR7_PL__CH7_Priority_Medium                0x1U
#define DMA_CCR7_PL__CH7_Priority_High                  0x2U
#define DMA_CCR7_PL__CH7_Priority_VeryHigh              0x3U

#define DMA_CCR7_MEM2MEM__CH7_Memory2Memory_Enable      0x1U
#define DMA_CCR7_MEM2MEM__CH7_Memory2Memory_Disable     0x0U


/******************************************************************************
 ******     TIM
******************************************************************************/

// TIM : CR1
#define TIM_CR1_CKD__tDTS_tCK_INT                       0x0U
#define TIM_CR1_CKD__tDTS_2xtCK_INT                     0x1U
#define TIM_CR1_CKD__tDTS_4xCK_INT                      0x2U

#define TIM_CR1_APRE__ARR_Buffered_Disable              0x0U
#define TIM_CR1_APRE__ARR_Buffered_Enable               0x1U

#define TIM_CR1_CMS__EdgeAlignedMode                    0x0U
#define TIM_CR1_CMS__CenterAlignedMode1                 0x1U
#define TIM_CR1_CMS__CenterAlignedMode2                 0x2U
#define TIM_CR1_CMS__CenterAlignedMode3                 0x3U

#define TIM_CR1_DIR__UpCounter                          0x0U
#define TIM_CR1_DIR__DownCounter                        0x1U

#define TIM_CR1_OPM__OnePulseMode_Disable               0x0U
#define TIM_CR1_OPM__OnePulseMode_Enable                0x1U

#define TIM_CR1_URS__AnyEvent_Generate_UEV              0x0U
#define TIM_CR1_URS__OnlyCounterReload_Generate_UEV     0x1U

#define TIM_CR1_UDIS__UEV_Enable                        0x0U
#define TIM_CR1_UDIS__UEV_Disable                       0x1U

#define TIM_CR1_CEN__CounterEnable                      0x1U
#define TIM_CR1_CEN__CounterDisable                     0x0U

// TIM : CR2
#define TIM_CR2_OIS4__OC4_0_AfterDeadTime               0x0U
#define TIM_CR2_OIS4__OC4_1_AfterDeadTime               0x1U

#define TIM_CR2_OIS3N__OC3N_0_AfterDeadTime             0x0U
#define TIM_CR2_OIS3N__OC3N_1_AfterDeadTime             0x1U

#define TIM_CR2_OIS3__OC3_0_AfterDeadTime               0x0U
#define TIM_CR2_OIS3__OC3_1_AfterDeadTime               0x1U

#define TIM_CR2_OIS2N__OC2N_0_AfterDeadTime             0x0U
#define TIM_CR2_OIS2N__OC2N_1_AfterDeadTime             0x1U

#define TIM_CR2_OIS2__OC2_0_AfterDeadTime               0x0U
#define TIM_CR2_OIS2__OC2_1_AfterDeadTime               0x1U

#define TIM_CR2_OIS1N__OC1N_0_AfterDeadTime             0x0U
#define TIM_CR2_OIS1N__OC1N_1_AfterDeadTime             0x1U

#define TIM_CR2_OIS1__OC1_0_AfterDeadTime               0x0U
#define TIM_CR2_OIS1__OC1_1_AfterDeadTime               0x1U

#define TIM_CR2_TI1S__TIMx_CH1_ConnectedTo_TI1          0x0U
#define TIM_CR2_TI1S__TIMx_CH1_CH2_CH3_ConnectedTo_TI1  0x1U

