pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define TIM_CR2_MMS__Trigger_Output_Reset               0x0U
#define TIM_CR2_MMS__Trigger_Output_Enable              0x1U
#define TIM_CR2_MMS__Trigger_Output_Update              0x2U
#define TIM_CR2_MMS__Trigger_Output_ComparePulse        0x3U
#define TIM_CR2_MMS__Trigger_Output_OC1REF              0x4U
#define TIM_CR2_MMS__Trigger_Output_OC2REF              0x5U
#define TIM_CR2_MMS__Trigger_Output_OC3REF              0x6U
#define TIM_CR2_MMS__Trigger_Output_OC4REF              0x7U

#define TIM_CR2_CCDS__CCx_DMA_Request_CCx_Event         0x0U
#define TIM_CR2_CCDS__CCx_DMA_Request_Update_Event      0x1U

#define TIM_CR2_CCUS__CC_ControlBitsUpdatedBy_COMG      0x0U
#define TIM_CR2_CCUS__CC_ControlBitsUpdatedBy_COMG_TRGI 0x1U

#define TIM_CR2_CCPC__CCxE_CCxNE_OCxM_NotPreloaded      0x0U
#define TIM_CR2_CCPC__CCxE_CCxNE_OCxM_Preloaded         0x1U

// TIM : SMCR
#define TIM_SMCR_ETP__ETR_notInverted                   0x0U
#define TIM_SMCR_ETP__ETR_Inverted                      0x1U

#define TIM_SMCR_ECE__ExternalClockMode2_Disable        0x0U
#define TIM_SMCR_ECE__ExternalClockMode2_Enable         0x1U

#define TIM_SMCR_ETPS__Prescaler_Off                    0x0U
#define TIM_SMCR_ETPS__ETRP_Div_2                       0x1U
#define TIM_SMCR_ETPS__ETRP_Div_4                       0x2U
#define TIM_SMCR_ETPS__ETRP_Div_8                       0x3U

#define TIM_SMCR_ETF__NoFilter                          0x0U
#define TIM_SMCR_ETF__INT_N2                            0x1U
#define TIM_SMCR_ETF__INT_N4                            0x2U
#define TIM_SMCR_ETF__INT_N8                            0x3U
#define TIM_SMCR_ETF__DTSdiv2_N6                        0x4U
#define TIM_SMCR_ETF__DTSdiv2_N8                        0x5U
#define TIM_SMCR_ETF__DTSdiv4_N6                        0x6U
#define TIM_SMCR_ETF__DTSdiv4_N8                        0x7U
#define TIM_SMCR_ETF__DTSdiv8_N6                        0x8U
#define TIM_SMCR_ETF__DTSdiv8_N8                        0x9U
#define TIM_SMCR_ETF__DTSdiv16_N5                       0xAU
#define TIM_SMCR_ETF__DTSdiv16_N6                       0xBU
#define TIM_SMCR_ETF__DTSdiv16_N8                       0xCU
#define TIM_SMCR_ETF__DTSdiv32_N5                       0xDU
#define TIM_SMCR_ETF__DTSdiv32_N6                       0xEU
#define TIM_SMCR_ETF__DTSdiv32_N8                       0xFU

#define TIM_SMCR_MSM__NoAction                          0x0U
#define TIM_SMCR_MSM__Synchronize_MasterAndSlave        0x1U

#define TIM_SMCR_TS__InternalTrigger_ITR0               0x0U
#define TIM_SMCR_TS__InternalTrigger_ITR1               0x1U
#define TIM_SMCR_TS__InternalTrigger_ITR2               0x2U
#define TIM_SMCR_TS__InternalTrigger_ITR3               0x3U
#define TIM_SMCR_TS__InternalTrigger_TI1FED             0x4U
#define TIM_SMCR_TS__InternalTrigger_TI1FP1             0x5U
#define TIM_SMCR_TS__InternalTrigger_TI1FP2             0x6U
#define TIM_SMCR_TS__InternalTrigger_ETRF               0x7U

#define TIM_SMCR_SMS__Disable                           0x0U
#define TIM_SMCR_SMS__EncoderMode1                      0x1U
#define TIM_SMCR_SMS__EncoderMode2                      0x2U
#define TIM_SMCR_SMS__EncoderMode3                      0x3U
#define TIM_SMCR_SMS__ResetMode                         0x4U
#define TIM_SMCR_SMS__GatedMode                         0x5U
#define TIM_SMCR_SMS__TriggerMode                       0x6U
#define TIM_SMCR_SMS__ExternalClockMode1                0x7U

// TIM : DIER
#define TIM_DIER_TDE__Triger_DMA_Enable                 0x1U
#define TIM_DIER_TDE__Triger_DMA_Disable                0x0U

#define TIM_DIER_COMDE__COM_DMA_Enable                  0x1U
#define TIM_DIER_COMDE__COM_DMA_Disable                 0x0U

#define TIM_DIER_CC1DE__CC1_DMA_Enable                  0x1U
#define TIM_DIER_CC1DE__CC1_DMA_Disable                 0x0U

#define TIM_DIER_CC2DE__CC2_DMA_Enable                  0x1U
#define TIM_DIER_CC2DE__CC2_DMA_Disable                 0x0U

#define TIM_DIER_CC3DE__CC3_DMA_Enable                  0x1U
#define TIM_DIER_CC3DE__CC3_DMA_Disable                 0x0U

#define TIM_DIER_CC4DE__CC4_DMA_Enable                  0x1U
#define TIM_DIER_CC4DE__CC4_DMA_Disable                 0x0U

#define TIM_DIER_UDE__Update_DMA_Enable                 0x1U
#define TIM_DIER_UDE__Update_DMA_Disable                0x0U

#define TIM_DIER_BIE__Break_IntrptEnbl                  0x1U
#define TIM_DIER_BIE__Break_IntrptDsbl                  0x0U

#define TIM_DIER_TIE__Triger_IntrptEnbl                 0x1U
#define TIM_DIER_TIE__Triger_IntrptDsbl                 0x0U

#define TIM_DIER_COMIE__COM_IntrptEnbl                  0x1U
#define TIM_DIER_COMIE__COM_IntrptDsbl                  0x0U

#define TIM_DIER_CC1IE__CC1_IntrptEnbl                  0x1U
#define TIM_DIER_CC1IE__CC1_IntrptDsbl                  0x0U

#define TIM_DIER_CC2IE__CC2_IntrptEnbl                  0x1U
#define TIM_DIER_CC2IE__CC2_IntrptDsbl                  0x0U

#define TIM_DIER_CC3IE__CC3_IntrptEnbl                  0x1U
#define TIM_DIER_CC3IE__CC3_IntrptDsbl                  0x0U

#define TIM_DIER_CC4IE__CC4_IntrptEnbl                  0x1U
#define TIM_DIER_CC4IE__CC4_IntrptDsbl                  0x0U

#define TIM_DIER_UIE__Update_IntrptEnbl                 0x1U
#define TIM_DIER_UIE__Update_IntrptDsbl                 0x0U

// TIM : SR
#define TIM_SR_BIF__Break_IntrptEnbl                    0x1U
#define TIM_SR_BIF__Break_IntrptDsbl                    0x0U

#define TIM_SR_TIF__Triger_IntrptEnbl                   0x1U
#define TIM_SR_TIF__Triger_IntrptDsbl                   0x0U

#define TIM_SR_COMIF__COM_IntrptEnbl                    0x1U
#define TIM_SR_COMIF__COM_IntrptDsbl                    0x0U

#define TIM_SR_CC1IF__CC1_IntrptEnbl                    0x1U
#define TIM_SR_CC1IF__CC1_IntrptDsbl                    0x0U

#define TIM_SR_CC2IF__CC2_IntrptEnbl                    0x1U
#define TIM_SR_CC2IF__CC2_IntrptDsbl                    0x0U

#define TIM_SR_CC3IF__CC3_IntrptEnbl                    0x1U
#define TIM_SR_CC3IF__CC3_IntrptDsbl                    0x0U

#define TIM_SR_CC4IF__CC4_IntrptEnbl                    0x1U
#define TIM_SR_CC4IF__CC4_IntrptDsbl                    0x0U

#define TIM_SR_UIF__Update_IntrptEnbl                   0x1U
#define TIM_SR_UIF__Update_IntrptDsbl                   0x0U

