pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
// TIM : EGR
#define TIM_EGR_UG__Generate_Update_Event               0x1U
#define TIM_EGR_CC1G__Generate_CC1_Event                0x1U
#define TIM_EGR_CC2G__Generate_CC2_Event                0x1U
#define TIM_EGR_CC3G__Generate_CC3_Event                0x1U
#define TIM_EGR_CC4G__Generate_CC4_Event                0x1U
#define TIM_EGR_COMG__Generate_COM_Event                0x1U
#define TIM_EGR_TG__Generate_Trigger_Event              0x1U
#define TIM_EGR_BG__Generate_Break_Event                0x1U

// TIM : CCMR1
#define TIM_CCMR1_CC1S__Output                          0x0U
#define TIM_CCMR1_CC1S__InputDirect                     0x1U
#define TIM_CCMR1_CC1S__InputIndirect                   0x2U
#define TIM_CCMR1_CC1S__TRC                             0x3U

#define TIM_CCMR1_OC1FE__OutputCompare_FastMode_Disable 0x0U
#define TIM_CCMR1_OC1FE__OutputCompare_FastMode_Enable  0x1U

#define TIM_CCMR1_OC1PE__Preload_Enable                 0x1U
#define TIM_CCMR1_OC1PE__Preload_Disable                0x0U

#define TIM_CCMR1_OC1M__Frozen                          0x0U
#define TIM_CCMR1_OC1M__ActiveOnMatch                   0x1U
#define TIM_CCMR1_OC1M__InactiveOnMatch                 0x2U
#define TIM_CCMR1_OC1M__Toggle                          0x3U
#define TIM_CCMR1_OC1M__ForceInactive                   0x4U
#define TIM_CCMR1_OC1M__ForceActive                     0x5U
#define TIM_CCMR1_OC1M__PWM1                            0x6U
#define TIM_CCMR1_OC1M__PWM2                            0x7U

#define TIM_CCMR1_OC1CE__OCxRef_NotAffectedByETRF       0x1U
#define TIM_CCMR1_OC1CE__OCxRef_CleardByETRF            0x0U

#define TIM_CCMR1_IC1PSC__NoPrescaler                   0x1U
#define TIM_CCMR1_IC1PSC__Div_2                         0x1U
#define TIM_CCMR1_IC1PSC__Div_4                         0x2U
#define TIM_CCMR1_IC1PSC__Div_8                         0x3U

#define TIM_CCMR1_IC1F__NoFilter                        0x0U
#define TIM_CCMR1_IC1F__Fsampling_Fint_N2               0x1U
#define TIM_CCMR1_IC1F__Fsampling_Fint_N4               0x2U
#define TIM_CCMR1_IC1F__Fsampling_Fint_N8               0x3U
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv2_N6           0x4U
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv2_N8           0x5U
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv4_N6           0x6U
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv4_N80          0x7U
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv8_N60          0x8U
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv8_N80          0x9U
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv16_N5          0xAU
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv16_N6          0xBU
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv16_N8          0xCU
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv32_N5          0xDU
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv32_N6          0xEU
#define TIM_CCMR1_IC1F__Fsampling_FdtsDiv32_N8          0xFU

#define TIM_CCMR1_CC2S__Output                          0x0U
#define TIM_CCMR1_CC2S__InputDirect                     0x1U
#define TIM_CCMR1_CC2S__InputIndirect                   0x2U
#define TIM_CCMR1_CC2S__TRC                             0x3U

#define TIM_CCMR1_OC2FE__OutputCompare_FastMode_Disable 0x0U
#define TIM_CCMR1_OC2FE__OutputCompare_FastMode_Enable  0x1U

#define TIM_CCMR1_OC2PE__Preload_Enable                 0x1U
#define TIM_CCMR1_OC2PE__Preload_Disable                0x0U

#define TIM_CCMR1_OC2M__Frozen                          0x0U
#define TIM_CCMR1_OC2M__ActiveOnMatch                   0x1U
#define TIM_CCMR1_OC2M__InactiveOnMatch                 0x2U
#define TIM_CCMR1_OC2M__Toggle                          0x3U
#define TIM_CCMR1_OC2M__ForceInactive                   0x4U
#define TIM_CCMR1_OC2M__ForceActive                     0x5U
#define TIM_CCMR1_OC2M__PWM1                            0x6U
#define TIM_CCMR1_OC2M__PWM2                            0x7U

#define TIM_CCMR1_OC2CE__OCxRef_NotAffectedByETRF       0x1U
#define TIM_CCMR1_OC2CE__OCxRef_CleardByETRF            0x0U

#define TIM_CCMR1_IC2PSC__NoPrescaler                   0x1U
#define TIM_CCMR1_IC2PSC__Div_2                         0x1U
#define TIM_CCMR1_IC2PSC__Div_4                         0x2U
#define TIM_CCMR1_IC2PSC__Div_8                         0x3U

#define TIM_CCMR1_IC1F__NoFilter                        0x0U
#define TIM_CCMR1_IC2F__Fsampling_Fint_N2               0x1U
#define TIM_CCMR1_IC2F__Fsampling_Fint_N4               0x2U
#define TIM_CCMR1_IC2F__Fsampling_Fint_N8               0x3U
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv2_N6           0x4U
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv2_N8           0x5U
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv4_N6           0x6U
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv4_N8           0x7U
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv8_N6           0x8U
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv8_N8           0x9U
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv16_N5          0xAU
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv16_N6          0xBU
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv16_N8          0xCU
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv32_N5          0xDU
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv32_N6          0xEU
#define TIM_CCMR1_IC2F__Fsampling_FdtsDiv32_N8          0xFU

// TIM : CCMR2
#define TIM_CCMR2_CC3S__Output                          0x0U
#define TIM_CCMR2_CC3S__InputDirect                     0x1U
#define TIM_CCMR2_CC3S__InputIndirect                   0x2U
#define TIM_CCMR2_CC3S__TRC                             0x3U

#define TIM_CCMR2_OC3FE__OutputCompare_FastMode_Disable 0x0U
#define TIM_CCMR2_OC3FE__OutputCompare_FastMode_Enable  0x1U

#define TIM_CCMR2_OC3PE__Preload_Enable                 0x1U
#define TIM_CCMR2_OC3PE__Preload_Disable                0x0U

#define TIM_CCMR2_OC3M__Frozen                          0x0U
#define TIM_CCMR2_OC3M__ActiveOnMatch                   0x1U
#define TIM_CCMR2_OC3M__InactiveOnMatch                 0x2U
#define TIM_CCMR2_OC3M__Toggle                          0x3U
#define TIM_CCMR2_OC3M__ForceInactive                   0x4U
#define TIM_CCMR2_OC3M__ForceActive                     0x5U
#define TIM_CCMR2_OC3M__PWM1                            0x6U
#define TIM_CCMR2_OC3M__PWM2                            0x7U

