pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define TIM_CCMR2_CC4S__Output                          0x0U
#define TIM_CCMR2_CC4S__InputDirect                     0x1U
#define TIM_CCMR2_CC4S__InputIndirect                   0x2U
#define TIM_CCMR2_CC4S__TRC                             0x3U

#define TIM_CCMR2_OC4FE__OutputCompare_FastMode_Disable 0x0U
#define TIM_CCMR2_OC4FE__OutputCompare_FastMode_Enable  0x1U

#define TIM_CCMR2_OC4PE__Preload_Enable                 0x1U
#define TIM_CCMR2_OC4PE__Preload_Disable                0x0U

#define TIM_CCMR2_OC4M__Frozen                          0x0U
#define TIM_CCMR2_OC4M__ActiveOnMatch                   0x1U
#define TIM_CCMR2_OC4M__InactiveOnMatch                 0x2U
#define TIM_CCMR2_OC4M__Toggle                          0x3U
#define TIM_CCMR2_OC4M__ForceInactive                   0x4U
#define TIM_CCMR2_OC4M__ForceActive                     0x5U
#define TIM_CCMR2_OC4M__PWM1                            0x6U
#define TIM_CCMR2_OC4M__PWM2                            0x7U

#define TIM_CCMR2_OC3CE__OC3Ref_NotAffectedByETRF       0x1U
#define TIM_CCMR2_OC3CE__OC3Ref_CleardByETRF            0x0U

#define TIM_CCMR2_OC4CE__OC4Ref_NotAffectedByETRF       0x1U
#define TIM_CCMR2_OC4CE__OC4Ref_CleardByETRF            0x0U

#define TIM_CCMR2_IC3PSC__NoPrescaler                   0x1U
#define TIM_CCMR2_IC3PSC__Div_2                         0x1U
#define TIM_CCMR2_IC3PSC__Div_4                         0x2U
#define TIM_CCMR2_IC3PSC__Div_8                         0x3U

#define TIM_CCMR2_IC4PSC__NoPrescaler                   0x1U
#define TIM_CCMR2_IC4PSC__Div_2                         0x1U
#define TIM_CCMR2_IC4PSC__Div_4                         0x2U
#define TIM_CCMR2_IC4PSC__Div_8                         0x3U

#define TIM_CCMR1_IC1F__NoFilter                        0x0U
#define TIM_CCMR2_IC3F__Fsampling_Fint_N2               0x1U
#define TIM_CCMR2_IC3F__Fsampling_Fint_N4               0x2U
#define TIM_CCMR2_IC3F__Fsampling_Fint_N8               0x3U
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv2_N6           0x4U
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv2_N8           0x5U
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv4_N6           0x6U
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv4_N8           0x7U
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv8_N6           0x8U
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv8_N8           0x9U
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv16_N5          0xAU
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv16_N6          0xBU
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv16_N8          0xCU
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv32_N5          0xDU
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv32_N6          0xEU
#define TIM_CCMR2_IC3F__Fsampling_FdtsDiv32_N8          0xFU

#define TIM_CCMR1_IC1F__NoFilter                        0x0U
#define TIM_CCMR2_IC4F__Fsampling_Fint_N2               0x1U
#define TIM_CCMR2_IC4F__Fsampling_Fint_N4               0x2U
#define TIM_CCMR2_IC4F__Fsampling_Fint_N8               0x3U
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv2_N6           0x4U
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv2_N8           0x5U
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv4_N6           0x6U
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv4_N8           0x7U
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv8_N6           0x8U
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv8_N8           0x9U
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv16_N5          0xAU
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv16_N6          0xBU
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv16_N8          0xCU
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv32_N5          0xDU
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv32_N6          0xEU
#define TIM_CCMR2_IC4F__Fsampling_FdtsDiv32_N8          0xFU

// TIM : CCER
#define TIM_CCER_CCxE__ChannelEnable                    0x1U
#define TIM_CCER_CCxE__ChannelDisable                   0x0U

#define TIM_CCER_CCxP__OCActiveHigh                     0x0U
#define TIM_CCER_CCxP__OCActiveLow                      0x1U

#define TIM_CCER_CCxP__ICRisingEdge                     0x0U
#define TIM_CCER_CCxP__ICFallingEdge                    0x1U

#define TIM_CCER_CCxNE__ChannelEnable                   0x1U
#define TIM_CCER_CCxNE__ChannelDisable                  0x0U

#define TIM_CCER_CCxNP__OCActiveHigh                    0x0U
#define TIM_CCER_CCxNP__OCActiveLow                    0x1U

// TIM : BDTR
#define TIM_BDTR_MOE__Main_output_Disable               0x0U
#define TIM_BDTR_MOE__Main_output_Enable                0x1U

#define TIM_BDTR_AOE__MOE_SetOnlyBySoftware             0x0U
#define TIM_BDTR_AOE__MOE_SetBySoftwareOrUpdateEvent    0x1U

#define TIM_BDTR_BKP__BreakInput_ActiveLow              0x0U
#define TIM_BDTR_BKP__BreakInput_ActiveHigh             0x1U

#define TIM_BDTR_BKE__BreakInputs_Disable               0x0U
#define TIM_BDTR_BKE__BreakInputs_Enable                0x1U

#define TIM_BDTR_OSSR__WhenInactive_OC_OCN_Disable      0x0U
#define TIM_BDTR_OSSR__WhenInactive_OC_OCN_Enabled      0x1U

#define TIM_BDTR_OSSI__WhenInactive_OC_OCN_Disable      0x0U
#define TIM_BDTR_OSSI__WhenInactive_OC_OCN_ForcedIdle   0x1U

#define TIM_BDTR_LOCK__Lock_Off                         0x0U
#define TIM_BDTR_LOCK__L1_DTG_OISx_OISxN_BKE_BKP_AOE    0x1U
#define TIM_BDTR_LOCK__L2_L1plus_CCxP_CCxNP_OSSR_OSSI   0x2U
#define TIM_BDTR_LOCK__L3_L2plus_OCxM_OCxPE             0x3U

// TIM : DCR
#define TIM_DCR_DBL__1_Transfer                         0x0U
#define TIM_DCR_DBL__2_Transfer                         0x1U
#define TIM_DCR_DBL__3_Transfer                         0x2U
#define TIM_DCR_DBL__4_Transfer                         0x3U
#define TIM_DCR_DBL__5_Transfer                         0x4U
#define TIM_DCR_DBL__6_Transfer                         0x5U
#define TIM_DCR_DBL__7_Transfer                         0x6U
#define TIM_DCR_DBL__8_Transfer                         0x7U
#define TIM_DCR_DBL__9_Transfer                         0x8U
#define TIM_DCR_DBL__10_Transfer                        0x9U
#define TIM_DCR_DBL__11_Transfer                        0xAU
#define TIM_DCR_DBL__12_Transfer                        0xBU
#define TIM_DCR_DBL__13_Transfer                        0xCU
#define TIM_DCR_DBL__14_Transfer                        0xDU
#define TIM_DCR_DBL__15_Transfer                        0xEU
#define TIM_DCR_DBL__16_Transfer                        0xFU
#define TIM_DCR_DBL__17_Transfer                        0x10U
#define TIM_DCR_DBL__18_Transfer                        0x11U

#define TIM_DCR_DBA__TIMx_CR1                           0x0U
#define TIM_DCR_DBA__TIMx_CR2                           0x1U
#define TIM_DCR_DBA__TIMx_SMCR                          0x2U
#define TIM_DCR_DBA__TIMx_DIER                          0x3U
#define TIM_DCR_DBA__TIMx_SR                            0x4U
#define TIM_DCR_DBA__TIMx_EGR                           0x5U
#define TIM_DCR_DBA__TIMx_CCMR1                         0x6U
#define TIM_DCR_DBA__TIMx_CCMR2                         0x7U
#define TIM_DCR_DBA__TIMx_CCER                          0x8U
#define TIM_DCR_DBA__TIMx_CNT                           0x9U
#define TIM_DCR_DBA__TIMx_PSC                           0xAU
#define TIM_DCR_DBA__TIMx_ARR                           0xBU
#define TIM_DCR_DBA__TIMx_RCR                           0xCU
#define TIM_DCR_DBA__TIMx_CCR1                          0xDU
#define TIM_DCR_DBA__TIMx_CCR2                          0xEU
#define TIM_DCR_DBA__TIMx_CCR3                          0xFU
#define TIM_DCR_DBA__TIMx_CCR4                          0x10U
#define TIM_DCR_DBA__TIMx_BDTR                          0x11U
#define TIM_DCR_DBA__TIMx_DCR                           0x12U
#define TIM_DCR_DBA__TIMx_DMAR                          0x13U

/*****************************************************************************
 ******     RTC
******************************************************************************/

// RTC : CRH
#define RTC_CRH_SECIE__Second_IntrptDsbl                0x0U
#define RTC_CRH_SECIE__Second_IntrptEnbl                0x1U

#define RTC_CRH_ALRIE__Alarm_IntrptDsbl                 0x0U
#define RTC_CRH_ALRIE__Alarm_IntrptEnbl                 0x1U

#define RTC_CRH_OWIE__Overflow_IntrptDsbl               0x0U
#define RTC_CRH_OWIE__Overflow_IntrptEnbl               0x1U

