pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
// RTC : CRL
#define RTC_CRL_ALRF__No_Alarm                          0x0U
#define RTC_CRL_ALRF__Alarm_Detected                    0x1U

#define RTC_CRL_SECF__No_SecondFlag                     0x0U
#define RTC_CRL_SECF__SecondFlagConditionMet            0x1U

#define RTC_CRL_OWF__No_OverFlow                        0x0U
#define RTC_CRL_OWF__OverFlow_Occurred                  0x1U

#define RTC_CRL_RSF__Registers_NOT_Synchronized         0x0U
#define RTC_CRL_RSF__Registers_Synchronized             0x1U

#define RTC_CRL_CNF__ExitConfigurationMode              0x0U
#define RTC_CRL_CNF__EnterConfigurationMode             0x1U

#define RTC_CRL_RTOFF__WriteOperation_Ongoing           0x0U
#define RTC_CRL_RTOFF__WriteOperation_Terminated        0x1U

/*****************************************************************************
 ******     IWDG
******************************************************************************/

// IWDG : KR
#define IWDG_KR_KEY__UpdateCounter                      0xAAAAU
#define IWDG_KR_KEY__PR_RLR_EnableAccess                0x5555U
#define IWDG_KR_KEY__StartWatchDog                      0xCCCCU

// IWDG : PR
#define IWDG_PR_PR__Div_4                               0x0U
#define IWDG_PR_PR__Div_8                               0x1U
#define IWDG_PR_PR__Div_16                              0x2U
#define IWDG_PR_PR__Div_32                              0x3U
#define IWDG_PR_PR__Div_64                              0x4U
#define IWDG_PR_PR__Div_128                             0x5U
#define IWDG_PR_PR__Div_256                             0x6U
#define IWDG_PR_PR__Div_256_                            0x7U

// IWDG : SR
#define IWDG_SR_RVU__ReloadValueUpdate_Cmpltd           0x0U
#define IWDG_SR_RVU__ReloadValueUpdate_Ongoing          0x1U

#define IWDG_SR_RVU__PrescalerValueUpdate_Cmpltd        0x0U
#define IWDG_SR_RVU__PrescalerValueUpdate_Ongoing       0x1U

/*****************************************************************************
 ******     20 WWDG
******************************************************************************/

// WWDG : CR
#define WWDG_CR_WDGA__Watchdog_Disable                  0x0U
#define WWDG_CR_WDGA__Watchdog_Enable                   0x1U

// WWDG : CFR
#define WWDG_CFR_WDGTB__PCLK1_Div_1                     0x0U
#define WWDG_CFR_WDGTB__PCLK1_Div_2                     0x1U
#define WWDG_CFR_WDGTB__PCLK1_Div_4                     0x2U
#define WWDG_CFR_WDGTB__PCLK1_Div_8                     0x3U

#define WWDG_CFR_EWI__EearlyWakeUp_IntrptDsbl           0x0U
#define WWDG_CFR_EWI__EearlyWakeUp_IntrptEnbl           0x1U

// WWDG : SR
#define WWDG_SR_EWIF__EerlyWakeUpInterrupt_Occurred     0x1U
#define WWDG_SR_EWIF__EerlyWakeUpInterrupt_FlgClr       0x0U

/*****************************************************************************
 ******     USART
******************************************************************************/

// USART : SR
#define USART_SR_PE__NO_ParityError                     0x0U
#define USART_SR_PE__ParityError_Detected               0x1U

#define USART_SR_FE__NO_FramingError                    0x0U
#define USART_SR_FE__FramingError_Detected              0x1U

#define USART_SR_NE__NO_NoiseError                      0x0U
#define USART_SR_NE__NoiseError_Detected                0x1U

#define USART_SR_ORE__NO_OverrunError                   0x0U
#define USART_SR_ORE__OverrunError_Detected             0x1U

#define USART_SR_IDLE__IdleLine_NOT_Detected            0x0U
#define USART_SR_IDLE__IdleLine_Detected                0x1U

#define USART_SR_RXNE__RXNE_FlgClr                      0x0U
#define USART_SR_RXNE__Data_NOT_Received                0x0U
#define USART_SR_RXNE__Data_Received                    0x1U

#define USART_SR_TC__TC_FlgClr                          0x0U
#define USART_SR_TC__Transmission_NOT_Cmplt             0x0U
#define USART_SR_TC__Transmission_Cmplt                 0x1U

#define USART_SR_TXE__DataNotTransferredToShiftReg      0x0U
#define USART_SR_TXE__DataTransferredToShiftReg         0x1U

#define USART_SR_LBD__LBD_FlgClr                        0x0U
#define USART_SR_LBD__LINbreak_NOT_Detected             0x0U
#define USART_SR_LBD__LINbreak_Detected                 0x1U

#define USART_SR_CTS__CTS_FlgClr                        0x0U
#define USART_SR_CTS__NoChangeOn_CTS_StatusLine         0x0U
#define USART_SR_CTS__ChangeOn_CTS_StatusLine           0x1U

// USART : CR1
#define USART_CR1_SBK__NoBreakCharacter                 0x0U
#define USART_CR1_SBK__BreakCharacter_Transmitted       0x1U

#define USART_CR1_RWU__Receiver_ActiveMode              0x0U
#define USART_CR1_RWU__Receiver_MuteMode                0x1U

#define USART_CR1_RE__Receiver_Disable                  0x0U
#define USART_CR1_RE__Receiver_Enable                   0x1U

#define USART_CR1_TE__Transmitter_Disable               0x0U
#define USART_CR1_TE__Transmitter_Enable                0x1U

#define USART_CR1_IDLEIE__IDLE_IntrptDsbl               0x0U
#define USART_CR1_IDLEIE__IDLE_IntrptEnbl               0x1U

#define USART_CR1_RXNEIE__RXNE_IntrptDsbl               0x0U
#define USART_CR1_RXNEIE__RXNE_IntrptEnbl               0x1U

#define USART_CR1_TCIE__TC_IntrptDsbl                   0x0U
#define USART_CR1_TCIE__TC_IntrptEnbl                   0x1U

#define USART_CR1_TXEIE__TXE_IntrptDsbl                 0x0U
#define USART_CR1_TXEIE__TXE_IntrptEnbl                 0x1U

#define USART_CR1_PEIE__PE_IntrptDsbl                   0x0U
#define USART_CR1_PEIE__PE_IntrptEnbl                   0x1U

#define USART_CR1_PS__Even_Parity                       0x0U
#define USART_CR1_PS__Odd_Parity                        0x1U

#define USART_CR1_PCE__ParityControl_Disable            0x0U
#define USART_CR1_PCE__ParityControl_Enable             0x1U

#define USART_CR1_WAKE__WakeUpMethod_IdleLine           0x0U
#define USART_CR1_WAKE__WakeUpMethod_AddressMark        0x1U

#define USART_CR1_M__1_StartBit_8_DataBits              0x0U
#define USART_CR1_M__1_StartBit_9_DataBits              0x1U

#define USART_CR1_UE__USART_Disable                     0x0U
#define USART_CR1_UE__USART_Enable                      0x1U

// USART : CR2
#define USART_CR2_ADD__NodeAddress_0                    0x0U
#define USART_CR2_ADD__NodeAddress_1                    0x1U
#define USART_CR2_ADD__NodeAddress_2                    0x2U
#define USART_CR2_ADD__NodeAddress_3                    0x3U
#define USART_CR2_ADD__NodeAddress_4                    0x4U
#define USART_CR2_ADD__NodeAddress_5                    0x5U
#define USART_CR2_ADD__NodeAddress_6                    0x6U
#define USART_CR2_ADD__NodeAddress_7                    0x7U
#define USART_CR2_ADD__NodeAddress_8                    0x8U
#define USART_CR2_ADD__NodeAddress_9                    0x9U
#define USART_CR2_ADD__NodeAddress_10                   0xAU
#define USART_CR2_ADD__NodeAddress_11                   0xBU
#define USART_CR2_ADD__NodeAddress_12                   0xCU
#define USART_CR2_ADD__NodeAddress_13                   0xDU
#define USART_CR2_ADD__NodeAddress_14                   0xEU
#define USART_CR2_ADD__NodeAddress_15                   0xFU

#define USART_CR2_LBDL__10_BitBreakDetection            0x0U
#define USART_CR2_LBDL__11_BitBreakDetection            0x1U

#define USART_CR2_LBDIE__LBD_IntrptDsbl                 0x0U
#define USART_CR2_LBDIE__LBD_IntrptEnbl                 0x1U

#define USART_CR2_LBCL__LastDataBitClockPulseNotOnCKpin 0x0U
#define USART_CR2_LBCL__LastDataBitClockPulseIsOnCKpin  0x1U

