pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define USART_CR2_CPHA__1stClock_FirstDataCapture       0x0U
#define USART_CR2_CPHA__2ndClock_FirstDataCapture       0x1U

#define USART_CR2_CPOL__CKpin_Low                       0x0U
#define USART_CR2_CPOL__CKpin_High                      0x1U

#define USART_CR2_CLKEN__CKpin_Enable                   0x0U
#define USART_CR2_CLKEN__CKpin_Disable                  0x1U

#define USART_CR2_STOP__1_StopBit                       0x0U
#define USART_CR2_STOP__0p5_StopBit                     0x1U
#define USART_CR2_STOP__2_StopBit                       0x2U
#define USART_CR2_STOP__1p5_StopBit                     0x3U

#define USART_CR2_LINEN__LINmode_Disable                0x0U
#define USART_CR2_LINEN__LINmode_Enable                 0x1U

// USART : CR3
#define USART_CR3_EIE__Error_IntrptDsbl                 0x0U
#define USART_CR3_EIE__Error_IntrptEnbl                 0x1U

#define USART_CR3_IREN__IrDA_Disable                    0x0U
#define USART_CR3_IREN__IrDA_Enable                     0x1U

#define USART_CR3_IRLP__NormalMode                      0x0U
#define USART_CR3_IRLP__LowPowerMode                    0x1U

#define USART_CR3_HDSEL__HalfDuplexMode_Not_Selected    0x0U
#define USART_CR3_HDSEL__HalfDuplexMode_Selected        0x1U

#define USART_CR3_NACK__NACK_Transmission_Disable       0x0U
#define USART_CR3_NACK__NACK_Transmission_Enable        0x1U

#define USART_CR3_SCEN__SmartCardMode_Disable           0x0U
#define USART_CR3_SCEN__SmartCardMode_Enable            0x1U

#define USART_CR3_DMAR__Reception_DMA_Disable           0x0U
#define USART_CR3_DMAR__Reception_DMA_Enable            0x1U

#define USART_CR3_DMAT__Transmission_DMA_Disable        0x0U
#define USART_CR3_DMAT__Transmission_DMA_Enable         0x1U

#define USART_CR3_RTSE__RTS_Disable                     0x0U
#define USART_CR3_RTSE__RTS_Enable                      0x1U

#define USART_CR3_CTSE__CTS_Disable                     0x0U
#define USART_CR3_CTSE__CTS_Enable                      0x1U

#define USART_CR3_CTSIE__CTS_IntrptDsbl                 0x0U
#define USART_CR3_CTSIE__CTS_IntrptEnbl                 0x1U

/*****************************************************************************
 ******     I2C
******************************************************************************/

// I2C : CR1
#define I2C_CR1_PE__Peripheral_Disable                  0x0U
#define I2C_CR1_PE__Peripheral_Enable                   0x1U

#define I2C_CR1_SMBUS__I2CMode                          0x0U
#define I2C_CR1_SMBUS__SMBusMode                        0x1U

#define I2C_CR1_SMBTYPE__SMBusDevice                    0x0U
#define I2C_CR1_SMBTYPE__SMBusHost                      0x1U

#define I2C_CR1_ENARP__ARP_Disable                      0x0U
#define I2C_CR1_ENARP__ARP_Enable                       0x1U

#define I2C_CR1_ENPEC__PEC_Calculation_Disable          0x0U
#define I2C_CR1_ENPEC__PEC_Calculation_Enable           0x1U

#define I2C_CR1_ENGC__GeneralCall_Disabled              0x0U
#define I2C_CR1_ENGC__GeneralCall_Enabled               0x1U

#define I2C_CR1_NOSTRETCH__ClockStretching_Enable       0x0U
#define I2C_CR1_NOSTRETCH__ClockStretching_Disable      0x1U

#define I2C_CR1_START__StartGeneration_Disable          0x0U
#define I2C_CR1_START__StartGeneration_Enable           0x1U

#define I2C_CR1_STOP__StopGeneration_Disable            0x0U
#define I2C_CR1_STOP__StopGeneration_Enable             0x1U

#define I2C_CR1_ACK__Acknowledge_Disable                0x0U
#define I2C_CR1_ACK__Acknowledge_Enable                 0x1U

#define I2C_CR1_POS__CurrentByte                        0x0U
#define I2C_CR1_POS__NextByte                           0x1U

#define I2C_CR1_PEC__NoPECtransfer                      0x0U
#define I2C_CR1_PEC__PECtransfer                        0x1U

#define I2C_CR1_ALERT__ReleasesSMBApinHigh              0x0U
#define I2C_CR1_ALERT__DrivesSMBApinLow                 0x1U

#define I2C_CR1_SWRST__I2C_Not_Under_Reset              0x0U
#define I2C_CR1_SWRST__I2C_Under_Reset                  0x1U

// I2C : CR2
#define I2C_CR2_ITERREN__Error_IntrptDsbl               0x0U
#define I2C_CR2_ITERREN__Error_IntrptEnbl               0x1U

#define I2C_CR2_ITEVTEN__Event_IntrptDsbl               0x0U
#define I2C_CR2_ITEVTEN__Event_IntrptEnbl               0x1U

#define I2C_CR2_ITBUFEN__Buffer_IntrptDsbl              0x0U
#define I2C_CR2_ITBUFEN__Buffer_IntrptEnbl              0x1U

#define I2C_CR2_DMAEN__DMA_Disable                      0x0U
#define I2C_CR2_DMAEN__DMA_Enable                       0x1U

#define I2C_CR2_LAST__DMA_EOT_Not_LastTransfer          0x0U
#define I2C_CR2_LAST__DMA_EOT_is_LastTransfer           0x1U

// I2C : OAR1
#define I2C_OAR1_ADDMODE__7_Bit_SlaveAddress            0x0U
#define I2C_OAR1_ADDMODE__10_Bit_SlaveAddress           0x1U

// I2C : OAR2
#define I2C_OAR2_ENDUAL__OnlyOAR1                       0x0U
#define I2C_OAR2_ENDUAL__OAR1_OAR2                      0x1U

// I2C : SR1
#define I2C_SR1_SB__NoStartCondition                    0x0U
#define I2C_SR1_SB__StartConditionGenerated             0x1U

#define I2C_SR1_ADDR__AddressMismatched                 0x0U
#define I2C_SR1_ADDR__ReivedAddressMatched              0x1U

#define I2C_SR1_BTF__Transfer_NotDone                   0x0U
#define I2C_SR1_BTF__Transfer_Succeeded                 0x1U

#define I2C_SR1_ADD10__NoADD10Event                     0x0U
#define I2C_SR1_ADD10__MasterSentFirstAddressByte       0x1U

#define I2C_SR1_STOPF__NoStopConditionDetected          0x0U
#define I2C_SR1_STOPF__StopConditionDetected            0x1U

#define I2C_SR1_RxNE__DataRegister_Empty                0x0U
#define I2C_SR1_RxNE__DataRegister_NotEmpty             0x1U

#define I2C_SR1_TxE__DataRegister_Empty                 0x0U
#define I2C_SR1_TxE__DataRegister_NotEmpty              0x1U

#define I2C_SR1_BERR__BERR_FlgClr                       0x0U
#define I2C_SR1_BERR__No_MisplacedStartOrStopCondition  0x0U
#define I2C_SR1_BERR__MisplacedStartOrStopCondition     0x1U

#define I2C_SR1_ARLO__ARLO_FlgClr                       0x0U
#define I2C_SR1_ARLO__No_ArbitrationLostDetected        0x0U
#define I2C_SR1_ARLO__ArbitrationLostDetected           0x1U

#define I2C_SR1_AF__AF_FlgClr                           0x0U
#define I2C_SR1_AF__No_AcknowledgeFailure               0x0U
#define I2C_SR1_AF__AcknowledgeFailure                  0x1U

#define I2C_SR1_OVR__Clear_OVR_Flag                     0x0U
#define I2C_SR1_OVR__No_OverrunOrUnderrun               0x0U
#define I2C_SR1_OVR__OverrunOrUnderrun                  0x1U

#define I2C_SR1_PECERR__PECERR_FlgClr                   0x0U
#define I2C_SR1_PECERR__No_PECerror                     0x0U
#define I2C_SR1_PECERR__PECerror                        0x1U

#define I2C_SR1_TIMEOUT__TIMEOUT_FlgClr                 0x0U
#define I2C_SR1_TIMEOUT__No_TimeOutError                0x0U
#define I2C_SR1_TIMEOUT__TimeOutError                   0x1U

#define I2C_SR1_SMBALERT__SMBALERT_FlgClr               0x0U
#define I2C_SR1_SMBALERT__No_SMBALERT                   0x0U
#define I2C_SR1_SMBALERT__SMBALERT_Occurred             0x1U

// I2C : SR2
#define I2C_SR2_MSL__SlaveMode                          0x0U
#define I2C_SR2_MSL__MasterMode                         0x1U

#define I2C_SR2_BUSY__No_Communication                  0x0U
#define I2C_SR2_BUSY__Ongoing_Communication             0x1U

