pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define I2C_SR2_TRA__DataBytes_Received                 0x0U
#define I2C_SR2_TRA__DataBytes_Transmitted              0x1U

#define I2C_SR2_GENCALL__No_GeneralCall                 0x0U
#define I2C_SR2_GENCALL__GeneralCallAddressReceived     0x1U

#define I2C_SR2_SMBDEFAULT__No_SMBusDeviceAddress       0x0U
#define I2C_SR2_SMBDEFAULT__SMBusDeviceAddress_Received 0x1U

#define I2C_SR2_SMBHOST__No_SMBusHostAddress            0x0U
#define I2C_SR2_SMBHOST__SMBusHostAddress_Received      0x1U

#define I2C_SR2_DUALF__ReceivedAddressMatched_OAR1      0x0U
#define I2C_SR2_DUALF__ReceivedAddressMatched_OAR2      0x1U

// I2C : CCR
#define I2C_CCR_FS__SM_Mode_I2C                         0x0U
#define I2c_CCR_FS__FM_Mode_I2C                         0x1U

#define I2C_CCR_DUTY__FM_Mode_tLow_div_tHigh_2          0x0U
#define I2C_CCR_DUTY__FM_Mode_tLow_div_tHigh_16div9     0x1U

/*****************************************************************************
 ******     SPI
******************************************************************************/

// SPI : CR1
#define SPI_CR1_CPHA__DataCaptureEdge_FirstClock        0x0U
#define SPI_CR1_CPHA__DataCaptureEdge_SecondClock       0x1U

#define SPI_CR1_CPOL__CKto0_WhenIdle                    0x0U
#define SPI_CR1_CPOL__CKto1_WhenIdle                    0x1U

#define SPI_CR1_MSTR__SlaveMode                         0x0U
#define SPI_CR1_MSTR__MasterMode                        0x1U

#define SPI_CR1_BR__BaudRate_PCLK_Div_2                 0x0U
#define SPI_CR1_BR__BaudRate_PCLK_Div_4                 0x1U
#define SPI_CR1_BR__BaudRate_PCLK_Div_8                 0x2U
#define SPI_CR1_BR__BaudRate_PCLK_Div_16                0x3U
#define SPI_CR1_BR__BaudRate_PCLK_Div_32                0x4U
#define SPI_CR1_BR__BaudRate_PCLK_Div_64                0x5U
#define SPI_CR1_BR__BaudRate_PCLK_Div_128               0x6U
#define SPI_CR1_BR__BaudRate_PCLK_Div_256               0x7U

#define SPI_CR1_SPE__Peripheral_Disable                 0x0U
#define SPI_CR1_SPE__Peripheral_Enable                  0x1U

#define SPI_CR1_LSBFIRST__MSB_TransmittedFirst          0x0U
#define SPI_CR1_LSBFIRST__LSB_TransmittedFirst          0x1U

#define SPI_CR1_SSI__NSS_Low                            0x0U
#define SPI_CR1_SSI__NSS_High                           0x1U

#define SPI_CR1_SSM__SoftwareSlaveManagement_Disable    0x0U
#define SPI_CR1_SSM__SoftwareSlaveManagement_Enable     0x1U

#define SPI_CR1_RXONLY__FullDuplex                      0x0U
#define SPI_CR1_RXONLY__Receive_Only                    0x1U

#define SPI_CR1_DFF__8_Bit_DataFrameFormat              0x0U
#define SPI_CR1_DFF__16_Bit_DataFrameFormat             0x1U

#define SPI_CR1_CRCNEXT__DataPhase                      0x0U
#define SPI_CR1_CRCNEXT__NextTransferIsCRC              0x1U

#define SPI_CR1_CRCEN__CRC_Calculation_Disable          0x0U
#define SPI_CR1_CRCEN__CRC_Calculation_Enable           0x1U

#define SPI_CR1_BIDIOE__OutputDisable_ReceiveOnly       0x0U
#define SPI_CR1_BIDIOE__OutputEnable_TransmitOnly       0x1U

#define SPI_CR1_BIDIMODE__2Line_UnidirectionalDataMode  0x0U
#define SPI_CR1_BIDIMODE__1Line_bidirectionalDataMode   0x1U

// SPI : CR2
#define SPI_CR2_RXDMAEN__RX_DMA_Disable                 0x0U
#define SPI_CR2_RXDMAEN__RX_DMA_Enable                  0x1U

#define SPI_CR2_TXDMAEN__TX_DMA_Disable                 0x0U
#define SPI_CR2_TXDMAEN__TX_DMA_Enable                  0x1U

#define SPI_CR2_SSOE__SS_Output_Disable                 0x0U
#define SPI_CR2_SSOE__SS_Output_Enable                  0x1U

#define SPI_CR2_ERRIE__Error_IntrptEnbl                 0x1U
#define SPI_CR2_ERRIE__Error_IntrptDsbl                 0x0U

#define SPI_CR2_RXNEIE__RXBUFF_not_empty_IntrptEnbl     0x1U
#define SPI_CR2_RXNEIE__RXBUFF_not_empty_IntrptDsbl     0x0U

#define SPI_CR2_TXEIE__TXBUFF_empty_IntrptEnbl          0x1U
#define SPI_CR2_TXEIE__TXBUFF_empty_IntrptDsbl          0x0U

// SPI : SR
#define SPI_SR_RXNE__RX_Buffer_Empty                    0x0U
#define SPI_SR_RXNE__RX_Buffer_NotEmpty                 0x1U

#define SPI_SR_TXE__TX_Buffer_NotEmpty                  0x0U
#define SPI_SR_TXE__TX_Buffer_Empty                     0x1U

#define SPI_SR_CHSIDE__Left_Channel                     0x0U
#define SPI_SR_CHSIDE__Right_Channel                    0x0U

#define SPI_SR_UDR__No_UnderrunOccurred	                0x0U
#define SPI_SR_UDR__UnderrunOccurred	                0x0U

#define SPI_SR_CRCERR__CRC_Match                        0x0U
#define SPI_SR_CRCERR__CRC_No_Match                     0x1U

#define SPI_SR_MODF__No_ModeFaultOccurred               0x0U
#define SPI_SR_MODF__ModeFaultOccurred                  0x1U

#define SPI_SR_OVR__No_OverrunOccurred                  0x0U
#define SPI_SR_OVR__OverrunOccurred                     0x1U

#define SPI_SR_BSY__SPI_I2S_NotBusy                     0x0U
#define SPI_SR_BSY__SPI_I2S_Busy                        0x1U

// SPI_I2S : SPI_I2SCFGR
#define SPI_SPI_I2SCFGR_I2SMOD__SPI_Mode                0x0U
#define SPI_SPI_I2SCFGR_I2SMOD__I2S_Mode                0x1U

#define SPI_SPI_I2SCFGR_I2SE__I2S_Disable               0x0U
#define SPI_SPI_I2SCFGR_I2SE__I2S_Enable                0x1U

#define SPI_SPI_I2SCFGR_I2SCFG__I2S_Slave_Transmit      0x0U
#define SPI_SPI_I2SCFGR_I2SCFG__I2S_Slave_Receive       0x1U
#define SPI_SPI_I2SCFGR_I2SCFG__I2S_Master_Transmit     0x2U
#define SPI_SPI_I2SCFGR_I2SCFG__I2S_Master_Receive      0x3U

#define SPI_SPI_I2SCFGR_PCMSYNC__ShortFrameSync         0x0U
#define SPI_SPI_I2SCFGR_PCMSYNC__LongFrameSync          0x1U

#define SPI_SPI_I2SCFGR_I2SSTD__I2S_Standard_Philips    0x0U
#define SPI_SPI_I2SCFGR_I2SSTD__I2S_Standard_MSB        0x1U
#define SPI_SPI_I2SCFGR_I2SSTD__I2S_Standard_LSB        0x2U
#define SPI_SPI_I2SCFGR_I2SSTD__I2S_Standard_PCM        0x3U

#define SPI_SPI_I2SCFGR_CKPOL_I2S_ClockSteadyState_Low  0x0U
#define SPI_SPI_I2SCFGR_CKPOL_I2S_ClockSteadyState_High 0x1U

#define SPI_SPI_I2SCFGR_DATLEN__DataLength_16_Bit       0x0U
#define SPI_SPI_I2SCFGR_DATLEN__DataLength_24_Bit       0x1U
#define SPI_SPI_I2SCFGR_DATLEN__DataLength_32_Bit       0x2U

