pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define SPI_SPI_I2SCFGR_CHLEN__ChannelLength_16_Bit     0x0U
#define SPI_SPI_I2SCFGR_CHLEN__ChannelLength_32_Bit     0x1U

// SPI : SPI_I2SPR
#define SPI_SPI_I2SPR_MCKOE__MasterClockOutput_Disable  0x0U
#define SPI_SPI_I2SPR_MCKOE__MasterClockOutput_Enable   0x1U

#define SPI_SPI_I2SPR_ODD__DividerValue_I2SDIVx2        0x0U
#define SPI_SPI_I2SPR_ODD__DividerValue_I2SDIVx2_Plus1  0x1U

/*****************************************************************************
 ******     USB
******************************************************************************/

// USB : CNTR
#define USB_CNTR_FRES__Clear_USB_Reset                  0x0U
#define USB_CNTR_FRES__Force_USB_Reset                  0x1U

#define USB_CNTR_PDWN__Exit_PowerDown                   0x0U
#define USB_CNTR_PDWN__Enter_PowerDown                  0x1U

#define USB_CNTR_LPMODE__No_LowPowerMode                0x0U
#define USB_CNTR_LPMODE__Enter_LowPowerMode             0x1U

#define USB_CNTR_FSUSP__Enter_SuspendMode               0x1U

#define USB_CNTR_RESUME__ResumeSignal_Deactive          0x0U
#define USB_CNTR_RESUME__ResumeSignal_Active            0x1U

#define USB_CNTR_ESOFM__ExpectedStartOfFrame_IntrptDsbl 0x0U
#define USB_CNTR_ESOFM__ExpectedStartOfFrame_IntrptEnbl 0x1U

#define USB_CNTR_SOFM__StartOfFrame_IntrptDsbl          0x0U
#define USB_CNTR_SOFM__StartOfFrame_IntrptEnbl          0x1U

#define USB_CNTR_RESETM__Reset_IntrptDsbl               0x0U
#define USB_CNTR_RESETM__Reset_IntrptEnbl               0x1U

#define USB_CNTR_SUSPM__SuspendMode_IntrptDsbl          0x0U
#define USB_CNTR_SUSPM__SuspendMode_IntrptEnbl          0x1U

#define USB_CNTR_WKUPM__WakeUp_IntrptDsbl               0x0U
#define USB_CNTR_WKUPM__WakeUp_IntrptEnbl               0x1U

#define USB_CNTR_ERRM__Error_IntrptDsbl                 0x0U
#define USB_CNTR_ERRM__Error_IntrptEnbl                 0x1U

#define USB_CNTR_PMAOVRM__PMAOVR_IntrptDsbl             0x0U
#define USB_CNTR_PMAOVRM__PMAOVR_IntrptEnbl             0x1U

#define USB_CNTR_CTRM__CorrectTransfer_IntrptDsbl       0x0U
#define USB_CNTR_CTRM__CorrectTransfer_IntrEnbl         0x1U

// USB : ISTR
#define USB_ISTR_EP_ID__EndPoint_0                      0x0U
#define USB_ISTR_EP_ID__EndPoint_1                      0x1U
#define USB_ISTR_EP_ID__EndPoint_2                      0x2U
#define USB_ISTR_EP_ID__EndPoint_3                      0x3U
#define USB_ISTR_EP_ID__EndPoint_4                      0x4U
#define USB_ISTR_EP_ID__EndPoint_5                      0x5U
#define USB_ISTR_EP_ID__EndPoint_6                      0x6U
#define USB_ISTR_EP_ID__EndPoint_7                      0x7U
#define USB_ISTR_EP_ID__EndPoint_8                      0x8U
#define USB_ISTR_EP_ID__EndPoint_9                      0x9U
#define USB_ISTR_EP_ID__EndPoint_10                     0xAU
#define USB_ISTR_EP_ID__EndPoint_11                     0xBU
#define USB_ISTR_EP_ID__EndPoint_12                     0xCU
#define USB_ISTR_EP_ID__EndPoint_13                     0xDU
#define USB_ISTR_EP_ID__EndPoint_14                     0xEU
#define USB_ISTR_EP_ID__EndPoint_15                     0xFU

#define USB_ISTR_DIR__Transmission                      0x0U
#define USB_ISTR_DIR__Reception                         0x1U

#define USB_ISTR_ESOF__ESOF_IntrptFlgRst                0x0U
#define USB_ISTR_ESOF__ESOF_IntrptFlgSt                 0x1U

#define USB_ISTR_SOF__SOF_IntrptFlgRst                  0x0U
#define USB_ISTR_SOF__SOF_IntrptFlgSt                   0x1U

#define USB_ISTR_RESET__Reset_IntrptFlgRst              0x0U
#define USB_ISTR_RESET__Reset_IntrptFlgSt               0x1U

#define USB_ISTR_SUSP__SuspendMode_IntrptFlgRst         0x0U
#define USB_ISTR_SUSP__SuspendMode_IntrptFlgSt          0x1U

#define USB_ISTR_WKUP__WakeUp_IntrptFlgRst              0x0U
#define USB_ISTR_WKUP__WakeUp_IntrptFlgSt               0x1U

#define USB_ISTR_ERR__Error_IntrptFlgRst                0x0U
#define USB_ISTR_ERR__Error_IntrptFlgSt                 0x1U

#define USB_ISTR_PMAOVR__PMAOVR_IntrptFlgRst            0x0U
#define USB_ISTR_PMAOVR__PMAOVR_IntrptFlgSt             0x1U

#define USB_ISTR_CTR__NoTransactionCmpltd               0x0U
#define USB_ISTR_CTR__EndPointCmpltdTransaction         0x1U

// Bit masks for clearing USB interrupt flags
#define USB_ISTR_ESOF__ESOF_IntrptFlgClr                0xFEFF
#define USB_ISTR_SOF__SOF_IntrptFlgClr                  0xFDFF
#define USB_ISTR_RESET__Reset_IntrptFlgClr              0xFBFF
#define USB_ISTR_SUSP__Suspend_IntrptFlgClr             0xF7FF
#define USB_ISTR_WKUP__WakeUp_IntrptFlgClr              0xEFFF
#define USB_ISTR_ERR__Error_IntrptFlgClr                0xDFFF

// USB : FNR
#define USB_FNR_LCK__unLocked                           0x0U
#define USB_FNR_LCK__Locked                             0x1U

#define USB_FNR_RXDM__RXDM_Reset                        0x0U
#define USB_FNR_RXDM__RXDM_Set                          0x1U

#define USB_FNR_RXDP__RXDP_Reset                        0x0U
#define USB_FNR_RXDP__RXDP_Set                          0x1U

#define USB_FNR_LSOF__LostSOF_0                         0x0U
#define USB_FNR_LSOF__LostSOF_1                         0x1U
#define USB_FNR_LSOF__LostSOF_2                         0x2U
#define USB_FNR_LSOF__LostSOF_3                         0x3U

// USB : DADDR
#define USB_DADDR_EF__USB_Function_Enable               0x1U
#define USB_DADDR_EF__USB_Function_Disable              0x0U

// USB : EPxR
#define USB_EPxR_EA__EndPointAddress_0                  0x0U
#define USB_EPxR_EA__EndPointAddress_1                  0x1U
#define USB_EPxR_EA__EndPointAddress_2                  0x2U
#define USB_EPxR_EA__EndPointAddress_3                  0x3U
#define USB_EPxR_EA__EndPointAddress_4                  0x4U
#define USB_EPxR_EA__EndPointAddress_5                  0x5U
#define USB_EPxR_EA__EndPointAddress_6                  0x6U
#define USB_EPxR_EA__EndPointAddress_7                  0x7U
#define USB_EPxR_EA__EndPointAddress_8                  0x8U
#define USB_EPxR_EA__EndPointAddress_9                  0x9U
#define USB_EPxR_EA__EndPointAddress_10                 0xAU
#define USB_EPxR_EA__EndPointAddress_11                 0xBU
#define USB_EPxR_EA__EndPointAddress_12                 0xCU
#define USB_EPxR_EA__EndPointAddress_13                 0xDU
#define USB_EPxR_EA__EndPointAddress_14                 0xEU
#define USB_EPxR_EA__EndPointAddress_15                 0xFU

#define USB_EPxR_STAT_TX__Disabled                      0x0U
#define USB_EPxR_STAT_TX__Stall                         0x1U
#define USB_EPxR_STAT_TX__NAK                           0x2U
#define USB_EPxR_STAT_TX__Valid                         0x3U

#define USB_EPxR_DTOG_TX__DataToggle_DATA0              0x0U
#define USB_EPxR_DTOG_TX__DataToggle_DATA1              0x1U

#define USB_EPxR_CTR_TX__CTR_TX_FlgClr                  0x0U
#define USB_EPxR_CTR_TX__TransmissionCorrectTransfer    0x1U

#define USB_EPxR_EP_KIND__Rst                           0x0U
#define USB_EPxR_EP_KIND__DoubleBuffer_Enable           0x1U
#define USB_EPxR_EP_KIND__ExpectedStatusOutTransaction  0x1U

