pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define USB_EPxR_EPTYPE__Bulk                           0x0U
#define USB_EPxR_EPTYPE__Control                        0x1U
#define USB_EPxR_EPTYPE__ISO                            0x2U
#define USB_EPxR_EPTYPE__Interrupt                      0x3U

#define USB_EPxR_SETUP__No_SetupTransaction             0x0U
#define USB_EPxR_SETUP__SetupTransactionCmpltd          0x1U

#define USB_EPxR_STAT_RX__Disabled                      0x0U
#define USB_EPxR_STAT_RX__Stall                         0x1U
#define USB_EPxR_STAT_RX__NAK                           0x2U
#define USB_EPxR_STAT_RX__Valid                         0x3U

#define USB_EPxR_DTOG_RX__DataToggle_DATA0              0x0U
#define USB_EPxR_DTOG_RX__DataToggle_DATA1              0x1U

#define USB_EPxR_CTR_RX__CTR_RX_Clear                   0x0U
#define USB_EPxR_CTR_RX__ReceptionCorrectTransfer       0x1U

// USB : COUNTn_RX
#define USB_COUNTn_RX_BLSIZE__2_Bytes_MemoryBlock       0x0U
#define USB_COUNTn_RX_BLSIZE__32_Bytes_MemoryBlock      0x1U

#define USB_COUNTn_RX_NUM_BLOCK__0_Block                0x0U
#define USB_COUNTn_RX_NUM_BLOCK__1_Block                0x1U
#define USB_COUNTn_RX_NUM_BLOCK__2_Blocks               0x2U
#define USB_COUNTn_RX_NUM_BLOCK__3_Blocks               0x3U
#define USB_COUNTn_RX_NUM_BLOCK__4_Blocks               0x4U
#define USB_COUNTn_RX_NUM_BLOCK__5_Blocks               0x5U
#define USB_COUNTn_RX_NUM_BLOCK__6_Blocks               0x6U
#define USB_COUNTn_RX_NUM_BLOCK__7_Blocks               0x7U
#define USB_COUNTn_RX_NUM_BLOCK__8_Blocks               0x8U
#define USB_COUNTn_RX_NUM_BLOCK__9_Blocks               0x9U
#define USB_COUNTn_RX_NUM_BLOCK__10_Blocks              0xAU
#define USB_COUNTn_RX_NUM_BLOCK__11_Blocks              0xBU
#define USB_COUNTn_RX_NUM_BLOCK__12_Blocks              0xCU
#define USB_COUNTn_RX_NUM_BLOCK__13_Blocks              0xDU
#define USB_COUNTn_RX_NUM_BLOCK__14_Blocks              0xEU
#define USB_COUNTn_RX_NUM_BLOCK__15_Blocks              0xFU
#define USB_COUNTn_RX_NUM_BLOCK__16_Blocks              0x10U
#define USB_COUNTn_RX_NUM_BLOCK__17_Blocks              0x12U
#define USB_COUNTn_RX_NUM_BLOCK__18_Blocks              0x13U
#define USB_COUNTn_RX_NUM_BLOCK__19_Blocks              0x14U
#define USB_COUNTn_RX_NUM_BLOCK__20_Blocks              0x15U
#define USB_COUNTn_RX_NUM_BLOCK__21_Blocks              0x16U
#define USB_COUNTn_RX_NUM_BLOCK__22_Blocks              0x17U
#define USB_COUNTn_RX_NUM_BLOCK__23_Blocks              0x18U
#define USB_COUNTn_RX_NUM_BLOCK__24_Blocks              0x19U
#define USB_COUNTn_RX_NUM_BLOCK__25_Blocks              0x1AU
#define USB_COUNTn_RX_NUM_BLOCK__26_Blocks              0x1BU
#define USB_COUNTn_RX_NUM_BLOCK__27_Blocks              0x1CU
#define USB_COUNTn_RX_NUM_BLOCK__28_Blocks              0x1DU
#define USB_COUNTn_RX_NUM_BLOCK__29_Blocks              0x1EU
#define USB_COUNTn_RX_NUM_BLOCK__30_Blocks              0x1FU
#define USB_COUNTn_RX_NUM_BLOCK__31_Blocks              0x20U


// USB : COUNTn_TX
#define USB_COUNTn_TX_BLSIZE_0__2_Bytes_MemoryBlock     0x0U
#define USB_COUNTn_TX_BLSIZE_0__32_Bytes_MemoryBlock    0x1U

#define USB_COUNTn_TX_BLSIZE_1__2_Bytes_MemoryBlock     0x0U
#define USB_COUNTn_TX_BLSIZE_1__32_Bytes_MemoryBlock    0x1U

#define USB_COUNTn_TX_NUM_BLOCK_0__0_Block              0x0U
#define USB_COUNTn_TX_NUM_BLOCK_0__1_Block              0x1U
#define USB_COUNTn_TX_NUM_BLOCK_0__2_Blocks             0x2U
#define USB_COUNTn_TX_NUM_BLOCK_0__3_Blocks             0x3U
#define USB_COUNTn_TX_NUM_BLOCK_0__4_Blocks             0x4U
#define USB_COUNTn_TX_NUM_BLOCK_0__5_Blocks             0x5U
#define USB_COUNTn_TX_NUM_BLOCK_0__6_Blocks             0x6U
#define USB_COUNTn_TX_NUM_BLOCK_0__7_Blocks             0x7U
#define USB_COUNTn_TX_NUM_BLOCK_0__8_Blocks             0x8U
#define USB_COUNTn_TX_NUM_BLOCK_0__9_Blocks             0x9U
#define USB_COUNTn_TX_NUM_BLOCK_0__10_Blocks            0xAU
#define USB_COUNTn_TX_NUM_BLOCK_0__11_Blocks            0xBU
#define USB_COUNTn_TX_NUM_BLOCK_0__12_Blocks            0xCU
#define USB_COUNTn_TX_NUM_BLOCK_0__13_Blocks            0xDU
#define USB_COUNTn_TX_NUM_BLOCK_0__14_Blocks            0xEU
#define USB_COUNTn_TX_NUM_BLOCK_0__15_Blocks            0xFU
#define USB_COUNTn_TX_NUM_BLOCK_0__16_Blocks            0x10U
#define USB_COUNTn_TX_NUM_BLOCK_0__17_Blocks            0x12U
#define USB_COUNTn_TX_NUM_BLOCK_0__18_Blocks            0x13U
#define USB_COUNTn_TX_NUM_BLOCK_0__19_Blocks            0x14U
#define USB_COUNTn_TX_NUM_BLOCK_0__20_Blocks            0x15U
#define USB_COUNTn_TX_NUM_BLOCK_0__21_Blocks            0x16U
#define USB_COUNTn_TX_NUM_BLOCK_0__22_Blocks            0x17U
#define USB_COUNTn_TX_NUM_BLOCK_0__23_Blocks            0x18U
#define USB_COUNTn_TX_NUM_BLOCK_0__24_Blocks            0x19U
#define USB_COUNTn_TX_NUM_BLOCK_0__25_Blocks            0x1AU
#define USB_COUNTn_TX_NUM_BLOCK_0__26_Blocks            0x1BU
#define USB_COUNTn_TX_NUM_BLOCK_0__27_Blocks            0x1CU
#define USB_COUNTn_TX_NUM_BLOCK_0__28_Blocks            0x1DU
#define USB_COUNTn_TX_NUM_BLOCK_0__29_Blocks            0x1EU
#define USB_COUNTn_TX_NUM_BLOCK_0__30_Blocks            0x1FU
#define USB_COUNTn_TX_NUM_BLOCK_0__31_Blocks            0x20U

#define USB_COUNTn_TX_NUM_BLOCK_1__0_Block              0x0U
#define USB_COUNTn_TX_NUM_BLOCK_1__1_Block              0x1U
#define USB_COUNTn_TX_NUM_BLOCK_1__2_Blocks             0x2U
#define USB_COUNTn_TX_NUM_BLOCK_1__3_Blocks             0x3U
#define USB_COUNTn_TX_NUM_BLOCK_1__4_Blocks             0x4U
#define USB_COUNTn_TX_NUM_BLOCK_1__5_Blocks             0x5U
#define USB_COUNTn_TX_NUM_BLOCK_1__6_Blocks             0x6U
#define USB_COUNTn_TX_NUM_BLOCK_1__7_Blocks             0x7U
#define USB_COUNTn_TX_NUM_BLOCK_1__8_Blocks             0x8U
#define USB_COUNTn_TX_NUM_BLOCK_1__9_Blocks             0x9U
#define USB_COUNTn_TX_NUM_BLOCK_1__10_Blocks            0xAU
#define USB_COUNTn_TX_NUM_BLOCK_1__11_Blocks            0xBU
#define USB_COUNTn_TX_NUM_BLOCK_1__12_Blocks            0xCU
#define USB_COUNTn_TX_NUM_BLOCK_1__13_Blocks            0xDU
#define USB_COUNTn_TX_NUM_BLOCK_1__14_Blocks            0xEU
#define USB_COUNTn_TX_NUM_BLOCK_1__15_Blocks            0xFU
#define USB_COUNTn_TX_NUM_BLOCK_1__16_Blocks            0x10U
#define USB_COUNTn_TX_NUM_BLOCK_1__17_Blocks            0x12U
#define USB_COUNTn_TX_NUM_BLOCK_1__18_Blocks            0x13U
#define USB_COUNTn_TX_NUM_BLOCK_1__19_Blocks            0x14U
#define USB_COUNTn_TX_NUM_BLOCK_1__20_Blocks            0x15U
#define USB_COUNTn_TX_NUM_BLOCK_1__21_Blocks            0x16U
#define USB_COUNTn_TX_NUM_BLOCK_1__22_Blocks            0x17U
#define USB_COUNTn_TX_NUM_BLOCK_1__23_Blocks            0x18U
#define USB_COUNTn_TX_NUM_BLOCK_1__24_Blocks            0x19U
#define USB_COUNTn_TX_NUM_BLOCK_1__25_Blocks            0x1AU
#define USB_COUNTn_TX_NUM_BLOCK_1__26_Blocks            0x1BU
#define USB_COUNTn_TX_NUM_BLOCK_1__27_Blocks            0x1CU
#define USB_COUNTn_TX_NUM_BLOCK_1__28_Blocks            0x1DU
#define USB_COUNTn_TX_NUM_BLOCK_1__29_Blocks            0x1EU
#define USB_COUNTn_TX_NUM_BLOCK_1__30_Blocks            0x1FU
#define USB_COUNTn_TX_NUM_BLOCK_1__31_Blocks            0x20U

/*****************************************************************************
 ******     CAN
******************************************************************************/

