pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
// CAN : MCR
#define CAN_MCR_INRQ__NormalMode                        0x0U
#define CAN_MCR_INRQ__InitializationMode                0x1U

#define CAN_MCR_SLEEP__Exit_SleepMode                   0x0U
#define CAN_MCR_SLEEP__Enter_SleepMode                  0x1U

#define CAN_MCR_TXFP__MessageIdentifier                 0x0U
#define CAN_MCR_TXFP__RequestOrder                      0x1U

#define CAN_MCR_RFLM__ReceiveFIFO_NoLoackedOnOverrun    0x0U
#define CAN_MCR_RFLM__ReceiveFIFO_LoackedOnOverrun      0x1U

#define CAN_MCR_NART__AutomaticTransaction              0x0U
#define CAN_MCR_NART__No_AutomaticTransaction           0x1U

#define CAN_MCR_AWUM__Software_SleepMode                0x0U
#define CAN_MCR_AWUM__Hardware_SleepMode                0x1U

#define CAN_MCR_ABOM__Software_BusOff                   0x0U
#define CAN_MCR_ABOM__Hardware_BusOff                   0x1U

#define CAN_MCR_TTCM__TimeTriggeredCommunication_Disable      0x0U
#define CAN_MCR_TTCM__TimeTriggeredCommunication_Enable       0x1U

#define CAN_MCR_RESET__NormalOperatoin                  0x0U
#define CAN_MCR_RESET__ForceReset                       0x1U

#define CAN_MCR_DBF__CAN_WorkingDuringDebug             0x0U
#define CAN_MCR_DBF__CAN_FrozenDuringDebug              0x1U

// CAN : MSR
#define CAN_MSR_INAK__In_NormalMode                     0x0U
#define CAN_MSR_INAK__In_InitializationMode             0x1U

#define CAN_MSR_SLAK__In_NormalMode                     0x0U
#define CAN_MSR_SLAK__In_SleepMode                      0x1U

#define CAN_MSR_ERRI__CAN_NoErrorOccurred               0x0U
#define CAN_MSR_ERRI__CAN_ErrorOccurred                 0x1U
#define CAN_MSR_ERRI__ERRI_FlgClr                       0x1U

#define CAN_MSR_WKUI__CAN_NotWakedUp                    0x0U
#define CAN_MSR_WKUI__CAN_WakedUp                       0x1U
#define CAN_MSR_WKUI__WKUI_FlgClr                       0x1U

#define CAN_MSR_SLAKI__CAN_EnteredSleepMode             0x1U
#define CAN_MSR_SLAKI__CAN_NotInSleepMode               0x1U
#define CAN_MSR_SLAKI__SLAKI_FlgClr                     0x1U

#define CAN_MSR_TXM__CAN_Not_Transmitter                0x0U
#define CAN_MSR_TXM__CAN_Is_Transmitter                 0x1U

#define CAN_MSR_RXM__CAN_Not_Receiver                   0x0U
#define CAN_MSR_RXM__CAN_Is_Receiver                    0x1U

#define CAN_MSR_SAMP__RX_LastSamplePoint_Was_Reset      0x0U
#define CAN_MSR_SAMP__RX_LastSamplePoint_Was_Set        0x1U

#define CAN_MSR_RX__RX_Pin_Is_Reset                     0x0U
#define CAN_MSR_RX__RX_Pin_Is_Set                       0x1U


// CAN : TSR
#define CAN_TSR_RQCP0__MailBox0_LastRequestPerformed    0x1U
#define CAN_TSR_RQCP0__MailBox0_RQCP0_FlgClr            0x1U

#define CAN_TSR_TXOK0__MailBox0_Transmission_Failed     0x0U
#define CAN_TSR_TXOK0__MailBox0_Transmission_Ok         0x1U

#define CAN_TSR_ALST0__MailBox0_TX_Failed_ArbitrationLost     0x1U
#define CAN_TSR_ALST0__MailBox0_ALST0_FlgClr                  0x1U

#define CAN_TSR_TERR0__MailBox0_TX_Failed_Error         0x1U
#define CAN_TSR_TERR0__MailBox0_TERR0_FlgClr            0x1U

#define CAN_TSR_ABRQ0__MailBox0_AbortTransmissionRequest      0x1U
#define CAN_TSR_ABRQ0__MailBox0_Empty                         0x0U

#define CAN_TSR_RQCP1__MailBox1_LastRequestPerformed    0x1U
#define CAN_TSR_RQCP1__MailBox1_RQCP0_FlgClr            0x1U

#define CAN_TSR_TXOK1__MailBox1_Transmission_Failed     0x0U
#define CAN_TSR_TXOK1__MailBox1_Transmission_Ok         0x1U

#define CAN_TSR_ALST1__MailBox1_TX_Failed_ArbitrationLost     0x1U
#define CAN_TSR_ALST1__MailBox1_ALST0_FlgClr                  0x1U

#define CAN_TSR_TERR1__MailBox1_TX_Failed_Error         0x1U
#define CAN_TSR_TERR1__MailBox1_TERR0_FlgClr            0x1U

#define CAN_TSR_ABRQ1__MailBox1_AbortTransmissionRequest      0x1U
#define CAN_TSR_ABRQ1__MailBox1_Empty                         0x0U

#define CAN_TSR_RQCP2__MailBox2_LastRequestPerformed    0x1U
#define CAN_TSR_RQCP2__MailBox2_RQCP0_FlgClr            0x1U

#define CAN_TSR_TXOK2__MailBox2_Transmission_Failed     0x0U
#define CAN_TSR_TXOK2__MailBox2_Transmission_Ok         0x1U

#define CAN_TSR_ALST2__MailBox2_TX_Failed_ArbitrationLost     0x1U
#define CAN_TSR_ALST2__MailBox2_ALST0_FlgClr                  0x1U

#define CAN_TSR_TERR2__MailBox2_TX_Failed_Error         0x1U
#define CAN_TSR_TERR2__MailBox2_TERR0_FlgClr            0x1U

#define CAN_TSR_ABRQ2__MailBox2_AbortTransmissionRequest      0x1U
#define CAN_TSR_ABRQ2__MailBox2_Empty                         0x0U

#define CAN_TSR_CODE__       0x0U
//#define CAN_TSR_CODE__       0x1U

#define CAN_TSR_TME0__MailBox0_NoTransmitRequestPending       0x1U
#define CAN_TSR_TME1__MailBox1_NoTransmitRequestPending       0x1U
#define CAN_TSR_TME2__MailBox2_NoTransmitRequestPending       0x1U

#define CAN_TSR_LOW0__       0x1U
#define CAN_TSR_LOW1__       0x1U
#define CAN_TSR_LOW2__       0x1U

// CAN : RF0R
#define CAN_RF0R_FMP0__FIFO0_0_MessagePending            0x0U
#define CAN_RF0R_FMP0__FIFO0_1_MessagePending            0x1U
#define CAN_RF0R_FMP0__FIFO0_2_MessagePending            0x2U
#define CAN_RF0R_FMP0__FIFO0_3_MessagePending            0x3U

#define CAN_RF0R_FULL0__FIFO0_3_Messages_Stored          0x1U
#define CAN_RF0R_FULL0__FULL0_Clear                      0x1U

#define CAN_RF0R_FOVR0__FIFO0_Receiver_OverRun           0x1U
#define CAN_RF0R_FOVR0__FOVR0_Clear                      0x1U

#define CAN_RF0R_RFOM0__Release_FIFO0_OutputMailBox      0x1U

// CAN : RF0R
#define CAN_RF1R_FMP1__FIFO1_0_MessagePending            0x0U
#define CAN_RF1R_FMP1__FIFO1_1_MessagePending            0x1U
#define CAN_RF1R_FMP1__FIFO1_2_MessagePending            0x2U
#define CAN_RF1R_FMP1__FIFO1_3_MessagePending            0x3U

#define CAN_RF1R_FULL1__FIFO1_3_Messages_Stored          0x1U
#define CAN_RF1R_FULL1__FULL1_Clear                      0x1U

#define CAN_RF1R_FOVR1__FIFO1_Receiver_OverRun           0x1U
#define CAN_RF1R_FOVR1__FOVR1_Clear                      0x1U

#define CAN_RF1R_RFOM1__Release_FIFO1_OutputMailBox      0x1U

// CAN : IER
#define CAN_IER_TMEIE__TransmitMailboxEmpty_IntrptDsbl         0x0U
#define CAN_IER_TMEIE__TransmitMailboxEmpty_IntrptEnbl          0x1U

