pointer-x/stm32f103c8_RCC_CMSIS_bitfields/Core/include/stm32f103c8_BitDescription.h
#define CAN_IER_FMPIE0__FIFO0_MessagePending_IntrptDsbl        0x0U
#define CAN_IER_FMPIE0__FIFO0_MessagePending_IntrptEnbl         0x1U

#define CAN_IER_FFIE0__FIFO0_Full_IntrptDsbl                   0x0U
#define CAN_IER_FFIE0__FIFO0_Full_IntrptEnbl                    0x1U

#define CAN_IER_FOVIE0__FIFO0_Overrun_IntrptDsbl               0x0U
#define CAN_IER_FOVIE0__FIFO0_Overrun_IntrptEnbl                0x1U

#define CAN_IER_FMPIE1__FIFO1_MessagePending_IntrptDsbl        0x0U
#define CAN_IER_FMPIE1__FIFO1_MessagePending_IntrptEnbl         0x1U

#define CAN_IER_FFIE1__FIFO1_Full_IntrptDsbl                   0x0U
#define CAN_IER_FFIE1__FIFO1_Full_IntrptEnbl                    0x1U

#define CAN_IER_FOVIE1__FIFO1_Overrun_IntrptDsbl               0x0U
#define CAN_IER_FOVIE1__FIFO1_Overrun_IntrptEnbl                0x1U

#define CAN_IER_EWGIE__ErrorWarning_IntrptDsbl                 0x0U
#define CAN_IER_EWGIE__ErrorWarning_IntrptEnbl                  0x1U

#define CAN_IER_EPVIE__ErrorPhase_IntrptDsbl                   0x0U
#define CAN_IER_EPVIE__ErrorPhase_IntrptEnbl                    0x1U

#define CAN_IER_BOFIE__BusOff_IntrptDsbl                       0x0U
#define CAN_IER_BOFIE__BusOff_IntrptEnbl                        0x1U

#define CAN_IER_LECIE__LastErrorCode_IntrptDsbl                0x0U
#define CAN_IER_LECIE__LastErrorCode_IntrptEnbl                 0x1U

#define CAN_IER_ERRIE__Error_IntrptDsbl                        0x0U
#define CAN_IER_ERRIE__Error_IntrptEnbl                         0x1U

#define CAN_IER_WKUIE__Wakeup_IntrptDsbl                       0x0U
#define CAN_IER_WKUIE__Wakeup_IntrptEnbl                        0x1U

#define CAN_IER_SLKIE__Sleep_IntrptDsbl                        0x0U
#define CAN_IER_SLKIE__Sleep_IntrptEnbl                         0x1U

// CAN : ESR
#define CAN_ESR_EWGF__                          0x0U
#define CAN_ESR_EWGF__WarningLimitReached       0x1U

#define CAN_ESR_EPVF__                                0x0U
#define CAN_ESR_EPVF__ErrorPassiveLimitReached       0x1U

#define CAN_ESR_BOFF__       0x0U
#define CAN_ESR_BOFF__EnterBusOffState       0x1U

#define CAN_ESR_LEC__LastErrorCode_NoError               0x0U
#define CAN_ESR_LEC__LastErrorCode_Stuff                 0x1U
#define CAN_ESR_LEC__LastErrorCode_Form                  0x2U
#define CAN_ESR_LEC__LastErrorCode_Acknowledgmnt         0x3U
#define CAN_ESR_LEC__LastErrorCode_BitRecessive          0x4U
#define CAN_ESR_LEC__LastErrorCode_BitDominant           0x5U
#define CAN_ESR_LEC__LastErrorCode_CRC                   0x6U
#define CAN_ESR_LEC__LastErrorCode_SetBySoftware         0x7U


// CAN : BTR
#define CAN_BTR_LBKM__LoopBackMode_Disable               0x0U
#define CAN_BTR_LBKM__LoopBackMode_Enable                0x1U

#define CNA_BTR_SILM__NormalOperation                    0x0U
#define CNA_BTR_SILM__SilentMode                         0x0U

// CAN : TI0R
#define CAN_TI0R_TXRQ__MailBox0_RequestTransmit          0x0U
#define CAN_TI0R_TXRQ__MailBox0_Empty                    0x1U

#define CAN_TI0R_IDE__MailBox0_Standard_Identifier       0x0U
#define CAN_TI0R_IDE__MailBox0_Extended_Identifier       0x1U

#define CAN_TI0R_RTR__MailBox0_Data_Frame                0x0U
#define CAN_TI0R_RTR__MailBox0_Remote_Frame              0x1U

// CAN : TI1R
#define CAN_TI1R_TXRQ__MailBox1_RequestTransmit          0x0U
#define CAN_TI1R_TXRQ__MailBox1_Empty                    0x1U

#define CAN_TI1R_IDE__MailBox1_Standard_Identifier       0x0U
#define CAN_TI1R_IDE__MailBox1_Extended_Identifier       0x1U

#define CAN_TI1R_RTR__MailBox1_Data_Frame                0x0U
#define CAN_TI1R_RTR__MailBox1_Remote_Frame              0x1U

// CAN : TI2R
#define CAN_TI2R_TXRQ__MailBox2_RequestTransmit          0x0U
#define CAN_TI2R_TXRQ__MailBox2_Empty                    0x1U

#define CAN_TI2R_IDE__MailBox2_Standard_Identifier       0x0U
#define CAN_TI2R_IDE__MailBox2_Extended_Identifier       0x1U

#define CAN_TI2R_RTR__MailBox2_Data_Frame                0x0U
#define CAN_TI2R_RTR__MailBox2_Remote_Frame              0x1U


// CAN : TDT0R
#define CAN_TDT0R_DLC__MailBox0_0_Byte_DataFrame         0x0U
#define CAN_TDT0R_DLC__MailBox0_1_Byte_DataFrame         0x1U
#define CAN_TDT0R_DLC__MailBox0_2_Byte_DataFrame         0x2U
#define CAN_TDT0R_DLC__MailBox0_3_Byte_DataFrame         0x3U
#define CAN_TDT0R_DLC__MailBox0_4_Byte_DataFrame         0x4U
#define CAN_TDT0R_DLC__MailBox0_5_Byte_DataFrame         0x5U
#define CAN_TDT0R_DLC__MailBox0_6_Byte_DataFrame         0x6U
#define CAN_TDT0R_DLC__MailBox0_7_Byte_DataFrame         0x7U
#define CAN_TDT0R_DLC__MailBox0_8_Byte_DataFrame         0x8U

// CAN : TDT1R
#define CAN_TDT1R_DLC__MailBox1_0_Byte_DataFrame         0x0U
#define CAN_TDT1R_DLC__MailBox1_1_Byte_DataFrame         0x1U
#define CAN_TDT1R_DLC__MailBox1_2_Byte_DataFrame         0x2U
#define CAN_TDT1R_DLC__MailBox1_3_Byte_DataFrame         0x3U
#define CAN_TDT1R_DLC__MailBox1_4_Byte_DataFrame         0x4U
#define CAN_TDT1R_DLC__MailBox1_5_Byte_DataFrame         0x5U
#define CAN_TDT1R_DLC__MailBox1_6_Byte_DataFrame         0x6U
#define CAN_TDT1R_DLC__MailBox1_7_Byte_DataFrame         0x7U
#define CAN_TDT1R_DLC__MailBox1_8_Byte_DataFrame         0x8U

// CAN : TDT2R
#define CAN_TDT2R_DLC__MailBox2_0_Byte_DataFrame         0x0U
#define CAN_TDT2R_DLC__MailBox2_1_Byte_DataFrame         0x1U
#define CAN_TDT2R_DLC__MailBox2_2_Byte_DataFrame         0x2U
#define CAN_TDT2R_DLC__MailBox2_3_Byte_DataFrame         0x3U
#define CAN_TDT2R_DLC__MailBox2_4_Byte_DataFrame         0x4U
#define CAN_TDT2R_DLC__MailBox2_5_Byte_DataFrame         0x5U
#define CAN_TDT2R_DLC__MailBox2_6_Byte_DataFrame         0x6U
#define CAN_TDT2R_DLC__MailBox2_7_Byte_DataFrame         0x7U
#define CAN_TDT2R_DLC__MailBox2_8_Byte_DataFrame         0x8U



#define CAN_TDT0R_TGT__TimeStamp_NotSent                 0x0U
#define CAN_TDT0R_TGT__Send_TimeStamp                    0x1U




#define SET_BIT(REG, BIT)                    ((REG) |= (BIT))
#define CLEAR_BIT(REG, BIT)                  ((REG) &= ~(BIT))
#define READ_BIT(REG, BIT)                   ((REG) & (BIT))
#define CLEAR_REG(REG)                       ((REG) = (0x0))
#define WRITE_REG(REG, VAL)                  ((REG) = (VAL))
#define READ_REG(REG)                        ((REG))
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))
#define POSITION_VAL(VAL)                    (__CLZ(__RBIT(VAL)))
